{
  "year": 2021,
  "total": 31,
  "reference": "mozilla.org",
  "reports": {
    "CVE-2021-23959": [
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-03/",
        "description": "An XSS bug in internal error pages could have led to various spoofing attacks, including other error pages and the address bar.Note: This issue only affected Firefox for Android. Other operating systems are unaffected."
      }
    ],
    "CVE-2021-23964": [
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-04/",
        "description": "Mozilla developers Alexis Beingessner, Christian Holler, Andrew McCreight, Tyson Smith, Jon Coppeard, André Bargull, Jason Kratzer, Jesse Schwartzentruber, Steve Fink, Byron Campen reported memory safety bugs present in Firefox 84 and Firefox ESR 78.6. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code."
      },
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-05/",
        "description": "Mozilla developers Alexis Beingessner, Christian Holler, Andrew McCreight, Tyson Smith, Jon Coppeard, André Bargull, Jason Kratzer, Jesse Schwartzentruber, Steve Fink, Byron Campen reported memory safety bugs present in Thunderbird 78.6. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code."
      },
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-03/",
        "description": "Mozilla developers Andrew McCreight, Tyson Smith, Jesse Schwartzentruber, Jon Coppeard, Byron Campen, André Bargull, Steve Fink, Jason Kratzer, Christian Holler, Alexis Beingessner reported memory safety bugs present in Firefox 84 and Firefox ESR 78.6. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code."
      }
    ],
    "CVE-2021-23965": [
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-03/",
        "description": "Mozilla developers Sebastian Hengst, Christian Holler, Tyson Smith reported memory safety bugs present in Firefox 84. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code."
      }
    ],
    "CVE-2021-23979": [
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-07/",
        "description": "Mozilla developers Tyson Smith, Lars T Hansen, Valentin Gosu, and Sebastian Hengst reported memory safety bugs present in Firefox 85. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code."
      }
    ],
    "CVE-2021-23981": [
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-11/",
        "description": "A texture upload of a Pixel Buffer Object could have confused the WebGL code to skip binding the buffer used to unpack it, resulting in memory corruption and a potentially exploitable information leak or crash."
      },
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-12/",
        "description": "A texture upload of a Pixel Buffer Object could have confused the WebGL code to skip binding the buffer used to unpack it, resulting in memory corruption and a potentially exploitable information leak or crash."
      },
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-10/",
        "description": "A texture upload of a Pixel Buffer Object could have confused the WebGL code to skip binding the buffer used to unpack it, resulting in memory corruption and a potentially exploitable information leak or crash."
      }
    ],
    "CVE-2021-23983": [
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-10/",
        "description": "By causing a transition on a parent node by removing a CSS rule, an invalid property for a marker could have been applied, resulting in memory corruption and a potentially exploitable crash."
      }
    ],
    "CVE-2021-23987": [
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-11/",
        "description": "Mozilla developers and community members Alexis Beingessner, Tyson Smith, Julien Wajsberg, and Matthew Gregan reported memory safety bugs present in Firefox 86 and Firefox ESR 78.8. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code."
      },
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-12/",
        "description": "Mozilla developers and community members Alexis Beingessner, Tyson Smith, Julien Wajsberg, and Matthew Gregan reported memory safety bugs present in Thunderbird 78.8. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code."
      },
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-10/",
        "description": "Mozilla developers and community members Matthew Gregan, Tyson Smith, Julien Wajsberg, and Alexis Beingessner reported memory safety bugs present in Firefox 86 and Firefox ESR 78.8. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code."
      }
    ],
    "CVE-2021-23988": [
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-10/",
        "description": "Mozilla developers Tyson Smith and Christian Holler reported memory safety bugs present in Firefox 86. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code."
      }
    ],
    "CVE-2021-23999": [
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-15/",
        "description": "If a Blob URL was loaded through some unusual user interaction, it could have been loaded by the System Principal and granted additional privileges that should not be granted to web content."
      },
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-16/",
        "description": "If a Blob URL was loaded through some unusual user interaction, it could have been loaded by the System Principal and granted additional privileges that should not be granted to web content."
      },
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-14/",
        "description": "If a Blob URL was loaded through some unusual user interaction, it could have been loaded by the System Principal and granted additional privileges that should not be granted to web content."
      }
    ],
    "CVE-2021-29944": [
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-16/",
        "description": "Lack of escaping allowed HTML injection when a webpage was viewed in Reader View. While a Content Security Policy prevents direct code execution, HTML injection is still possible.Note: This issue only affected Firefox for Android. Other operating systems are unaffected."
      }
    ],
    "CVE-2021-29946": [
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-15/",
        "description": "Ports that were written as an integer overflow above the bounds of a 16-bit integer could have bypassed port blocking restrictions when used in the Alt-Svc header."
      },
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-16/",
        "description": "Ports that were written as an integer overflow above the bounds of a 16-bit integer could have bypassed port blocking restrictions when used in the Alt-Svc header."
      },
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-14/",
        "description": "Ports that were written as an integer overflow above the bounds of a 16-bit integer could have bypassed port blocking restrictions when used in the Alt-Svc header."
      }
    ],
    "CVE-2021-29947": [
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-16/",
        "description": "Mozilla developers and community members Ryan VanderMeulen, Sean Feng, Tyson Smith, Julian Seward, Christian Holler reported memory safety bugs present in Firefox 87. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code."
      }
    ],
    "CVE-2021-29953": [
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-20/",
        "description": "A malicious webpage could have forced a Firefox for Android user into executing attacker-controlled JavaScript in the context of another domain, resulting in a Universal Cross-Site Scripting vulnerability.Note: This issue only affected Firefox for Android. Other operating systems are unaffected. Further details are being temporarily withheld to allow users an opportunity to update."
      }
    ],
    "CVE-2021-29964": [
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-23/",
        "description": "A locally-installed hostile program could send WM_COPYDATA messages that Firefox would process incorrectly, leading to an out-of-bounds read. This bug only affects Firefox on Windows. Other operating systems are unaffected."
      },
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-24/",
        "description": "A locally-installed hostile program could send WM_COPYDATA messages that Firefox would processing incorrectly, leading to an out-of-bounds read. This bug only affects Firefox on Windows. Other operating systems are unaffected."
      },
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-26/",
        "description": "A locally-installed hostile program could send WM_COPYDATA messages that Thunderbird would processing incorrectly, leading to an out-of-bounds read. This bug only affects Thunderbird on Windows. Other operating systems are unaffected."
      }
    ],
    "CVE-2021-29966": [
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-23/",
        "description": "Mozilla developers Christian Holler, Tooru Fujisawa, Tyson Smith reported memory safety bugs present in Firefox 88. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code."
      }
    ],
    "CVE-2021-29967": [
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-23/",
        "description": "Mozilla developers Christian Holler, Anny Gakhokidze, Alexandru Michis, Gabriele Svelto reported memory safety bugs present in Firefox 88 and Firefox ESR 78.11. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code."
      },
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-24/",
        "description": "Mozilla developers Gabriele Svelto, Anny Gakhokidze, Alexandru Michis, Christian Holler reported memory safety bugs present in Firefox 88 and Firefox ESR 78.10. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code."
      },
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-26/",
        "description": "Mozilla developers Gabriele Svelto, Anny Gakhokidze, Alexandru Michis, Christian Holler reported memory safety bugs present in Thunderbird 78.11. Some of these bugs showed evidence of memory corruption and we presume that with enough effort some of these could have been exploited to run arbitrary code."
      }
    ],
    "CVE-2021-29968": [
      {
        "url": "https://www.mozilla.org/security/advisories/mfsa2021-27/",
        "description": "When drawing text onto a canvas with WebRender disabled, an out of bounds read could occur. This bug only affects Firefox on Windows. Other operating systems are unaffected."
      }
    ]
  }
}