{
  "year": 2005,
  "total": 272,
  "reference": "securityfocus.com",
  "reports": {
    "CVE-2005-0177": [
      {
        "url": "http://www.securityfocus.com/bid/12598",
        "title": "Linux Kernel Multiple Vulnerabilities",
        "body": "Linux Kernel is reported prone to multiple vulnerabilities. These issues may allow a local attacker to carry out denial-of-service attacks, access kernel memory, and potentially gain elevated privileges. The following specific issues were identified: - Reportedly, the filesystem Native Language Support ASCII translation table is affected by a vulnerability that results from the use of incorrect tables sizes. This issue can lead to a crash. - Another issue affecting the kernel may allow users to unlock arbitrary shared-memory segments. - Another vulnerability is reported to affect the 'netfilter/iptables' module. An attacker can exploit this issue to crash the kernel or bypass firewall rules. - Reportedly, a vulnerability affects the OUTS instruction on the AMD64 and Intel EM64T architecture. This issue may lead to privilege escalation. These issues reportedly affect Linux kernel 2.6.x versions. Due to lack of details, further information is not available at the moment. This BID will be updated when more information becomes available."
      }
    ],
    "CVE-2005-0209": [
      {
        "url": "http://www.securityfocus.com/bid/12598",
        "title": "Linux Kernel Multiple Vulnerabilities",
        "body": "Linux Kernel is reported prone to multiple vulnerabilities. These issues may allow a local attacker to carry out denial-of-service attacks, access kernel memory, and potentially gain elevated privileges. The following specific issues were identified: - Reportedly, the filesystem Native Language Support ASCII translation table is affected by a vulnerability that results from the use of incorrect tables sizes. This issue can lead to a crash. - Another issue affecting the kernel may allow users to unlock arbitrary shared-memory segments. - Another vulnerability is reported to affect the 'netfilter/iptables' module. An attacker can exploit this issue to crash the kernel or bypass firewall rules. - Reportedly, a vulnerability affects the OUTS instruction on the AMD64 and Intel EM64T architecture. This issue may lead to privilege escalation. These issues reportedly affect Linux kernel 2.6.x versions. Due to lack of details, further information is not available at the moment. This BID will be updated when more information becomes available."
      }
    ],
    "CVE-2005-0210": [
      {
        "url": "http://www.securityfocus.com/bid/12816",
        "title": "Linux Kernel Netfilter Memory Leak Local Denial of Service Vulnerability",
        "body": "Linux Kernel is reported prone to a local denial of service vulnerability due to a memory leak in Netfilter code.  This issue can allow an attacker to crash a computer and deny service to legitimate users.It is not known whether this issue allows for remote exploitation.Linux Kernel 2.6.8 was reported vulnerable, however, it is possible that subsequent versions are affected as well."
      }
    ],
    "CVE-2005-0351": [
      {
        "url": "http://www.securityfocus.com/bid/13062",
        "title": "SCO OpenServer Auditsh HOME Environment Variable Buffer Overflow Vulnerability",
        "body": "The SCO OpenServer 'auditsh' application is affected by a local buffer-overflow vulnerability.     This issue presents itself when the affected application handles the HOME environment variable."
      }
    ],
    "CVE-2005-0735": [
      {
        "url": "http://www.securityfocus.com/bid/12761",
        "title": "NewsScript Access Validation Vulnerability",
        "body": "NewsScript is reported prone to an access validation vulnerability.  This issue may allow an unauthorized attacker to add, modify and delete messages.It is reported that an attacker can exploit this issue by issuing a specially crafted HTTP GET request for the 'newsscript.pl' script to bypass access checks and carry out administrative tasks."
      }
    ],
    "CVE-2005-0797": [
      {
        "url": "http://www.securityfocus.com/bid/12811",
        "title": "Novell iChain Mini FTP Server Remote Information Disclosure Vulnerability",
        "body": "Novell iChain Mini FTP server is reported prone to a remote information disclosure vulnerability. It is reported that during authentication the service responds with different messages based on valid or invalid usernames.Information that is harvested in this manner may then be used to aid in further attacks."
      }
    ],
    "CVE-2005-0850": [
      {
        "url": "http://www.securityfocus.com/bid/12865",
        "title": "FileZilla FTP Server Multiple Remote Denial Of Service Vulnerabilities",
        "body": "The FileZilla FTP server is reported prone to multiple remote denial of service vulnerabilities. The following individual issues are reported:It is reported that FileZilla fails to gracefully handle FTP requests that contain reserved MS-DOS device names. A remote authenticated attacker may exploit this vulnerability to deny service for legitimate users.Finally, it is reported that the FileZilla FTP server may be influenced into entering an infinite loop. A remote authenticated attacker may exploit this vulnerability to deny service for legitimate users."
      }
    ],
    "CVE-2005-0891": [
      {
        "url": "http://www.securityfocus.com/bid/12950",
        "title": "GDK-Pixbuf BMP Image Processing Double Free Remote Denial of Service Vulnerability",
        "body": "The gdk-pixbuf library is reported prone to a denial-of-service vulnerability. This issue arises due to a double-free condition. Reportedly, this vulnerability presents itself when an application that is linked against the library handles malformed bitmap (.bmp) image files. A successful attack may result in a denial-of-service condition. It is not confirmed whether this vulnerability could be leveraged to execute arbitrary code. The gdk-pixbuf 0.22.0 and gtk2 2.4.14 packages are known to be vulnerable to this issue. Other versions are likely affected as well. This BID will be updated when more information becomes available."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/419771/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-0896": [
      {
        "url": "http://www.securityfocus.com/bid/12900",
        "title": "PHPMyDirectory Review.PHP Multiple Parameter Cross-Site Scripting Vulnerability",
        "body": "phpMyDirectory is prone to a cross-site scripting vulnerability.The problem presents itself when malicious HTML and script code is sent to the application through various parameters of the 'review.php' script. This issue may allow for theft of cookie-based authentication credentials or other attacks.phpMyDirectory 10.1.3-rel is reported vulnerable, however, it is possible that other versions are affected as well."
      }
    ],
    "CVE-2005-1462": [
      {
        "url": "http://www.securityfocus.com/bid/13504",
        "title": "Ethereal Multiple Remote Protocol Dissector Vulnerabilities",
        "body": "Many vulnerabilities in Ethereal have been disclosed by the vendor. The reported issues are in various protocol dissectors. These issues include:- Buffer-overflow vulnerabilities - Format-string vulnerabilities - NULL-pointer dereference denial-of-service vulnerabilities - Segmentation fault denial-of-service vulnerabilities - Infinite-loop denial-of-service vulnerabilities - Memory exhaustion denial-of-service vulnerabilities - Double-free vulnerabilities - Unspecified denial-of-service vulnerabilities These issues could allow remote attackers to execute arbitrary machine code in the context of the vulnerable application. Attackers could also crash the affected application. Various vulnerabilities affect several versions of Ethereal, from 0.8.14 through to 0.10.10. This BID will be split into individual BIDs for each separate issue. BID 13567 has been created for the DISTCC issue."
      }
    ],
    "CVE-2005-1619": [
      {
        "url": "http://www.securityfocus.com/bid/13627",
        "title": "PHPHeaven PHPMyChat Start-Page.CSS.PHP3 Cross-Site Scripting Vulnerability",
        "body": "phpMyChat is prone to a cross-site scripting vulnerability because it fails to properly sanitize user-supplied input.    An attacker may leverage this issue to execute arbitrary script code in the browser of an unsuspecting user in the context of the affected site. This may help the attacker steal cookie-based authentication credentials and launch other attacks."
      },
      {
        "url": "http://www.securityfocus.com/bid/13628",
        "title": "PHPHeaven PHPMyChat Style.CSS.PHP3 Cross-Site Scripting Vulnerability",
        "body": "phpMyChat is prone to a cross-site scripting vulnerability because it fails to properly sanitize user-supplied input.  An attacker may leverage this issue to execute arbitrary script code in the browser of an unsuspecting user in the context of the affected site. This may help the attacker steal cookie-based authentication credentials and launch other attacks."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/484575/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-1628": [
      {
        "url": "http://www.securityfocus.com/bid/13637",
        "title": "Colored Scripts Easy Message Board Remote Command Execution Vulnerability",
        "body": "Colored Scripts Easy Message Board  is prone to a remote command-execution vulnerability because it fails to properly sanitize user-supplied input."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/449573/100/200/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/449517/100/200/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-1754": [
      {
        "url": "http://www.securityfocus.com/bid/13753",
        "title": "Sun JavaMail Multiple Information Disclosure Vulnerabilities",
        "body": "Sun JavaMail is prone to multiple information disclosure vulnerabilities. The issues exist due to a lack of sufficient input sanitization performed on user-supplied requests. The following issues are reported:A remote attacker may reveal the contents of email attachments of other users.A remote attacker may download and peruse arbitrary files with the privileges of the affected service.A remote attacker may exploit these issues to disclose potentially sensitive information that could be used to aid in further attacks."
      }
    ],
    "CVE-2005-2033": [
      {
        "url": "http://www.securityfocus.com/bid/14000",
        "title": "I-Gallery Folder Argument Directory Traversal Vulnerability",
        "body": "i-Gallery is prone to a directory traversal vulnerability.  This could let remote attackers access files on the computer in the context of the Web server process."
      }
    ],
    "CVE-2005-2224": [
      {
        "url": "http://www.securityfocus.com/bid/14217",
        "title": "Microsoft ASP.NET RPC/Encoded Remote Denial Of Service Vulnerability",
        "body": "ASP.NET is susceptible to a remote denial of service vulnerability. This issue is due to the possibility of causing an infinite loop on the server when handling RPC/encoded requests.This issue presents itself when an RPC/encoded Web method accepts an array or object derived from 'IList'. By sending a specially crafted XML request, the 'aspnet_wp.exe' executable enters into an infinite loop.Remote attackers may exploit this vulnerability to consume excessive CPU resources, potentially denying service to legitimate users."
      }
    ],
    "CVE-2005-2368": [
      {
        "url": "http://www.securityfocus.com/bid/14374",
        "title": "Vim ModeLines Further Variant Arbitrary Command Execution Vulnerability",
        "body": "Vim is susceptible to an arbitrary command execution vulnerability with ModeLines. This issue is due to insufficient sanitization of user-supplied input.By modifying a text file to include ModeLines containing the 'glob()', or 'expand()' functions with shell metacharacters, attackers may cause arbitrary commands to be executed.This vulnerability allows an attacker to execute arbitrary commands with the privileges of the vim user. This gives an attacker the ability to gain remote access to computers running the vulnerable software.This issue is similar to BIDs 6384 and 11941."
      }
    ],
    "CVE-2005-3119": [
      {
        "url": "http://www.securityfocus.com/bid/15076",
        "title": "Linux Kernel Multiple Memory Leak Local Denial Of Service Vulnerabilities",
        "body": "Two local denial-of-service vulnerabilities affect the Linux kernel. These issues are due to a design flaw that creates memory leaks. Local attackers may exploit these vulnerabilities to consume excessive kernel resources, likely triggering a kernel crash and denying service to legitimate users. These issues affect Linux kernel versions prior to 2.6.14-rc4."
      }
    ],
    "CVE-2005-3179": [
      {
        "url": "http://www.securityfocus.com/advisories/9549",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/bid/15154",
        "title": "Linux Kernel World Writable SYSFS DRM Debug File Vulnerability",
        "body": "Linux kernel is prone to an issue where a world writable file is created in SYSFS.  Exploitation could allow an attacker to obtain sensitive information."
      }
    ],
    "CVE-2005-3294": [
      {
        "url": "http://www.securityfocus.com/bid/15104",
        "title": "TYPSoft FTP Server RETR Denial Of Service Vulnerability",
        "body": "TYPSoft FTP Server is prone to a denial of service vulnerability. This issue is due to a failure in the application to properly handle exceptional conditions.A local authorized attacker could exploit this vulnerability to cause the system to malfunction, resulting in a denial of service to legitimate users.Versions 1.11 and earlier are known to be vulnerable."
      }
    ],
    "CVE-2005-3483": [
      {
        "url": "http://www.securityfocus.com/bid/15285",
        "title": "GraphOn GO-Global For Windows Remote Buffer Overflow Vulnerability",
        "body": "GraphOn GO-Global For Windows is prone to a remote buffer overflow vulnerability.  This issue is due to a failure of the application to properly bounds check user-supplied data prior to copying it to an insufficiently sized memory buffer.An attacker can exploit this vulnerability to overflow a memory buffer, possibly resulting in a denial of service condition.  Execution of arbitrary code may also be possible.The vendor has addressed this issue in version 3.1.0.3281; prior versions are reported vulnerable."
      }
    ],
    "CVE-2005-3485": [
      {
        "url": "http://www.securityfocus.com/bid/15280",
        "title": "Glider Collect'N Kill Remote Buffer Overflow Vulnerability",
        "body": "Glider Connect'n Kill is prone to a remote buffer overflow vulnerability.  This issue is due to a failure of the application to properly bounds check user-supplied data prior to copying it to an insufficiently sized memory buffer.An attacker can exploit this vulnerability to overflow a memory buffer, possibly resulting in a denial of service condition.  Execution of arbitrary code may also be possible."
      }
    ],
    "CVE-2005-3496": [
      {
        "url": "http://www.securityfocus.com/bid/15294",
        "title": "PHP Handicapper Multiple Cross-Site Scripting Vulnerabilities",
        "body": "PHP Handicapper is prone to multiple cross-site scripting vulnerabilities because it fails to properly sanitize user-supplied input.  An attacker may leverage these issues to execute arbitrary code in the browser of an unsuspecting user in the context of the affected site. This may help the attacker steal cookie-based authentication credentials and launch other attacks."
      }
    ],
    "CVE-2005-3497": [
      {
        "url": "http://www.securityfocus.com/bid/15298",
        "title": "PHP Handicapper Process_signup.PHP SQL Injection Vulnerability",
        "body": "PHP Handicapper is prone to an SQL injection vulnerability.  This issue is due to a failure in the application to properly sanitize user-supplied input before using it in an SQL query.Successful exploitation could result in a compromise of the application, disclosure or modification of data, or may permit an attacker to exploit vulnerabilities in the underlying database implementation."
      }
    ],
    "CVE-2005-3528": [
      {
        "url": "http://www.securityfocus.com/bid/15371",
        "title": "TikiWiki Tiki-view_forum_thread.PHP Cross-Site Scripting Vulnerability",
        "body": "TikiWiki is prone to a cross-site scripting vulnerability.  This issue is due to a failure in the application to properly sanitize user-supplied input.An attacker may leverage this issue to have arbitrary script code executed in the browser of an unsuspecting user in the context of the affected site.  This may facilitate the theft of cookie-based authentication credentials as well as other attacks.Versions 1.9.x up to and including 1.9.2 are affected; prior versions may also be affected."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/416152/30/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3529": [
      {
        "url": "http://www.securityfocus.com/archive/1/416152/30/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3623": [
      {
        "url": "http://www.securityfocus.com/bid/16570",
        "title": "Linux Kernel NFS ACL Access Control Bypass Vulnerability",
        "body": "The Linux kernel's NFS implementation is prone to a remote access-control-bypass vulnerability. The software fails to validate the privileges of remote users before setting ACLs.This issue allows remote attackers to improperly alter ACLs on NFS filesystems, allowing them to bypass access controls. Disclosure of sensitive information, modification of arbitrary files, and other attacks are possible.Kernel versions prior to 2.6.14.5 in the 2.6 kernel series are vulnerable to this issue."
      }
    ],
    "CVE-2005-3686": [
      {
        "url": "http://www.securityfocus.com/bid/15466",
        "title": "Unclassified NewsBoard Forum.PHP SQL Injection Vulnerability",
        "body": "Unclassified NewsBoard is prone to an SQL injection vulnerability.  This issue is due to a failure in the application to properly sanitize user-supplied input before using it in an SQL query.Successful exploitation could result in a compromise of the application, disclosure or modification of data, or may permit an attacker to exploit vulnerabilities in the underlying database implementation."
      }
    ],
    "CVE-2005-3744": [
      {
        "url": "http://www.securityfocus.com/bid/15511",
        "title": "PHPComasy Index.PHP SQL Injection Vulnerability",
        "body": "phpComasy is prone to an SQL injection vulnerability.  This issue is due to a failure in the application to properly sanitize user-supplied input before using it in an SQL query.Successful exploitation could result in a compromise of the application, disclosure or modification of data, or may permit an attacker to exploit vulnerabilities in the underlying database implementation.Version 0.7.5 is affected; earlier versions may also be vulnerable."
      }
    ],
    "CVE-2005-3747": [
      {
        "url": "http://www.securityfocus.com/bid/15515",
        "title": "Jetty URL Encoded Backslash Source Code Disclosure Vulnerability",
        "body": "Jetty is prone to a source code disclosure vulnerability. This issue is due to a failure in the application to restrict access to sensitive files. A successful attack causes the Web server to present the requested file as a plain text file and subsequently disclosing the source. Versions 5.1.5. and earlier are reported to be vulnerable; the vendor has released version 5.1.6. to address this issue."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/450315/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3748": [
      {
        "url": "http://www.securityfocus.com/bid/15519",
        "title": "Tru-Zone Nuke ET Search Module SQL Injection Vulnerability",
        "body": "Nuke ET is prone to an SQL injection vulnerability.  This issue is due to a failure in the application to properly sanitize user-supplied input before using it in an SQL query.Successful exploitation could result in a compromise of the application, disclosure or modification of data, or may permit an attacker to exploit vulnerabilities in the underlying database implementation."
      }
    ],
    "CVE-2005-3770": [
      {
        "url": "http://www.securityfocus.com/bid/15524",
        "title": "PHPPost Multiple Cross-Site Scripting Vulnerabilities",
        "body": "PHP-Post is prone to multiple cross-site scripting vulnerabilities because the application fails to properly sanitize user-supplied input. An attacker may leverage these issues to execute arbitrary script code in the browser of an unsuspecting user in the context of the affected site.  The attacker may also be able to steal cookie-based authentication credentials and launch other attacks."
      },
      {
        "url": "http://www.securityfocus.com/bid/15532",
        "title": "PHPPost Subject HTML Injection Vulnerability",
        "body": "PHPPost is prone to an HTML injection vulnerability. This issue is due to a failure in the application to properly sanitize user-supplied input before using it in dynamically generated content.Attacker-supplied HTML and script code would be executed in the context of the affected Web site, potentially allowing for theft of cookie-based authentication credentials. An attacker could also exploit this issue to control how the site is rendered to the user; other attacks are also possible."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/417434/30/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3775": [
      {
        "url": "http://www.securityfocus.com/bid/15439/",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3877": [
      {
        "url": "http://www.securityfocus.com/bid/15596",
        "title": "Simple Document Management System SQL Injection Vulnerabilities",
        "body": "Simple Document Management System (SDMS) is prone to SQL injection vulnerabilities.  These issues are due to a failure in the application to properly sanitize user-supplied input before using it in an SQL query.Successful exploitation could result in a compromise of the application, disclosure or modification of data, or may permit an attacker to exploit vulnerabilities in the underlying database implementation."
      }
    ],
    "CVE-2005-3881": [
      {
        "url": "http://www.securityfocus.com/bid/15654",
        "title": "Atlantis Knowledge Base Search.PHP SQL Injection Vulnerability",
        "body": "Atlantis Knowledge Base is prone to an SQL injection vulnerability. This issue is due to a failure in the application to properly sanitize user-supplied input before using it in an SQL query.Successful exploitation could result in a compromise of the application, disclosure or modification of data, or may permit an attacker to exploit vulnerabilities in the underlying database implementation.Versions 3.0 and prior are reported to be vulnerable; other versions may also be affected."
      }
    ],
    "CVE-2005-3908": [
      {
        "url": "http://www.securityfocus.com/bid/15634",
        "title": "GhostScripter Amazon Shop Search.PHP SQL Injection Vulnerability",
        "body": "GhostScripter Amazon Shop is prone to an SQL-injection vulnerability because the application fails to properly sanitize user-supplied input before using it in an SQL query.  A successful exploit could allow an attacker to compromise the application, access or modify data, or exploit vulnerabilities in the underlying database implementation. GhostScripter Amazon Shop 5.0.0 and prior versions are vulnerable; other versions may also be affected."
      }
    ],
    "CVE-2005-3946": [
      {
        "url": "http://www.securityfocus.com/archive/1/418201/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/bid/15648",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/418274/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3952": [
      {
        "url": "http://www.securityfocus.com/bid/15547",
        "title": "PHP Labs Top Auction Multiple SQL Injection Vulnerabilities",
        "body": "PHP Labs Top Auction is prone to multiple SQL-injection vulnerabilities because the application failso properly sanitize user-supplied input before using it in an SQL query.    A successful exploit could allow an attacker to compromise the application, access or modify data, or exploit vulnerabilities in the underlying database implementation."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/466569/100/200/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/466565/100/200/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3984": [
      {
        "url": "http://www.securityfocus.com/archive/1/418286/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-4006": [
      {
        "url": "http://www.securityfocus.com/bid/15689",
        "title": "SAPID CMS Authentication Bypass Vulnerability",
        "body": "SAPID CMS is prone to an authentication bypass vulnerability.  This issue is due to a failure in the application to perform proper authentication on user credentials before granting access to privileged scripts.An attacker can exploit this vulnerability to access privileged scripts without requiring authentication credentials."
      }
    ],
    "CVE-2005-4027": [
      {
        "url": "http://www.securityfocus.com/bid/15594",
        "title": "SimpleBBS Search Module Parameters SQL Injection Vulnerability",
        "body": "SimpleBBS is prone to an SQL injection vulnerability.  This issue is due to a failure in the application to properly sanitize user-supplied input before using it in an SQL query.Successful exploitation could result in a compromise of the application, disclosure or modification of data, or may permit an attacker to exploit vulnerabilities in the underlying database implementation."
      }
    ],
    "CVE-2005-4073": [
      {
        "url": "http://www.securityfocus.com/bid/15774",
        "title": "CFMagic Multiple Products Input Validation Vulnerabilities",
        "body": "CFMagic Products are prone to multiple input validation vulnerabilities. These are due to a lack of proper sanitization of user-supplied input.These vulnerabilities allow an attacker to inject malicious SQL code into database queries, and conduct cross-site scripting attacks. Magic Book Professional version 2.0 and prior, Magic List Professional version 2.5 and prior, and Magic Forum Personal versions 2.5 and prior are vulnerable.Other versions of these applications may also be affected."
      }
    ],
    "CVE-2005-4161": [
      {
        "url": "http://www.securityfocus.com/bid/15792",
        "title": "MilliScripts Register.PHP Cross-Site Scripting Vulnerability",
        "body": "MilliScripts is prone to a cross-site scripting vulnerability. This is due to a lack of proper input validation.An attacker may leverage this issue to have arbitrary script code executed in the browser of an unsuspecting user in the context of the affected site.  This may facilitate the theft of cookie-based authentication credentials as well as other attacks."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/433545/30/5070/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/419070/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-4220": [
      {
        "url": "http://www.securityfocus.com/bid/15816",
        "title": "NetGear RP114 SYN Flood Denial Of Service Vulnerability",
        "body": "The NetGear RP114 device is prone to a denial of service vulnerability. Communications between the external and internal Ethernet interface may be halted by initiating a TCP SYN flood to the external interface of the device.This issue allows attackers to block network traffic to arbitrarily targeted network services, effectively denying service to legitimate users of the device."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/419485/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/419244/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/419243/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-4228": [
      {
        "url": "http://www.securityfocus.com/bid/15837",
        "title": "PHPWebGallery Multiple SQL Injection Vulnerabilities",
        "body": "PhpWebGallery is prone to multiple SQL-injection vulnerabilities because the application fails to properly sanitize user-supplied input before using it in SQL queries.  A successful exploit could allow an attacker to compromise the application, access or modify data, or exploit vulnerabilities in the underlying database."
      }
    ],
    "CVE-2005-4232": [
      {
        "url": "http://www.securityfocus.com/bid/15848",
        "title": "Jamit Job Board Index.PHP SQL Injection Vulnerability",
        "body": "Job Board is prone to an SQL injection vulnerability.  This issue is due to a failure in the application to properly sanitize user-supplied input before using it in an SQL query.Successful exploitation could result in a compromise of the application, disclosure or modification of data, or may permit an attacker to exploit vulnerabilities in the underlying database implementation."
      }
    ],
    "CVE-2005-4244": [
      {
        "url": "http://www.securityfocus.com/bid/15844",
        "title": "Snipe Gallery Multiple Input Validation Vulnerabilities",
        "body": "Snipe Gallery is prone to multiple input-validation vulnerabilities. These issues are due to a failure in the application to properly sanitize user-supplied input.Successful exploitation of these vulnerabilities could allow an attacker to compromise the application, access or modify data, steal cookie-based authentication credentials, and exploit vulnerabilities in the underlying database implementation. Other attacks are possible as well.Snipe Gallery versions 3.1.4 and prior are vulnerable; other versions may also be affected. "
      }
    ],
    "CVE-2005-4245": [
      {
        "url": "http://www.securityfocus.com/bid/15844",
        "title": "Snipe Gallery Multiple Input Validation Vulnerabilities",
        "body": "Snipe Gallery is prone to multiple input-validation vulnerabilities. These issues are due to a failure in the application to properly sanitize user-supplied input.Successful exploitation of these vulnerabilities could allow an attacker to compromise the application, access or modify data, steal cookie-based authentication credentials, and exploit vulnerabilities in the underlying database implementation. Other attacks are possible as well.Snipe Gallery versions 3.1.4 and prior are vulnerable; other versions may also be affected. "
      }
    ],
    "CVE-2005-4246": [
      {
        "url": "http://www.securityfocus.com/bid/15839",
        "title": "Plogger Index.PHP Multiple Input Validation Vulnerabilities",
        "body": "Plogger is prone to multiple input validation vulnerabilities. These issues are due to a failure in the application to properly sanitize user-supplied input.Successful exploitation of these vulnerabilities could result in a compromise of the application, disclosure or modification of data, the theft of cookie-based authentication credentials or may permit an attacker to exploit vulnerabilities in the underlying database implementation as well as other attacks."
      }
    ],
    "CVE-2005-4247": [
      {
        "url": "http://www.securityfocus.com/bid/15839",
        "title": "Plogger Index.PHP Multiple Input Validation Vulnerabilities",
        "body": "Plogger is prone to multiple input validation vulnerabilities. These issues are due to a failure in the application to properly sanitize user-supplied input.Successful exploitation of these vulnerabilities could result in a compromise of the application, disclosure or modification of data, the theft of cookie-based authentication credentials or may permit an attacker to exploit vulnerabilities in the underlying database implementation as well as other attacks."
      }
    ],
    "CVE-2005-4315": [
      {
        "url": "http://www.securityfocus.com/bid/15900",
        "title": "Plexum PlexCart X3 SQL Injection Vulnerability",
        "body": "Plexum PlexCart X3 is prone to an SQL injection vulnerability.  This issue is due to a failure in the application to properly sanitize user-supplied input before using it in an SQL query.Successful exploitation could result in a compromise of the application, disclosure or modification of data, or may permit an attacker to exploit vulnerabilities in the underlying database implementation."
      }
    ],
    "CVE-2005-4349": [
      {
        "url": "http://www.securityfocus.com/archive/1/419832/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/419829/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-4368": [
      {
        "url": "http://www.securityfocus.com/archive/1/422168/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/419710/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/418851/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-4386": [
      {
        "url": "http://www.securityfocus.com/bid/15941",
        "title": "Colony Search Module Cross-Site Scripting Vulnerability",
        "body": "Colony is prone to a cross-site scripting vulnerability.  This issue is due to a failure in the application to properly sanitize user-supplied input.An attacker may leverage this issue to have arbitrary script code executed in the browser of an unsuspecting user in the context of the affected site.  This may facilitate the theft of cookie-based authentication credentials as well as other attacks."
      }
    ],
    "CVE-2005-4478": [
      {
        "url": "http://www.securityfocus.com/bid/16020",
        "title": "Papoo Multiple SQL Injection Vulnerabilities",
        "body": "Papoo is prone to multiple SQL-injection vulnerabilities. These issues are due to a failure in the application to properly sanitize user-supplied input before using it in SQL queries. Successful exploitation could allow an attacker to compromise the application, access or modify data, or exploit vulnerabilities in the underlying database implementation. These issues affect version 2.1.2; other versions may also be vulnerable."
      }
    ],
    "CVE-2005-4485": [
      {
        "url": "http://www.securityfocus.com/bid/16011",
        "title": "ProjectApp Multiple Cross-Site Scripting Vulnerabilities",
        "body": "ProjectApp is prone to multiple cross-site scripting vulnerabilities.  These issues are due to a failure in the application to properly sanitize user-supplied input.An attacker may leverage these issues to have arbitrary script code executed in the browser of an unsuspecting user in the context of the affected site.  These may facilitate the theft of cookie-based authentication credentials as well as other attacks."
      }
    ],
    "CVE-2005-4491": [
      {
        "url": "http://www.securityfocus.com/bid/16016",
        "title": "Sitekit CMS Multiple Cross-Site Scripting Vulnerabilities",
        "body": "Sitekit CMS is prone to multiple cross-site scripting vulnerabilities.  These issues are due to a failure in the application to properly sanitize user-supplied input.An attacker may leverage these issues to have arbitrary script code executed in the browser of an unsuspecting user in the context of the affected site.  This may facilitate the theft of cookie-based authentication credentials as well as other attacks.Version 6.6 of Sitekit is reportedly vulnerable to these issues; prior versions may also be affected."
      }
    ],
    "CVE-2005-4495": [
      {
        "url": "http://www.securityfocus.com/bid/16039",
        "title": "Retired: SpireMedia CMS Index.cfm SQL Injection Vulnerability",
        "body": "SpireMedia CMS is prone to an SQL injection vulnerability.  This issue is due to a failure in the application to properly sanitize user-supplied input before using it in an SQL query.Successful exploitation could result in a compromise of the application, disclosure or modification of data, or may permit an attacker to exploit vulnerabilities in the underlying database implementation.SpireMedia CMS mx7 is prone to this issue.  Other versions may also be affected.Vendor information is available stating SpireMedia is not affected by this issue. Therefore this BID is being retired."
      }
    ],
    "CVE-2005-4606": [
      {
        "url": "http://www.securityfocus.com/bid/16085",
        "title": "Web Wiz Multiple Products SQL Injection Vulnerability",
        "body": "Multiple Products by Web Wiz are prone to an SQL injection vulnerability. Successful exploitation can allow an attacker to bypass authentication and gain unauthorized access to a site. Attacks may also result in disclosure or modification of data, or may permit an attacker to exploit vulnerabilities in the underlying database implementation. Web Wiz Site News 3.06 for Access 2000 and Access 97, Web Wiz Journal 1.0 for Access 2000 and Access 97, Web Wiz Polls 3.06 for Access 2000 and Access 97, Web Wiz Database Login 1.71 for Access 2000 and Access 97 are vulnerable to this issue.  Prior versions are reportedly affected as well."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/420551/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-4836": [
      {
        "url": "http://www.securityfocus.com/bid/28483",
        "title": "Apache Tomcat 'allowLinking' Accepts NULL Byte in URI Information Disclosure Vulnerability",
        "body": "Apache Tomcat is prone to a remote information-disclosure vulnerability because the HTTP/1.0 connector fails to properly handle a NULL byte in URIs when 'allowLinking' is configured.Remote attackers can exploit this issue to obtain potentially sensitive information.Note that HTTP/1.0 connector is deprecated; this issue is not scheduled to be fixed.The issue affects Tomcat 4.1.15 and later."
      }
    ],
    "CVE-2005-4872": [
      {
        "url": "http://www.securityfocus.com/bid/26462",
        "title": "PCRE Regular Expression Library Multiple Integer and Buffer Overflow Vulnerabilities",
        "body": "PCRE regular-expression library is prone to multiple integer- and buffer-overflow vulnerabilities.Attackers can exploit these issues to execute arbitrary code, cause denial-of-service conditions, or launch other attacks in the context of the application using the affected library."
      }
    ],
    "CVE-2005-0563": [
      {
        "url": "http://www.securityfocus.com/bid/13952",
        "title": "Microsoft Exchange Server Outlook Web Access HTML Injection Vulnerability",
        "body": "Outlook Web Access is prone to an HTML injection vulnerability.  This issue is due to a failure in the application to properly sanitize user-supplied input.An attacker may leverage this issue to have arbitrary script code executed in the affected application of an unsuspecting user in the context of the affected user.This issue is reported to affect Outlook Web Access for Exchange Server 5.5."
      }
    ],
    "CVE-2005-0116": [
      {
        "url": "http://www.securityfocus.com/bid/12298",
        "title": "AWStats Remote Command Execution Vulnerability",
        "body": "AWStats is reported prone to a remote arbitrary-command-execution vulnerability because the software fails to sufficiently sanitize user-supplied data.  An attacker can prefix arbitrary commands with the '|' character and have them execute in the context of the server through a URI parameter.  This issue was originally specified in BID 12270 (AWStats Multiple Unspecified Remote Input Validation Vulnerabilities).  Due to the availability of further details, it is being assigned a new BID."
      }
    ],
    "CVE-2005-0211": [
      {
        "url": "http://www.securityfocus.com/bid/12432",
        "title": "Squid Proxy WCCP recvfrom() Buffer Overflow Vulnerability",
        "body": "The Squid proxy server is vulnerable to a remotely exploitable buffer-overflow vulnerability. The vulnerability resides in Squid's implementation of WCCP (web cache communication protocol), a UDP-based web cache management protocol. The condition is triggered when the server reads a packet that is larger than the size of the buffer allocated to store it. This can occur because 'recvfrom()' is passed an incorrect value for its 'len' argument."
      }
    ],
    "CVE-2005-0227": [
      {
        "url": "http://www.securityfocus.com/bid/12411",
        "title": "PostgreSQL LOAD Extension Local Privilege Escalation Vulnerability",
        "body": "A local privilege-escalation vulnerability affects PostgreSQL because it fails to restrict critical functionality to privileged users.  An attacker may leverage this issue to execute arbitrary code with the privileges of the affected database, potentially facilitating privilege escalation."
      }
    ],
    "CVE-2005-0244": [
      {
        "url": "http://www.securityfocus.com/bid/12417",
        "title": "PostgreSQL Multiple Remote Vulnerabilities",
        "body": "Multiple remote vulnerabilities affect PostgreSQL.  These issues are due to design errors, buffer-mismanagement errors, and causes that are currently unspecified.The vulnerabilities are as follows:- The application fails to enforce function permissions.- A buffer overflow is triggered when cursor declaration occurs.- A denial-of-service issue resides in 'contrib/intagg'.Not enough information is currently available to provide a more in-depth technical description.  This BID will be updated when more details are available.An attacker may leverage these issues to execute arbitrary code with the privileges of the vulnerable database process and to execute functions without requiring permission.  Other attacks are also possible."
      }
    ],
    "CVE-2005-0247": [
      {
        "url": "http://www.securityfocus.com/bid/12417",
        "title": "PostgreSQL Multiple Remote Vulnerabilities",
        "body": "Multiple remote vulnerabilities affect PostgreSQL.  These issues are due to design errors, buffer-mismanagement errors, and causes that are currently unspecified.The vulnerabilities are as follows:- The application fails to enforce function permissions.- A buffer overflow is triggered when cursor declaration occurs.- A denial-of-service issue resides in 'contrib/intagg'.Not enough information is currently available to provide a more in-depth technical description.  This BID will be updated when more details are available.An attacker may leverage these issues to execute arbitrary code with the privileges of the vulnerable database process and to execute functions without requiring permission.  Other attacks are also possible."
      }
    ],
    "CVE-2005-0413": [
      {
        "url": "http://www.securityfocus.com/bid/12501",
        "title": "MyPHP Forum Multiple SQL Injection Vulnerabilities",
        "body": "MyPHP Forum is reportedly affected by multiple SQL injection vulnerabilities.  These issues are due to the application failing to properly sanitize user-supplied input before using it in SQL queries.Successful exploitation could result in a compromise of the application, disclosure or modification of data or may permit an attacker to exploit vulnerabilities in the underlying database implementation."
      },
      {
        "url": "http://www.securityfocus.com/bid/27083",
        "title": "MyPHP Forum 'faq.php' and 'member.php' Multiple SQL Injection Vulnerabilities",
        "body": "MyPHP Forum is prone to multiple SQL-injection vulnerabilities because it fails to sufficiently sanitize user-supplied data before using it in an SQL query.Exploiting these issues could allow an attacker to compromise the application, access or modify data, or exploit latent vulnerabilities in the underlying database.MyPHP Forum 3.0 is vulnerable; other versions may also be affected."
      }
    ],
    "CVE-2005-0449": [
      {
        "url": "http://www.securityfocus.com/bid/12598",
        "title": "Linux Kernel Multiple Vulnerabilities",
        "body": "Linux Kernel is reported prone to multiple vulnerabilities. These issues may allow a local attacker to carry out denial-of-service attacks, access kernel memory, and potentially gain elevated privileges. The following specific issues were identified: - Reportedly, the filesystem Native Language Support ASCII translation table is affected by a vulnerability that results from the use of incorrect tables sizes. This issue can lead to a crash. - Another issue affecting the kernel may allow users to unlock arbitrary shared-memory segments. - Another vulnerability is reported to affect the 'netfilter/iptables' module. An attacker can exploit this issue to crash the kernel or bypass firewall rules. - Reportedly, a vulnerability affects the OUTS instruction on the AMD64 and Intel EM64T architecture. This issue may lead to privilege escalation. These issues reportedly affect Linux kernel 2.6.x versions. Due to lack of details, further information is not available at the moment. This BID will be updated when more information becomes available."
      }
    ],
    "CVE-2005-0485": [
      {
        "url": "http://www.securityfocus.com/bid/12576",
        "title": "PaNews Cross-Site Scripting Vulnerability",
        "body": "PaNews is reportedly affected by a cross-site scripting vulnerability.  This issue  exists because the application fails to properly sanitize user-supplied input.As a result of this vulnerability, it is possible for a remote attacker to create a malicious link containing script code that will be executed in the browser of an unsuspecting user when followed. This may facilitate the theft of cookie-based authentication credentials as well as other attacks."
      }
    ],
    "CVE-2005-0504": [
      {
        "url": "http://www.securityfocus.com/bid/12195",
        "title": "Linux Kernel Multiple Local MOXA Serial Driver Buffer Overflow Vulnerabilities",
        "body": "The MOXA serial driver in the Linux kernel is reported prone to multiple buffer-overflow vulnerabilities. The driver fails to perform proper bounds checks before copying user-supplied data to fixed-size memory buffers. These vulnerabilities reside in the 'drivers/char/moxa.c' file. The vulnerable functions perform a 'copy_from_user()' call to copy user-supplied, user-space data to a fixed-size, static kernel memory buffer (moxaBuff) of 10240 bytes in length while using the user-supplied length argument as passed from 'MoxaDriverIoctl()'. This reportedly results in improperly bounded operations, potentially causing locally exploitable buffer overflows. Linux kernels from 2.2 through 2.4 and 2.6 are all reported prone to these vulnerabilities."
      }
    ],
    "CVE-2005-0543": [
      {
        "url": "http://www.securityfocus.com/bid/12644",
        "title": "PHPMyAdmin Multiple Libraries And Themes Remote Cross-Site Scripting Vulnerabilities",
        "body": "Multiple remote cross-site scripting vulnerabilities affect phpMyAdmin. These issues are due to a failure of the application to properly sanitize user-supplied input prior to including it in dynamically generated Web content.An attacker may leverage these issues to have arbitrary script code executed in the browser of an unsuspecting user.  This may facilitate the theft of cookie-based authentication credentials as well as other attacks."
      }
    ],
    "CVE-2005-0679": [
      {
        "url": "http://www.securityfocus.com/archive/1/474954/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-0709": [
      {
        "url": "http://www.securityfocus.com/bid/12781",
        "title": "MySQL AB MySQL Multiple Remote Vulnerabilities",
        "body": "MySQL is reported prone to multiple vulnerabilities that can be exploited by a remote authenticated attacker. The following individual issues are reported: - Insecure temporary file-creation vulnerability. Reports indicate that an attacker with 'CREATE TEMPORARY TABLE' privileges on an affected installation may leverage this vulnerability to corrupt files with the privileges of the MySQL process. - Input-validation vulnerability. Remote attackers with INSERT and DELETE privileges on the 'mysql' administrative database can exploit this. Reports indicate that this issue may be leveraged to load and execute a malicious library in the context of the MySQL process. - Remote arbitrary-code execution vulnerability. Reportedly, the vulnerability may be triggered by employing the 'CREATE FUNCTION' statement to manipulate functions to control sensitive data structures. This issue may be exploited to execute arbitrary code in the context of the database process. These issues are reported to exist in MySQL versions prior to MySQL 4.0.24 and 4.1.10a."
      }
    ],
    "CVE-2005-0720": [
      {
        "url": "http://www.securityfocus.com/bid/12776",
        "title": "mcNews Header.PHP Arbitrary File Include Vulnerability",
        "body": "mcNews is reportedly affected by a remote file-include vulnerability because the application fails to properly sanitize user-supplied input.    This issue is reported to affect mcNews 1.3; earlier versions may also be affected."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/476277/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-0739": [
      {
        "url": "http://www.securityfocus.com/bid/12762",
        "title": "Ethereal Etheric/GPRS-LLC/IAPP/JXTA/sFlow Dissector Vulnerabilities",
        "body": "Multiple buffer-overflow and denial-of-service vulnerabilities affect various Ethereal protocol dissectors, including the Etheric, GPRS-LLC, IAPP, JXTA, and sFlow dissectors.These issues may be triggered when the software is used to monitor live network traffic or when a dump is viewed. In the worst-case scenario, an attacker may be able to execute arbitrary code as the superuser. Exploiting the other vulnerabilities will cause the software to crash when an affected dissector processes live network traffic or a dump."
      }
    ],
    "CVE-2005-0748": [
      {
        "url": "http://www.securityfocus.com/bid/12773",
        "title": "WEBInsta Mailing Manager Remote File Include Vulnerability",
        "body": "WEBInsta Mailing Manager is prone to remote file include vulnerability.An attacker may leverage this issue to execute arbitrary server-side script code on an affected computer with the privileges of the Web server process.This may facilitate unauthorized access. WEBInsta Mailing Manager 1.3d is reported vulnerable, however,  prior versions may be affected as well."
      }
    ],
    "CVE-2005-0756": [
      {
        "url": "http://www.securityfocus.com/bid/13891",
        "title": "Linux Kernel 64 Bit PTrace Segment Base Address Local Denial Of Service Vulnerability",
        "body": "The Linux kernel is reported prone to a local denial-of-service vulnerability because it fails to properly samitize memory addresses passed to 'ptrace()'.  This issue occurs only on the amd64 platform, where a local attacker may be able to leverage the issue to crash the kernel. A successful attack will deny service for legitimate users."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/428058/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427980/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-0803": [
      {
        "url": "http://www.securityfocus.com/bid/12834",
        "title": "Microsoft Windows Graphical Device Interface Library Denial Of Service Vulnerability",
        "body": "Reportedly, a denial of service vulnerability affects Microsoft Windows GDI library 'gdi32.dll'.  This issue is due to a failure of the application to securely copy data from malformed EMF image files.An attacker may leverage this issue to trigger a denial of service condition in software implementing the vulnerable library.  Other attacks may also be possible."
      }
    ],
    "CVE-2005-1017": [
      {
        "url": "http://www.securityfocus.com/bid/12968",
        "title": "MaxWebPortal Events And Links Interface Multiple Input Validation Vulnerabilities",
        "body": "Multiple input validation vulnerabilities affect MaxWebPortal. These issues are due to a failure of the application to properly sanitize user-supplied input prior to using it to carry out critical application functionality such as database interaction and generating dynamic Web content. An attacker may exploit this issue to manipulate SQL queries to the underlying database and have arbitrary script code executed in the browser of an unsuspecting user.  This may facilitate theft of sensitive information, potentially including authentication credentials, and data corruption."
      }
    ],
    "CVE-2005-1020": [
      {
        "url": "http://www.securityfocus.com/bid/13043",
        "title": "Cisco IOS Secure Shell Server V2 Remote Denial Of Service Vulnerability",
        "body": "Cisco IOS is reported prone to a remote denial of service vulnerability. The issue is reported to exist when the Cisco IOS device is configured to employ SSHv2 for remote management and Terminal Access Controller Access Control System Authentication (TACACS+).An attacker may trigger the issue to cause a device reload, effectively denying service for legitimate users.It is noted that the vulnerability only affects SSHv2, SSHv1 is not affected."
      }
    ],
    "CVE-2005-1021": [
      {
        "url": "http://www.securityfocus.com/bid/13042",
        "title": "Cisco IOS Secure Shell Server Memory Leak Denial Of Service Vulnerability",
        "body": "A denial of service vulnerability has been reported in the Cisco IOS Secure Shell Server implementation.  This condition is the result of a memory leak that may be triggered by remote clients under some circumstances.  If the memory leak is triggered repeatedly, this could exhaust resources on the device, resulting in a reload of the device and persistent denial of service."
      }
    ],
    "CVE-2005-1126": [
      {
        "url": "http://www.securityfocus.com/bid/15252",
        "title": "Apple Mac OS X Security Update 2005-10-31 Multiple Local Vulnerabilities",
        "body": "Apple has released Security Update 2005-10-31 to address multiple Mac OS X local  vulnerabilities.The following vulnerabilities were addressed by the security update:- A misleading file ownership display, resulting in a false sense of security.- A software update failure, potentially resulting in a failure to install critical security fixes.- A group membership alteration issue, potentially resulting in unauthorized access due to a delayed changes to group membership.- An information disclosure issue with Keychain, potentially allowing unauthorized users to view already displayed plaintext passwords after the Keychain has automatically locked due to a timeout.- Multiple information disclosure issues in the kernel, potentially allowing local users to gain access to sensitive information, aiding them in further attacks.These vulnerabilities will be separated into individual BIDs upon further analysis of the issues."
      }
    ],
    "CVE-2005-1155": [
      {
        "url": "http://www.securityfocus.com/bid/15495",
        "title": "SCO OpenServer Release 5.0.7 Maintenance Pack 4 Released - Multiple Vulnerabilities Fixed",
        "body": "Updates for the SCO OpenServer Mozilla browser have been released, addressing multiple security vulnerabilities and weaknesses.  This release fixes a number of bugs, including some security vulnerabilities and weaknesses.    Many of the bugs that have been fixed in this maintenance pack may have a security impact that may be exploited by a local or remote attacker.  Possible consequences include denial of service, spoofing, gaining knowledge of potentially sensitive information, conducting cross-site scripting attacks, bypassing certain security restrictions, manipulating certain data, or compromising a user's system, and gaining local privilege escalation."
      },
      {
        "url": "http://www.securityfocus.com/bid/13216",
        "title": "Mozilla Suite And Firefox Favicon Link Tag Remote Script Code Execution Vulnerability",
        "body": "A remote code-execution vulnerability affects Mozilla Suite and Mozilla Firefox because the applications fail to deny remote unauthorized access to trusted local interfaces.  An attacker may be able to exploit this issue to execute arbitrary script code with the privileges of an unsuspecting user that activated the affected browser. This may facilitate the installation and execution of malicious applications on an affected computer.  Note that this issue was previously reported in BID 13208 (Mozilla Suite Multiple Code Execution, Cross-Site Scripting, And Policy Bypass Vulnerabilities); it has been assigned its own BID."
      }
    ],
    "CVE-2005-1398": [
      {
        "url": "http://www.securityfocus.com/bid/13406",
        "title": "PHPCart Input Validation Vulnerability",
        "body": "PHPCart is prone to a remote input validation vulnerability. The issue exists because the software fails to sufficiently sanitize URI parameter data that is employed when computing product charges.A remote attacker may exploit this issue to manipulate invoice and payment charges for a specific PHPCart order."
      },
      {
        "url": "http://www.securityfocus.com/bid/30887",
        "title": "Carmosa PHPCart Order Modification Data Integrity Vulnerability",
        "body": "Carmosa PHPCart is prone to a data-integrity vulnerability because it fails to sufficiently validate user-supplied input data.An attacker may leverage this issue to modify order details during various stages of order processing.PHPCart 4.6 is vulnerable; other versions may also be affected."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/495806/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-1425": [
      {
        "url": "http://www.securityfocus.com/archive/1/456240/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-1486": [
      {
        "url": "http://www.securityfocus.com/bid/13499",
        "title": "FishNet FishCart Multiple Cross-Site Scripting and SQL Injection Vulnerabilities",
        "body": "FishCart is prone to multiple cross-site scripting and SQL-injection vulnerabilities because the application fails to properly sanitize user-supplied input.  A successful exploit of the SQL-injection issues could allow an attacker to compromise the application, access or modify data, or exploit vulnerabilities in the underlying database implementation.  An attacker may leverage the cross-site scripting issues to execute arbitrary script code in the browser of an unsuspecting user. This may help the attacker steal cookie-based authentication credentials and launch other attacks."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/457754/100/200/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-1487": [
      {
        "url": "http://www.securityfocus.com/bid/13499",
        "title": "FishNet FishCart Multiple Cross-Site Scripting and SQL Injection Vulnerabilities",
        "body": "FishCart is prone to multiple cross-site scripting and SQL-injection vulnerabilities because the application fails to properly sanitize user-supplied input.  A successful exploit of the SQL-injection issues could allow an attacker to compromise the application, access or modify data, or exploit vulnerabilities in the underlying database implementation.  An attacker may leverage the cross-site scripting issues to execute arbitrary script code in the browser of an unsuspecting user. This may help the attacker steal cookie-based authentication credentials and launch other attacks."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/457754/100/200/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-1500": [
      {
        "url": "http://www.securityfocus.com/bid/13507",
        "title": "MyBloggie Multiple Input Validation Vulnerabilities",
        "body": "myBloggie is affected by multiple vulnerabilities.An attacker may leverage these issues to carry out cross-site scripting, HTML injection and SQL injection attacks against the affected application. This may result in the theft of authentication credentials, destruction or disclosure of sensitive data, and potentially other attacks.  The integrity of a site may be compromised by deleting arbitrary comments as well."
      },
      {
        "url": "http://www.securityfocus.com/bid/15017",
        "title": "MyBloggie Search.PHP SQL Injection Vulnerability",
        "body": "myBloggie is prone to an SQL injection vulnerability. This is due to a lack of sanitization of user-supplied input before passing it on to SQL queries.Successful exploitation could result in a compromise of the application, disclosure or modification of data, or may permit an attacker to exploit vulnerabilities in the underlying database implementation."
      }
    ],
    "CVE-2005-1532": [
      {
        "url": "http://www.securityfocus.com/bid/15495",
        "title": "SCO OpenServer Release 5.0.7 Maintenance Pack 4 Released - Multiple Vulnerabilities Fixed",
        "body": "Updates for the SCO OpenServer Mozilla browser have been released, addressing multiple security vulnerabilities and weaknesses.  This release fixes a number of bugs, including some security vulnerabilities and weaknesses.    Many of the bugs that have been fixed in this maintenance pack may have a security impact that may be exploited by a local or remote attacker.  Possible consequences include denial of service, spoofing, gaining knowledge of potentially sensitive information, conducting cross-site scripting attacks, bypassing certain security restrictions, manipulating certain data, or compromising a user's system, and gaining local privilege escalation."
      },
      {
        "url": "http://www.securityfocus.com/bid/13645",
        "title": "Mozilla Suite And Firefox DOM Property Overrides Code Execution Vulnerability",
        "body": "Mozilla Suite and Mozilla Firefox are affected by a code-execution vulnerability. This issue is due to a failure in the application to properly verify Document Object Model (DOM) property values. An attacker may leverage this issue to execute arbitrary code with the privileges of the user that activated the vulnerable browser, ultimately facilitating a compromise of the affected computer. This issue is reportedly a variant of BID 13233. Further details are scheduled to be released in the future; this BID will be updated accordingly."
      }
    ],
    "CVE-2005-1689": [
      {
        "url": "http://www.securityfocus.com/bid/14239",
        "title": "MIT Kerberos 5 KRB5_Recvauth Remote Pre-Authentication Double-Free Vulnerability",
        "body": "MIT Kerberos 5 is prone to a remote double-free vulnerability. Remote attackers can trigger this issue prior to any authentication whatsoever. The issue exists in the 'revcauth_common()' helper function.  Because of the code path taken in the vulnerable function, exploitation may be hindered. However, attackers may presumably leverage this issue to execute arbitrary code in the context of the affected service. Note that successful exploitation of this issue on a Kerberos Key Distribution Center (KDC) computer may result in the compromise of an entire Kerberos realm."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/446940/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-1704": [
      {
        "url": "http://www.securityfocus.com/bid/13697",
        "title": "GDB Multiple Vulnerabilities",
        "body": "GDB is reportedly affected by multiple vulnerabilities. These issues can allow an attacker to execute arbitrary code and commands on an affected computer. A successful attack may allow the attacker to gain elevated privileges or unauthorized access. The following specific issues were identified: - a remote heap-overflow vulnerability when loading malformed object files.- a local privilege-escalation vulnerability.GDB 6.3 is reportedly affected by these issues; other versions are likely vulnerable as well. GNU binutils 2.14 and 2.15 are affected by the heap-overflow issue as well."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/464745/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-1761": [
      {
        "url": "http://www.securityfocus.com/bid/14051",
        "title": "Linux Kernel 64 Bit AR-RSC Register Access Validation Vulnerability",
        "body": "The Linux Kernel for 64-bit architectures is prone to an access-validation vulnerability. The issue occurs because the software fails to restrict access to the 'ar.rsc' register (register stack engine control register) by the 'restore_sigcontext' function. Immediate consequences of exploitation would likely be a denial of service; other attacks are also possible."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427980/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-1790": [
      {
        "url": "http://www.securityfocus.com/bid/13799",
        "title": "Microsoft Internet Explorer JavaScript OnLoad Handler Remote Code Execution Vulnerability",
        "body": "Microsoft Internet Explorer is affected by a remote code execution vulnerability.This vulnerability presents itself when the browser handles a JavaScript 'onLoad' handler in conjunction with an improperly initialized 'window()' JavaScript function.This issue may be exploited to execute arbitrary remote code in the context of the user running the affected application. Failed exploitation attempts likely result in the application crashing."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/417326/30/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-1812": [
      {
        "url": "http://www.securityfocus.com/bid/13821",
        "title": "FutureSoft TFTP Server 2000 Multiple Remote Vulnerabilities",
        "body": "FutureSoft TFTP Server 2000 is affected by multiple remote vulnerabilities. Exploiting these issues can allow an attacker to retrieve arbitrary files and carry out buffer-overflow attacks.  The following specific issues were identified:  - Multiple buffer overflow vulnerabilities.  A successful attack may allow the attacker to execute arbitrary code on a vulnerable computer and gain unauthorized access in the context of the server.  A denial-of-service condition may arise as well.  - A directory-traversal vulnerability.  A successful attack may allow the attacker to access arbitrary files (if the server has permissions to access the file).  These issues have been confirmed on TFTP Server 2000 Evaluation Version 1.0.0.1.  Other versions may be affected as well."
      }
    ],
    "CVE-2005-1813": [
      {
        "url": "http://www.securityfocus.com/bid/13821",
        "title": "FutureSoft TFTP Server 2000 Multiple Remote Vulnerabilities",
        "body": "FutureSoft TFTP Server 2000 is affected by multiple remote vulnerabilities. Exploiting these issues can allow an attacker to retrieve arbitrary files and carry out buffer-overflow attacks.  The following specific issues were identified:  - Multiple buffer overflow vulnerabilities.  A successful attack may allow the attacker to execute arbitrary code on a vulnerable computer and gain unauthorized access in the context of the server.  A denial-of-service condition may arise as well.  - A directory-traversal vulnerability.  A successful attack may allow the attacker to access arbitrary files (if the server has permissions to access the file).  These issues have been confirmed on TFTP Server 2000 Evaluation Version 1.0.0.1.  Other versions may be affected as well."
      }
    ],
    "CVE-2005-1852": [
      {
        "url": "http://www.securityfocus.com/bid/14345",
        "title": "EKG LIbGadu Multiple Remote Integer Overflow Vulnerabilities",
        "body": "EKG libgadu is susceptible to multiple remote integer overflow vulnerabilities. These issues are due to a failure of the application to properly sanitize user-supplied input data prior to using it in memory allocation and copy operations.Attackers may exploit these vulnerabilities to execute arbitrary machine code in the context of applications that utilize the affected library. Failed exploitation attempts likely result in crashed applications."
      }
    ],
    "CVE-2005-1918": [
      {
        "url": "http://www.securityfocus.com/bid/5834",
        "title": "GNU Tar Hostile Destination Path Variant Vulnerability",
        "body": "GNU 'tar' 1.13.25 contains a vulnerability in the handling of pathnames for archived files. By specifying a path for an archived item that points outside the expected directory scope, the creator of the archive can cause the file to be extracted to arbitrary locations on the filesystem, including paths containing system binaries and other sensitive or confidential information. An attacker could use this to create or overwrite binaries in any desired location. This issue is a variant of the vulnerability described in BID 3024. It is not known whether earlier versions are also affected by this variant."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/430297/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-1925": [
      {
        "url": "http://www.securityfocus.com/bid/15390",
        "title": "TikiWiki Tiki-Editpage.PHP Directory Traversal Vulnerability",
        "body": "TikiWiki is prone to a directory traversal vulnerability.  This issue is due to a failure in the application to properly sanitize user-supplied input.A remote attacker may exploit this vulnerability to reveal files that contain potentially sensitive information. Information that is harvested in this manner may then be used to aid in further attacks against the software and the computer that is hosting the software."
      },
      {
        "url": "http://www.securityfocus.com/bid/15392",
        "title": "TikiWiki Tiki-User_Preferences.PHP Directory Traversal Vulnerability",
        "body": "TikiWiki is prone to a directory traversal vulnerability.  This issue is due to a failure in the application to properly sanitize user-supplied input.A remote attacker may exploit this vulnerability to reveal files that contain potentially sensitive information. Information that is harvested in this manner may then be used to aid in further attacks against the software and the computer that is hosting the software."
      }
    ],
    "CVE-2005-1928": [
      {
        "url": "http://www.securityfocus.com/bid/15868",
        "title": "Trend Micro ServerProtect EarthAgent Daemon Denial of Service Vulnerability",
        "body": "Trend Micro ServerProtect is prone to a remote denial of service vulnerability when the EarthAgent Daemon processes a malicious packet.  This causes the process to consume a large amount of CPU and memory resources, potentially causing the underlying operating system to fail.This issue affects Trend Micro ServerProtect version 5.58, however, earlier versions may also be affected."
      }
    ],
    "CVE-2005-1929": [
      {
        "url": "http://www.securityfocus.com/bid/15865",
        "title": "Trend Micro ServerProtect ISANVWRequest Heap Overflow Vulnerability",
        "body": "A remotely exploitable heap-based buffer overflow vulnerability is present in the Trend Micro ServerProtect 'isaNVWRequest.dll' ISAPI component of the Management Console.An attacker could exploit this issue to execute arbitrary code in the context of the underlying Web server.This issue is reported to affected ServerProtect 5.58 for Windows running withTrend Micro Control Manager 2.5/3.0 and Trend Micro Damage Cleanup Server 1.1.  Other versions and platforms may be affected as well.  It is also possible that other Trend Micro products such as InterScan eManager, InterScan Web Protect, OfficeScan, and Control Manager could be impacted as well.It is noted that the vulnerability may actually be present in the MFC (Microsoft Foundation Class) ISAPI libraries.  This issue may be related to BID 9963 \"Microsoft Visual C++ MFC ISAPI Extension Denial Of Service Vulnerability\"."
      },
      {
        "url": "http://www.securityfocus.com/bid/15866",
        "title": "Trend Micro ServerProtect Relay Heap Overflow Vulnerability",
        "body": "A remotely exploitable heap-based buffer overflow vulnerability is present in the Trend Micro ServerProtect 'relay.dll' component in the Management Console.An attacker could exploit this issue to execute arbitrary code in the context of the underlying Web server.This issue is reported to affect ServerProtect 5.58 for Windows running withTrend Micro Control Manager 2.5/3.0 and Trend Micro Damage Cleanup Server 1.1.  Other versions and platforms may be affected as well.  It is also possible that other Trend Micro products such as InterScan eManager, InterScan Web Protect, OfficeScan, and Control Manager could be impacted as well.It is noted that the vulnerability may actually be present in the MFC (Microsoft Foundation Class) ISAPI libraries.  This issue may be related to BID 9963 \"Microsoft Visual C++ MFC ISAPI Extension Denial Of Service Vulnerability\"."
      }
    ],
    "CVE-2005-1965": [
      {
        "url": "http://www.securityfocus.com/bid/13928",
        "title": "Siteframe Siteframe.php Remote File Include Vulnerability",
        "body": "Siteframe is prone to a remote file include vulnerability. The problem presents itself specifically when an attacker passes the location of a remote attacker-specified script through the 'siteframe.php' script.An attacker may leverage this issue to execute arbitrary server-side script code on an affected computer with the privileges of the Web server process. This may facilitate unauthorized access. "
      }
    ],
    "CVE-2005-1996": [
      {
        "url": "http://www.securityfocus.com/bid/13965",
        "title": "Bitrix Site Manager Remote File Include Vulnerability",
        "body": "Bitrix Site Manager is prone to a remote file include vulnerability.  An attacker may leverage this issue to execute arbitrary server-side script code on an affected computer with the privileges of the Web server process. This may facilitate unauthorized access.  Bitrix Site Manager 4.0.5 and prior versions are considered to be vulnerable at the moment."
      }
    ],
    "CVE-2005-2071": [
      {
        "url": "http://www.securityfocus.com/bid/14049",
        "title": "Sun Solaris Traceroute Multiple Local Buffer Overflow Vulnerabilities",
        "body": "Sun Solaris traceroute is affected by multiple local buffer overflow vulnerabilities.These vulnerabilities present themselves when the application handles excessive data supplied through command line arguments.These issue are reported to affect /usr/sbin/traceroute running on Sun Solaris 10.Some reports indicate that this issue cannot be reproduced. It is also reported that this issue is only exploitable on the Solaris x86 platform."
      }
    ],
    "CVE-2005-2072": [
      {
        "url": "http://www.securityfocus.com/bid/14074",
        "title": "Sun Solaris Runtime Linker LD_AUDIT Privilege Escalation Vulnerability",
        "body": "The Sun Solaris runtime linker is susceptible to a privilege escalation vulnerability.  Runtime linkers in most operating systems are designed to ignore LD_* environment variables when executing setuid or setgid binaries. The manual page describing 'ld.so' for Sun Solaris also states that certain precautions are taken when setuid or setgid binaries are executed. Reportedly, these precautions are not properly followed when LD_AUDIT is used.  Exploiting this vulnerability allows local attackers to gain superuser privileges on affected computers."
      }
    ],
    "CVE-2005-2087": [
      {
        "url": "http://www.securityfocus.com/bid/14087",
        "title": "Microsoft Internet Explorer Javaprxy.DLL COM Object Instantiation Heap Overflow Vulnerability",
        "body": "Microsoft Internet Explorer is prone to a heap-based buffer-overflow vulnerability that occurs when the 'javaprxy.dll' COM object is instantiated by a malicious webpage.    Attackers may exploit this issue to execute arbitrary code in the context of the client."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/404055",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2099": [
      {
        "url": "http://www.securityfocus.com/bid/14517",
        "title": "Linux Kernel Non-Zero Keyring Local Denial of Service Vulnerability",
        "body": "The Linux kernel is reported prone to a local denial-of-service vulnerability. This issue arises if a user tries to add a keyring that doesn't contain an empty payload. A successful attack can allow a local attacker to deny service to legitimate users due to a kernel oops."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427980/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2127": [
      {
        "url": "http://www.securityfocus.com/bid/14594",
        "title": "Microsoft Visual Studio .NET msdds.dll Remote Code Execution Vulnerability",
        "body": "Microsoft Visual Studio .NET is prone to a vulnerability that could allow remote arbitrary code execution.  This is due to a buffer overflow that is exposed during COM object instantiation.The list of vulnerable packages has been updated to include applications suspected of installing the vulnerable msdds.dll library."
      },
      {
        "url": "http://www.securityfocus.com/bid/15061",
        "title": "Microsoft Internet Explorer COM Object Instantiation Variant Vulnerability",
        "body": "Microsoft Internet Explorer is prone to a buffer overflow vulnerability that is related to instantiation of COM objects.Successful exploitation could let remote attackers execute arbitrary code in the context of the currently logged in user on the affected computer.This is a variant of the vulnerability described in BID 14511 Microsoft Internet Explorer COM Object Instantiation Buffer Overflow Vulnerability.  The difference between this issue and BID 14511 is that a different set of COM objects are affected that were not addressed in the previous BID."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/470690/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2177": [
      {
        "url": "http://www.securityfocus.com/bid/14168",
        "title": "Net-SNMP Unspecified Remote Stream-Based Protocol Denial Of Service Vulnerability",
        "body": "Net-SNMP is prone to a remote denial-of-service vulnerability. The issue is exposed when Net-SNMP is configured to have an open stream-based protocol port, such as TCP. The exact details describing this issue are not available. This BID will be updated when more information emerges."
      },
      {
        "url": "http://www.securityfocus.com/bid/21256",
        "title": "Retired: Net-SNMP Unspecified Malformed TCP Packet Remote Denial Of Service Vulnerability",
        "body": "Net-SNMP is prone to a remote denial-of-service vulnerability. The issue is exposed when Net-SNMP is configured to communicate over TCP; Net-SNMP using UDP is unaffected. Few details describing this issue are available. This BID will be updated when more details are made available.Note: This BID is being retired because this issue is a duplicate of the one discussed in BID 14168 (Net-SNMP Unspecified Remote Stream-Based Protocol Denial Of Service Vulnerability)."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/451426/100/200/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/451419/100/200/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/451417/100/200/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/451404/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2310": [
      {
        "url": "http://www.securityfocus.com/bid/14276",
        "title": "Nullsoft Winamp Malformed ID3v2 Tag Buffer Overflow Vulnerability",
        "body": "Winamp is susceptible to a buffer overflow vulnerability in its ID3v2 functionality. This issue is due to a failure of the application to properly bounds check input data prior to copying it into a fixed size memory buffer.This issue will facilitate remote exploitation as an attacker may distribute malicious MP3 files and entice unsuspecting users to process them with the affected application.An attacker may exploit this issue to execute arbitrary code with the privileges of the user that activated the vulnerable application.Versions 5.03a, 5.09, and 5.091 are reported vulnerable to this issue. Other versions are also likely affected."
      }
    ],
    "CVE-2005-2335": [
      {
        "url": "http://www.securityfocus.com/bid/14349",
        "title": "Fetchmail POP3 Client Buffer Overflow Vulnerability",
        "body": "Fetchmail POP3 client is prone to a buffer-overflow vulnerability. This issue presents itself because the application fails to perform boundary checks before copying user-supplied data into sensitive process buffers. This includes POP variants such as APOP and others. A successful attack can result in overflowing a finite-sized buffer and can ultimately lead to arbitrary code execution in the context of the Fetchmail process. This may allow the attacker to gain elevated privileges."
      },
      {
        "url": "http://www.securityfocus.com/bid/19289",
        "title": "Apple Mac OS X Multiple Security Vulnerabilities",
        "body": "Apple Mac OS X is prone to multiple security vulnerabilities.These issue affect Mac OS X and various applications including AFP Server, Bluetooth, Bom, DHCP, Image RAW, ImageIO, Launch Services, OpenSSH, and WebKit. A remote attacker may exploit these issues to execute arbitrary code, trigger denial-of-service conditions, escalate privileges, and disclose potentially sensitive information.Apple Mac OS X 10.4.7 and prior are reported vulnerable to these issues."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/441856/100/200/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/435197/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2340": [
      {
        "url": "http://www.securityfocus.com/bid/16202",
        "title": "RETIRED: Apple QuickTime Multiple Code Execution Vulnerabilities",
        "body": "Apple QuickTime is prone to multiple remote code-execution vulnerabilities.   These issues arise when the application handles specially crafted QTIF, TGA, TIFF, and GIF image formats.  Successful exploits of these issues may allow remote attackers to trigger a denial-of-service condition or to gain unauthorized access.  Versions prior to QuickTime 7.0.4 are vulnerable.NOTE: This BID is being retired because the issues are now documented in the following individual records:16852 Apple QuickTime QTIF Image Processing Remote Heap Overflow Vulnerability16864 Apple QuickTime GIF Image Processing Remote Heap Overflow Vulnerability16867 Apple QuickTime TIFF Image Processing Remote Integer Overflow Vulnerability16869 Apple QuickTime TIFF Image Processing Strips/Bands Integer Overflow Vulnerability16872 Apple QuickTime TGA Image Processing Remote Buffer Overflow Vulnerability16873 Apple QuickTime TGA Image Processing Remote Integer Overflow Vulnerability16875 Apple QuickTime TGA Image Processing Remote Integer Underflow Vulnerability"
      },
      {
        "url": "http://www.securityfocus.com/bid/16212",
        "title": "Apple QuickTime PictureViewer JPEG/PICT File Buffer Overflow Vulnerability",
        "body": "Apple QuickTime is prone to a buffer-overflow vulnerability because the application fails to do proper bounds checking on user-supplied data before copying it to finite-sized process buffers.  An attacker may be able to exploit this issue to execute arbitrary machine code in the context of the affected application, but this has not been confirmed. Unsuccessful exploit attempts will most likely crash the application.  This issue affects QuickTime 6.5.2 and 7.0.3; other versions may also be vulnerable. QuickTime 7.0.4 may also be vulnerable, but this has not been confirmed.  This issue may have previously been discussed in BID 16202 (Apple QuickTime Multiple Code Execution Vulnerabilities)."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/421566/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/421547/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2341": [
      {
        "url": "http://www.securityfocus.com/bid/16098",
        "title": "Blackberry Enterprise Server Attachment Service TIFF Attachment Denial Of Service Vulnerability",
        "body": "Research In Motion Blackberry Enterprise Server is prone to denial of service attacks.  This issue affects the Attachment Service and may be triggered by a malformed TIFF attachment.The issue is reportedly caused by a heap-based buffer overflow.  The vendor has stated that this issue will result in a denial of service, and it is therefore not believed that the issue is exploitable beyond a denial of service.  However, other sources indicate that this issue may allow arbitrary code execution to occur upon successful exploitation.  Specific details regarding code execution are not currently available and have not been confirmed.  This record will be updated when more information is available."
      }
    ],
    "CVE-2005-2344": [
      {
        "url": "http://www.securityfocus.com/bid/16204",
        "title": "Blackberry Enterprise Server Attachment Service PNG Attachment Denial Of Service Vulnerability",
        "body": "Research In Motion Blackberry Enterprise Server is prone to denial of service attacks.  This issue affects the Attachment Service and may be triggered by a malformed PNG attachment.The issue is caused by a heap-based buffer overflow. This issue allows remote attackers to execute arbitrary machine code in the context of the affected Attachment Service. Failed exploitation attempts will likely cause a denial of service in the affected application."
      }
    ],
    "CVE-2005-2370": [
      {
        "url": "http://www.securityfocus.com/bid/24600",
        "title": "EKG Multiple Remote Denial of Service Vulnerabilities",
        "body": "EKG is prone to multiple remote denial-of-service vulnerabilities because of design errors.An attacker can trigger these issues to cause denial-of-service conditions to legitimate users of the application."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/426078/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2371": [
      {
        "url": "http://www.securityfocus.com/bid/14309",
        "title": "Oracle Reports Server DESName Remote File Overwrite Vulnerability",
        "body": "Oracle Reports Server is susceptible to an arbitrary file overwrite vulnerability in its Web interface.On the Microsoft Windows platform, attackers may exploit this vulnerability to overwrite arbitrary files with System-level privileges. Attackers may overwrite critical system files, resulting in a system-level failures.On other platforms, attackers may exploit this vulnerability to overwrite arbitrary files with the privileges of the Oracle Applications Server user. Attackers may overwrite critical Oracle files, resulting in an application-level failure.Database failure, data destruction, and possibly other attacks are possible."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/422257/30/7430/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2378": [
      {
        "url": "http://www.securityfocus.com/archive/1/422256/30/7430/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2454": [
      {
        "url": "http://www.securityfocus.com/bid/20612",
        "title": "IBM Lotus Notes Local Insecure Default Directory Permissions Vulnerability",
        "body": "IBM Lotus Notes is prone to a vulnerability regarding insecure default permissions on the application directory.A local attacker can exploit this issue to access and modify  arbitrary files in the application directory; this may aid in further  attacks."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/449126/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2459": [
      {
        "url": "http://www.securityfocus.com/bid/14720",
        "title": "Linux Kernel ZLib Local Null Pointer Dereference Denial of Service Vulnerability",
        "body": "The Linux kernel is prone to a denial-of-service vulnerability. This issue is due to a failure in the application to properly handle malformed compressed files. An attacker can exploit this vulnerability to cause a kernel crash, effectively denying service to legitimate users."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/419522/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2492": [
      {
        "url": "http://www.securityfocus.com/bid/14787",
        "title": "Linux Kernel Raw_sendmsg() Kernel Memory Access Vulnerability",
        "body": "Linux Kernel is prone to a kernel memory-access vulnerability. This issue affects the 'raw_sendmsg()' function and can allow a local attacker to access kernel memory or manipulate the hardware state due to unauthorized access to I/O ports. Linux kernel 2.6.10 is reportedly vulnerable, but other versions are likely to be affected as well."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427980/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/419522/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2495": [
      {
        "url": "http://www.securityfocus.com/advisories/9285",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/advisories/9286",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/bid/14807",
        "title": "XFree86 Pixmap Allocation Local Privilege Escalation Vulnerability",
        "body": "XFree86 is prone to a buffer overrun in its pixmap-processing code. This issue can potentially allow an attacker to execute arbitrary code and to escalate privileges. An attacker may possibly gain superuser privileges by exploiting this issue."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/442163/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427045/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2548": [
      {
        "url": "http://www.securityfocus.com/bid/14611",
        "title": "Linux Kernel SNMP Handler Denial of Service Vulnerability",
        "body": "The Linux kernel is prone to a denial of service vulnerability.  This issue is due to a NULL pointer dereference that can occur when malformed UDP packets are received by snmpd. "
      }
    ],
    "CVE-2005-2555": [
      {
        "url": "http://www.securityfocus.com/bid/14609",
        "title": "Linux Kernel IPSec Policies Authorization Bypass Vulnerability",
        "body": "Linux Kernel is prone to an authorization-bypass vulnerability. This issue is due to a failure in the application to perform proper authorization before permitting access to a privileged function. Successful exploitation will permit a local attacker to bypass intended IPSec policies, set invalid policies, and cause a denial of service when adding policies until kernel memory is exhausted. Note that an attacker can use this vulnerability to enhance the exploitation of BID 14477 (Linux Kernel XFRM Array Index Buffer Overflow Vulnerability); that issue requires the ability to add IPSec policies."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427980/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2618": [
      {
        "url": "http://www.securityfocus.com/bid/16576",
        "title": "IBM Lotus Notes File Attachment Handling Multiple Remote Vulnerabilities",
        "body": "IBM Lotus Notes is prone to multiple remote vulnerabilities. The buffer-overflow issues could allow arbitrary code execution in the context of the user running the application.The issues are:- A buffer overflow exists when extracting files from ZIP archives. - A buffer overflow exists when extracting files from UUE encoded files.- A buffer overflow exists when extracting files from TAR archives.- A buffer overflow exists when handling HTML file attachments with malicious links.- A directory traversal exists when generating previews of ZIP, UUE, and TAR archives. This could be exploited to overwrite arbitrary files in the context of the current user.Lotus Notes 6.5.4 and 7.0 are prone to these issues. Other versions may also be vulnerable."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/424692/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/424689/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/424666/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/424626/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2619": [
      {
        "url": "http://www.securityfocus.com/bid/16576",
        "title": "IBM Lotus Notes File Attachment Handling Multiple Remote Vulnerabilities",
        "body": "IBM Lotus Notes is prone to multiple remote vulnerabilities. The buffer-overflow issues could allow arbitrary code execution in the context of the user running the application.The issues are:- A buffer overflow exists when extracting files from ZIP archives. - A buffer overflow exists when extracting files from UUE encoded files.- A buffer overflow exists when extracting files from TAR archives.- A buffer overflow exists when handling HTML file attachments with malicious links.- A directory traversal exists when generating previews of ZIP, UUE, and TAR archives. This could be exploited to overwrite arbitrary files in the context of the current user.Lotus Notes 6.5.4 and 7.0 are prone to these issues. Other versions may also be vulnerable."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/424717/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2703": [
      {
        "url": "http://www.securityfocus.com/bid/14923",
        "title": "Mozilla Browser/Firefox Arbitrary HTTP Request Injection Vulnerability",
        "body": "Mozilla and Firefox browsers are prone to a vulnerability that permits the injection of arbitrary HTTP requests. This issue is due to a failure in the application to properly sanitize user-supplied input. An attacker can use this issue to exploit server or proxy flaws from the user's machine, or to fool a server or proxy into thinking a single request is a stream of separate requests."
      },
      {
        "url": "http://www.securityfocus.com/bid/15495",
        "title": "SCO OpenServer Release 5.0.7 Maintenance Pack 4 Released - Multiple Vulnerabilities Fixed",
        "body": "Updates for the SCO OpenServer Mozilla browser have been released, addressing multiple security vulnerabilities and weaknesses.  This release fixes a number of bugs, including some security vulnerabilities and weaknesses.    Many of the bugs that have been fixed in this maintenance pack may have a security impact that may be exploited by a local or remote attacker.  Possible consequences include denial of service, spoofing, gaining knowledge of potentially sensitive information, conducting cross-site scripting attacks, bypassing certain security restrictions, manipulating certain data, or compromising a user's system, and gaining local privilege escalation."
      }
    ],
    "CVE-2005-2708": [
      {
        "url": "http://www.securityfocus.com/bid/16320",
        "title": "Linux Kernel SEARCH_BINARY_HANDLER Local Denial of Service Vulnerability",
        "body": "Linux kernel is susceptible to a local denial-of-service vulnerability. This issue presents itself in the 'search_binary_handler' function of 'exec.c'. This issue allows local users to crash the kernel due to a panic, denying service to legitimate users. Linux kernel 2.4 versions on 64-bit x86 architectures prior to 2.4.33-pre1 are affected."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/428058/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/428028/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2709": [
      {
        "url": "http://www.securityfocus.com/bid/15365",
        "title": "Linux Kernel Sysctl Unregistration Local Denial of Service Vulnerability",
        "body": "Linux Kernel is reported prone to a local denial-of-service vulnerability. This issue arises from a failure to properly unregister kernel resources when network devices are removed. This issue allows local attackers to deny service to legitimate users. Attackers may also be able to execute arbitrary code in the context of the kernel, but this has not been confirmed."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/428058/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/428028/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427981/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427980/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2752": [
      {
        "url": "http://www.securityfocus.com/bid/15252",
        "title": "Apple Mac OS X Security Update 2005-10-31 Multiple Local Vulnerabilities",
        "body": "Apple has released Security Update 2005-10-31 to address multiple Mac OS X local  vulnerabilities.The following vulnerabilities were addressed by the security update:- A misleading file ownership display, resulting in a false sense of security.- A software update failure, potentially resulting in a failure to install critical security fixes.- A group membership alteration issue, potentially resulting in unauthorized access due to a delayed changes to group membership.- An information disclosure issue with Keychain, potentially allowing unauthorized users to view already displayed plaintext passwords after the Keychain has automatically locked due to a timeout.- Multiple information disclosure issues in the kernel, potentially allowing local users to gain access to sensitive information, aiding them in further attacks.These vulnerabilities will be separated into individual BIDs upon further analysis of the issues."
      }
    ],
    "CVE-2005-2753": [
      {
        "url": "http://www.securityfocus.com/bid/15306",
        "title": "Apple QuickTime Embedded Pascal Style Remote Integer Overflow Vulnerability",
        "body": "A remote integer overflow vulnerability affects Apple QuickTime. This issue is due to a failure of the application to properly validate integer signed-ness prior to using it to carry out critical operations.An attacker may leverage this issue to cause the affected QuickTime client to crash, denying service to legitimate users. It has been speculated that this issue may also facilitate code execution; any code execution would occur with the privileges of the user that activated the affected software.This issue affects both Microsoft Windows, and Apple versions of QuickTime."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/415712/30/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2754": [
      {
        "url": "http://www.securityfocus.com/bid/15308",
        "title": "Apple QuickTime Movie Attributes Remote Integer Overflow Vulnerability",
        "body": "A remote integer overflow vulnerability affects Apple QuickTime. This issue is due to a failure of the application to properly validate integer signed-ness prior to using it to carry out critical operations.An attacker may leverage this issue to cause the affected QuickTime client to crash, denying service to legitimate users. It has been speculated that this issue may also facilitate code execution; any code execution would occur with the privileges of the user that activated the affected software.This issue affects both Microsoft Windows, and Apple versions of QuickTime."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/415709/30/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2792": [
      {
        "url": "http://www.securityfocus.com/bid/14695",
        "title": "PHPLDAPAdmin Welcome.PHP Multiple Vulnerabilities",
        "body": "phpldapadmin is prone to multiple input validation vulnerabilities.  These issues are due to a failure in the application to properly sanitize user-supplied input.phpldapadmin is prone to a directory traversal vulnerability.  An attacker can exploit this vulnerability to retrieve arbitrary files on the vulnerable system in the security context of the Web server process.  Information obtained may aid in further attacks against the underlying system; other attacks are also possible.phpldapadmin is prone to a remote file include vulnerability.  An attacker can exploit this vulnerability to execute arbitrary PHP script code in the security context of the Web server process.phpldapadmin is also prone to a cross-site scripting vulnerability.  An attacker may leverage this issue to have arbitrary script code executed in the browser of an unsuspecting user. This may facilitate the theft of cookie-based authentication credentials as well as other attacks."
      }
    ],
    "CVE-2005-2800": [
      {
        "url": "http://www.securityfocus.com/bid/14790",
        "title": "Linux Kernel SCSI ProcFS Denial Of Service Vulnerability",
        "body": "The Linux kernel is prone to a denial-of-service vulnerability. The kernel is affected by a memory leak, which eventually can result in a denial of service. A local attacker can exploit this vulnerability by making repeated reads to the '/proc/scsi/sg/devices' file, which will exhaust kernel memory and lead to a denial of service."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427980/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/419522/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2806": [
      {
        "url": "http://www.securityfocus.com/bid/14700",
        "title": "BNBT EasyTracker Remote Denial Of Service Vulnerability",
        "body": "BNBT EasyTracker contains a denial of service vulnerability in its HTTP parser code. This issue is due to a failure of the application to properly handle malformed HTTP requests.If an attacker sends a malformed HTTP request to the application, reports indicate that the affected application will terminate unexpectedly.A remote attacker is able to terminate the application, denying service to legitimate users."
      }
    ],
    "CVE-2005-2818": [
      {
        "url": "http://www.securityfocus.com/bid/14713",
        "title": "DownFile Multiple Cross-Site Scripting Vulnerabilities",
        "body": "DownFile is prone to multiple cross-site scripting vulnerabilities.  These issues are due to a failure in the application to properly sanitize user-supplied input.An attacker may leverage any of these issues to have arbitrary script code executed in the browser of an unsuspecting user in the context of the affected site.  This may facilitate the theft of cookie-based authentication credentials as well as other attacks."
      }
    ],
    "CVE-2005-2819": [
      {
        "url": "http://www.securityfocus.com/bid/14714",
        "title": "DownFile Administrator Unauthorized Access Vulnerability",
        "body": "DownFile is prone to an unauthorized access vulnerability.  This issue is due to a failure in the application to perform proper authentication before granting access to administrative functions.An attacker can exploit this vulnerability to gain access to administrative functions, this will result in an elevation of privileges.  "
      }
    ],
    "CVE-2005-2856": [
      {
        "url": "http://www.securityfocus.com/bid/14759",
        "title": "Multiple Vendor UNACEV2 Archive File Name Buffer Overflow Vulnerability",
        "body": "Multiple products are prone to a buffer overflow when handling ACE archives that contain files with overly long names. This may be exploited to execute arbitrary code in the context of the user who is running the application. The vulnerability is considered remotely exploitable in nature because malicious ACE archives will likely originate from an external, untrusted source."
      },
      {
        "url": "http://www.securityfocus.com/bid/19884",
        "title": "Microchip Data Systems ZipTV TZipTV ARJ File Handling Buffer Overflow Vulnerability",
        "body": "The TZipTV component of ZipTV is prone to a buffer-overflow vulnerability when handling malformed ARJ archives. Successful exploitation may allow an attacker to crash the application crash or execute arbitrary code.ZipTV for Delphi 7 version 2006.1.26 and ZipTV for C++ Builder version 2006-1.16 are known to be vulnerable; other versions may also be affected."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/440303/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/436639/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/434279/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/434234/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/434011/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/433693/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/433352/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/433258/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/432579/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/432357/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2919": [
      {
        "url": "http://www.securityfocus.com/bid/14867",
        "title": "ClamAV FSG Compressed Executable Infinite Loop Denial Of Service Vulnerability",
        "body": "ClamAV is prone to a remote denial-of-service vulnerability. This issue occurs when the application handles a malformed FSG-compressed executable. Exploitation could cause the application to enter an infinite loop, resulting in a denial of service."
      }
    ],
    "CVE-2005-2922": [
      {
        "url": "http://www.securityfocus.com/bid/17202",
        "title": "RealNetworks Multiple Products Multiple Buffer Overflow Vulnerabilities",
        "body": "Various RealNetworks products are prone to multiple buffer-overflow vulnerabilities.These issues can result in memory corruption and facilitate arbitrary code execution. A successful attack can allow remote attackers to execute arbitrary code in the context of the application to gain unauthorized access."
      }
    ],
    "CVE-2005-2923": [
      {
        "url": "http://www.securityfocus.com/bid/15753",
        "title": "Ipswitch Collaboration Suite and IMail Server IMAPD LIST Command Denial Of Service Vulnerability",
        "body": "Ipswitch Collaboration Suite and IMail Server are prone to a remote denial of service vulnerability.  Successful exploitation will cause the affected server to crash, effectively denying service to legitimate users."
      }
    ],
    "CVE-2005-2929": [
      {
        "url": "http://www.securityfocus.com/bid/15395",
        "title": "Lynx URI Handlers Arbitrary Command Execution Vulnerability",
        "body": "Lynx is prone to a vulnerability that lets attackers execute arbitrary commands. This issue occurs because the application fails to properly sanitize user-supplied input. A remote attacker can exploit this vulnerability by tricking a victim user into following a malicious link, thus enabling the attacker to execute arbitrary commands in the context of the victim user.UPDATE (October 27, 2008): The fix for this issue did not disable the 'lynxcgi' handler when in 'advanced' mode. This may still be an issue if Lynx is called from the command line."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/419763/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2930": [
      {
        "url": "http://www.securityfocus.com/bid/15234",
        "title": "Jed Wing CHM Lib _chm_find_in_PMGL Stack Buffer Overflow Vulnerability",
        "body": "CHM lib is susceptible to a buffer overflow vulnerability. This issue is due to a failure of the library to properly bounds check input data prior to copying it into an insufficiently sized memory buffer.This issue allows attackers to execute arbitrary machine code in the context of the application that utilizes the CHM lib library.This issue is present in versions 0.35; other versions may also be affected."
      }
    ],
    "CVE-2005-2932": [
      {
        "url": "http://www.securityfocus.com/bid/25365",
        "title": "Check Point Zone Labs Multiple Products Local Privilege Escalation Vulnerabilities",
        "body": "Multiple Check Point Zone Labs products are prone to multiple local privilege-escalation vulnerabilities.Successfully exploiting these issues allows local attackers to execute arbitrary code with elevated privileges, facilitating the complete compromise of affected computers.The following are vulnerable:- Versions prior to ZoneAlarm 7.0.362- Zone Labs products that include 'vsdatant.sys' 6.5.737.0."
      },
      {
        "url": "http://www.securityfocus.com/bid/25377",
        "title": "RETIRED: Check Point ZoneAlarm Multiple Products Local Privilege Escalation Vulnerabilities",
        "body": "Multiple Check Point ZoneAlarm products are prone to local privilege-escalation vulnerabilities.An attacker can exploit these issues to gain elevated privileges and completely compromise an affected computer. These issues have been confirmed in:ZoneAlarm 6.5.737 ZoneAlarm Security Suite 5.5.062.004 and 6.5.737.Other versions are likely vulnerable as well.NOTE: This BID is being retired because it is a duplicate of BID 25365 (Check Point Zone Labs Multiple Products Local Privilege Escalation Vulnerabilities)."
      }
    ],
    "CVE-2005-2936": [
      {
        "url": "http://www.securityfocus.com/bid/15448",
        "title": "Multiple Vendor lpCommandLine Application Path Vulnerability  ",
        "body": "Multiple vendor applications are prone to an arbitrary local code-execution vulnerability. This is due to a design error in which malicious code may be executed in the context of the user running the affected application."
      }
    ],
    "CVE-2005-2959": [
      {
        "url": "http://www.securityfocus.com/advisories/9643",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/bid/15191",
        "title": "Todd Miller Sudo Local Privilege Escalation Vulnerability",
        "body": "Sudo is prone to a local privilege-escalation vulnerability. The vulnerability presents itself because the application fails to properly sanitize malicious data supplied through environment variables. A successful attack may result in a complete compromise."
      }
    ],
    "CVE-2005-2972": [
      {
        "url": "http://www.securityfocus.com/bid/15096",
        "title": "AbiWord Stack-Based Buffer Overflow Vulnerabilities",
        "body": "AbiWord is susceptible to multiple stack-based buffer-overflow vulnerabilities; fixes are available. These issues are due to the application's failure to properly bounds-check user-supplied data before copying it to an insufficiently sized memory buffer while importing RTF files. These issues likely allow attackers to execute arbitrary machine code in the context of the user running the affected application. Though similar to the vulnerability described in BID 14971 (AbiWord RTF File Processing Buffer Overflow Vulnerability), these vulnerabilities constitute a separate issue."
      }
    ],
    "CVE-2005-2975": [
      {
        "url": "http://www.securityfocus.com/bid/15429",
        "title": "GDK-Pixbuf/GTK XPM Images Infinite Loop Denial Of Service Vulnerability",
        "body": "The 'gdk-pixbuf' and 'gtk2' libraries are prone to a denial-of-service vulnerability. This issue occurs when an application using one of the affected libraries handles a malformed XPM image file. Exploitation could cause an application using a vulnerable library to enter an infinite loop, resulting in a denial of service."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/428052/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-2976": [
      {
        "url": "http://www.securityfocus.com/bid/15428",
        "title": "GDK-Pixbuf XPM Images Integer Overflow Vulnerability",
        "body": "A remote integer-overflow vulnerability affects gdk-pixbuf. When an application that uses the vulnerable library processes a malformed XPM file, the application will crash, denying service to legitimate users. An attacker may also be able to exploit this issue to execute arbitrary code with the privileges of the application using the vulnerable library."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/428052/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3051": [
      {
        "url": "http://www.securityfocus.com/bid/14925",
        "title": "7-Zip ARJ File Buffer Overflow Vulnerability",
        "body": "7-Zip is prone to a stack-based buffer-overflow vulnerability.  Successful exploitation of this vulnerability will allow attackers to execute arbitrary code. Other attacks are also possible.  The vulnerability has been confirmed in 7-Zip 3.13, 3.30, 4.23, and 4.26 BETA; other versions may also be affected."
      },
      {
        "url": "http://www.securityfocus.com/bid/21208",
        "title": "Knownsoft Turbo Searcher ARJ File Handling Buffer Overflow Vulnerability",
        "body": "Turbo Searcher is prone to a buffer-overflow vulnerability when handling malformed ARJ archives. Successful exploitation may allow an attacker to crash the application crash or execute arbitrary code.Turbo Searcher Standard Edition version 3.30 build 052705 and Turbo Searcher Network Edition version 3.30 build 052705 are known to be vulnerable; other versions may also be affected."
      }
    ],
    "CVE-2005-3055": [
      {
        "url": "http://www.securityfocus.com/advisories/9806",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/bid/14955",
        "title": "Linux Kernel USB Subsystem Local Denial Of Service Vulnerability",
        "body": "A local denial-of-service vulnerability affects the Linux kernel's USB subsystem. This issue is due to the kernel's failure to properly handle unexpected conditions when trying to handle URBs (USB Request Blocks). Local attackers may exploit this vulnerability to trigger a kernel 'oops' on computers where the vulnerable USB subsystem is enabled. This would deny service to legitimate users."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/419522/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3058": [
      {
        "url": "http://www.securityfocus.com/bid/16599",
        "title": "Fortinet FortiGate URL Filtering Bypass Vulnerability",
        "body": "Fortinet FortiGate is prone to a vulnerability that could allow users to bypass the device's URL filtering. FortiGate devices running FortiOS v2.8MR10 and v3beta are vulnerable to this issue. Other versions may also be affected."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/424858/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3088": [
      {
        "url": "http://www.securityfocus.com/bid/15179",
        "title": "Fetchmail's FetchmailConf Utility Local Information Disclosure Vulnerability",
        "body": "Fetchmail is susceptible to an information-disclosure vulnerability. This issue is due to a race condition in the 'fetchmailconf' configuration utility. This issue allows local attackers to gain access to potentially sensitive information, including email authentication credentials, aiding them in further attacks. Versions of Fetchmail prior to 6.2.9-rc6 include a vulnerable version of 'fetchmailconf'. Versions of 'fetchmailconf' prior to 1.43.2 and 1.49 are vulnerable."
      },
      {
        "url": "http://www.securityfocus.com/bid/19289",
        "title": "Apple Mac OS X Multiple Security Vulnerabilities",
        "body": "Apple Mac OS X is prone to multiple security vulnerabilities.These issue affect Mac OS X and various applications including AFP Server, Bluetooth, Bom, DHCP, Image RAW, ImageIO, Launch Services, OpenSSH, and WebKit. A remote attacker may exploit these issues to execute arbitrary code, trigger denial-of-service conditions, escalate privileges, and disclose potentially sensitive information.Apple Mac OS X 10.4.7 and prior are reported vulnerable to these issues."
      }
    ],
    "CVE-2005-3109": [
      {
        "url": "http://www.securityfocus.com/bid/15049",
        "title": "Linux Kernel Multiple Security Vulnerabilities",
        "body": "Linux kernel is prone to multiple vulnerabilities. These issues may allow local and remote attackers to trigger denial-of-service conditions or to access sensitive kernel memory. Linux kernel 2.6.x versions are known to be vulnerable at the moment. Other versions may be affected as well."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427980/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3164": [
      {
        "url": "http://www.securityfocus.com/bid/15003",
        "title": "Hitachi Cosminexus Remote Information Disclosure Vulnerability",
        "body": "Hitachi Cosminexus is affected by an information-disclosure vulnerability.    An attacker may obtain potentially sensitive information such as other users' personal information sent through previous HTTP POST requests.  Information gathered may aid in other attacks."
      }
    ],
    "CVE-2005-3181": [
      {
        "url": "http://www.securityfocus.com/advisories/9549",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/advisories/9806",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/bid/15076",
        "title": "Linux Kernel Multiple Memory Leak Local Denial Of Service Vulnerabilities",
        "body": "Two local denial-of-service vulnerabilities affect the Linux kernel. These issues are due to a design flaw that creates memory leaks. Local attackers may exploit these vulnerabilities to consume excessive kernel resources, likely triggering a kernel crash and denying service to legitimate users. These issues affect Linux kernel versions prior to 2.6.14-rc4."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427980/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3183": [
      {
        "url": "http://www.securityfocus.com/advisories/9445",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/advisories/9444",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/bid/15035",
        "title": "W3C Libwww Multiple Vulnerabilities",
        "body": "W3C Libwww is prone to multiple vulnerabilities. These issues include a buffer-overflow vulnerability and some issues related to the handling of multipart/byteranges content. Libwww 5.4.0 is reported to be vulnerable. Other versions may be affected as well. These issues may also be exploited through other applications that implement the library."
      }
    ],
    "CVE-2005-3185": [
      {
        "url": "http://www.securityfocus.com/bid/15102",
        "title": "Multiple Vendor WGet/Curl NTLM Username Buffer Overflow Vulnerability",
        "body": "GNU wget and cURL are prone to a buffer-overflow vulnerability because the applications fail to properly bounds-check user-supplied data before using it in a memory copy operation. An attacker can exploit this vulnerability to execute arbitrary code in the context of the user running the vulnerable application. For an exploit to succeed, NTLM authentication must be enabled in the affected clients."
      },
      {
        "url": "http://www.securityfocus.com/bid/15647",
        "title": "RETIRED: Apple Mac OS X Security Update 2005-009 Multiple Vulnerabilities",
        "body": "Apple has released Security Update 2005-008 to address multiple Mac OS X local and remote vulnerabilities.  NOTE: This BID is being retired because the issues are now documented in the following individual records:16882 Apple Mac OS X CoreFoundation Remote Buffer Overflow Vulnerability16903 Apple Mac OS X Iodbcadmintool Local Privilege Escalation Vulnerability16904 Apple Mac OS X Passwordserver Local Privilege Escalation Vulnerability16926 Apple Safari Remote Directory Traversal Vulnerability29011 Apple Safari WebKit Unspecified Heap Overflow Vulnerability14106 Apache HTTP Request Smuggling Vulnerability14721 Apache Mod_SSL SSLVerifyClient Restriction Bypass Vulnerability15102 Multiple Vendor WGet/Curl NTLM Username Buffer Overflow Vulnerability15071 OpenSSL Insecure Protocol Negotiation Weakness14620 PCRE Regular Expression Heap Overflow Vulnerability14011 Apple Safari Dialog Box Origin Spoofing Vulnerability13993 Todd Miller Sudo Local Race Condition Vulnerability"
      }
    ],
    "CVE-2005-3191": [
      {
        "url": "http://www.securityfocus.com/bid/15726",
        "title": "XPDF DCTStream Progressive Remote Heap Buffer Overflow Vulnerability",
        "body": "The 'xpdf' utility is reported prone to a remote buffer-overflow vulnerability. This issue exists because the application fails to perform proper boundary checks before copying user-supplied data into process buffers. A remote attacker may execute arbitrary code in the context of a user running the application. As a result, the attacker can gain unauthorized access to the vulnerable computer. Reportedly, this issue presents itself in the 'DCTStream::readProgressiveSOF' function residing in the 'xpdf/Stream.cc' file. This issue is reported to affect xpdf 3.01, but earlier versions are likely vulnerable as well. Applications using embedded xpdf code may also be vulnerable. The 'pdftohtml' utility also includes vulnerable versions of xpdf. This issue affects pdftohtml 0.36; earlier versions may also be affected. Th 'kpdf' utility reportedly incorporates vulnerable xpdf code. This issue affects kpdf 0.5; other versions may also be affected."
      },
      {
        "url": "http://www.securityfocus.com/bid/15727",
        "title": "XPDF DCTStream Baseline Remote Heap Buffer Overflow Vulnerability",
        "body": "The 'xpdf' viewer is reported prone to a remote buffer-overflow vulnerability. This issue exists because the application fails to perform proper boundary checks before copying user-supplied data into process buffers. A remote attacker may execute arbitrary code in the context of a user running the application. This can result in the attacker gaining unauthorized access to the vulnerable computer. This issue is reported to present itself in the 'CTStream::readBaselineSOF' function residing in the 'xpdf/Stream.cc' file. This issue is reported to affect xpdf 3.01, but earlier versions are likely prone to this vulnerability as well. Applications using embedded xpdf code may also be vulnerable. The 'pdftohtml' utility also includes vulnerable versions of xpdf. This issue affects pdftohtml 0.36; earlier versions may also be affected. Th 'kpdf' utility reportedly incorporates vulnerable xpdf code. This issue affects kpdf 0.5; other versions may also be affected."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427990/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427053/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/418883/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3192": [
      {
        "url": "http://www.securityfocus.com/bid/15725",
        "title": "XPDF StreamPredictor Remote Heap Buffer Overflow Vulnerability",
        "body": "The 'xpdf' viewer is reported prone to a remote buffer-overflow vulnerability. This issue exists because the application fails to perform proper boundary checks before copying user-supplied data into process buffers. A remote attacker may execute arbitrary code in the context of a user running the application. As a result, the attacker can gain unauthorized access to the vulnerable computer.This issue is reported to present itself in the 'StreamPredictor::StreamPredictor' function residing in the 'xpdf/Stream.cc' file.This issue is reported to affect xpdf 3.01, but earlier versions are likely prone to this vulnerability as well. Applications using embedded xpdf code may also be vulnerable.The 'pdftohtml' utility also includes vulnerable versions of xpdf. This issue affects pdftohtml 0.36; earlier versions may also be affected.The 'kpdf' viewer reportedly incorporates vulnerable xpdf code. This issue affects kpdf 0.5; other versions may also be affected."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427990/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427053/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/418883/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3193": [
      {
        "url": "http://www.securityfocus.com/bid/15721",
        "title": "XPDF JPX Stream Reader Remote Heap Buffer Overflow Vulnerability",
        "body": "The 'xpdf' utility is reported prone to a remote buffer-overflow vulnerability. This issue exists because the application fails to perform proper boundary checks before copying user-supplied data into process buffers. A remote attacker may execute arbitrary code in the context of a user running the application. As a result, the attacker can gain unauthorized access to the vulnerable computer. Reportedly, this issue presents itself in the 'JPXStream::readCodestream' function residing in the 'xpdf/JPXStream.cc' file. This issue is reported to affect xpdf 3.01, but earlier versions are likely prone to this vulnerability as well. Applications using embedded xpdf code may also be vulnerable.The 'kpdf' utility reportedly incorporates vulnerable xpdf code. Version 0.5 of kpdf is prone to this issue, but other versions may also be affected."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427990/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427053/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/418883/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3205": [
      {
        "url": "http://www.securityfocus.com/bid/15030",
        "title": "Oracle iSQLPlus Cross-Site Scripting Vulnerability",
        "body": "Oracle iSQL*Plus is prone to a cross-site scripting vulnerability.  This issue is due to a failure in the application to properly sanitize user-supplied input.An attacker may leverage this issue to have arbitrary script code executed in the browser of an unsuspecting user in the context of the affected site.  This may facilitate the theft of cookie-based authentication credentials as well as other attacks.This issue was originally described and addressed in Oracle Critical Patch Update - April 2005, BID 13139 (Oracle Multiple Vulnerabilities). Due to the availability of more information, this issue is being assigned a separate BID."
      }
    ],
    "CVE-2005-3257": [
      {
        "url": "http://www.securityfocus.com/bid/15122",
        "title": "Linux Kernel Console Keymap Local Command Injection Vulnerability",
        "body": "The Linux kernel is susceptible to a local command-injection vulnerability via console keymap modifications. This issue occurs because unprivileged users can alter the system-wide console keymap. Local users may modify the console keymap to include scripted macro commands. This allows attackers to execute arbitrary commands with the privileges of the user that uses the console after them, potentially facilitating privilege escalation."
      }
    ],
    "CVE-2005-3265": [
      {
        "url": "http://www.securityfocus.com/bid/15190",
        "title": "Skype Technologies Skype Multiple Buffer Overflow Vulnerabilities",
        "body": "Skype is prone to multiple buffer overflow vulnerabilities.  Successful exploitation of these issues could result in a denial of service or arbitrary code execution in the context of the user running the application.These issues affect Skype for Windows releases 1.1.*.0 through 1.4.*.83."
      }
    ],
    "CVE-2005-3267": [
      {
        "url": "http://www.securityfocus.com/bid/15192",
        "title": "Skype Technologies Skype Networking Routine Heap Overflow Vulnerability",
        "body": "Skype is prone to a heap overflow in its networking routines. Successful exploitation could result in a denial of service or the execution of remote machine code in the context of the affected application. This issue affects Skype for Windows 1.4.*.83 and earlier, Skype for Mac OS X 1.3.*.16 and earlier, Skype for Linux 1.2.*.17 and earlier, and Skype for Pocket PC 1.1.*.6 and earlier. "
      }
    ],
    "CVE-2005-3269": [
      {
        "url": "http://www.securityfocus.com/bid/15013",
        "title": "Sun ONE Directory Server Unspecified Remote Arbitrary Command Execution Vulnerability",
        "body": "Sun ONE Directory Server is prone to an unspecified vulnerability that allows remote attackers to execute arbitrary commands with superuser privileges, facilitating the complete compromise of affected computers. The cause of this issue was not specified.  Very few technical details are currently available. We will update this BID as more information emerges."
      },
      {
        "url": "http://www.securityfocus.com/bid/16345",
        "title": "Red Hat Directory Server / Certificate Server Management Console Buffer Overflow Vulnerability",
        "body": "Red Hat Directory Server and Certificate Server are prone to a buffer-overflow vulnerability.This issue affects the Admin pages of the Management Console.Reports indicate that this issue can be exploited remotely to execute arbitrary code under some circumstances; local attackers may be able to gain superuser privileges by executing arbitrary code.A successful attack may lead to a complete compromise."
      }
    ],
    "CVE-2005-3273": [
      {
        "url": "http://www.securityfocus.com/bid/13886",
        "title": "Linux Kernel Radionet Open Source Environment Unspecified Vulnerability",
        "body": "The Linux Kernel Radionet Open Source Environment (ROSE) implementation is prone to an unspecified vulnerability. The issue exists in the 'rose_rt_ioctl()' function of the 'net/rose/rose_route.c' source file. Supposedly, the issue occurs when the function is handling 'ndigis' arguments."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/428028/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3283": [
      {
        "url": "http://www.securityfocus.com/bid/15164",
        "title": "TikiWiki Unspecified Cross-Site Scripting Vulnerability",
        "body": "TikiWiki is prone to an unspecified cross-site scripting vulnerability. This is due to a lack of proper sanitization of user-supplied input.An attacker may leverage this issue to have arbitrary script code executed in the browser of an unsuspecting user in the context of the affected site.  This may facilitate the theft of cookie-based authentication credentials as well as other attacks."
      }
    ],
    "CVE-2005-3314": [
      {
        "url": "http://www.securityfocus.com/bid/15491",
        "title": "Novell NetMail IMAP Unspecified Buffer Overflow Vulnerability",
        "body": "Novell NetMail is prone to a buffer-overflow vulnerability in an unspecified IMAP command.  Successful exploits may result in a denial of service or arbitrary code execution.  NetMail 3.52D is affected, but earlier versions may also be vulnerable.  Details regarding the precise nature of this vulnerability are not currently available. We will update this BID as more information emerges."
      }
    ],
    "CVE-2005-3317": [
      {
        "url": "http://www.securityfocus.com/archive/1/414083",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/bid/15161",
        "title": "ZipGenius Multiple Archive Formats File Name Buffer Overflow Vulnerabilities",
        "body": "ZipGenius is prone to multiple buffer overflow issues when handling various archive formats.These issues could be exploited to execute arbitrary code.  Arbitrary code execution would occur in the context of the user who is running the application. ZipGenius versions 5.5.1.468 and 6.0.2.1041 are reported to be vulnerable.  Other versions may be affected as well."
      }
    ],
    "CVE-2005-3325": [
      {
        "url": "http://www.securityfocus.com/bid/15199",
        "title": "Basic Analysis And Security Engine Base_qry_main.PHP SQL Injection Vulnerability",
        "body": "Basic Analysis And Security Engine is prone to an SQL injection vulnerability.This issue is due to a failure in the application to properly sanitize user-supplied input before using it in an SQL query.Successful exploitation could result in a compromise of the application, disclosure or modification of data, or may permit an attacker to exploit vulnerabilities in the underlying database implementation."
      }
    ],
    "CVE-2005-3330": [
      {
        "url": "http://www.securityfocus.com/bid/15213",
        "title": "Snoopy Arbitrary Command Execution Vulnerability",
        "body": "Snoopy is prone to a vulnerability that lets attackers execute arbitrary commands because the application fails to properly sanitize user-supplied input.  This issue may facilitate unauthorized remote access to the application in the context of the webserver."
      }
    ],
    "CVE-2005-3347": [
      {
        "url": "http://www.securityfocus.com/archive/1/416543",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/bid/15414",
        "title": "PHPsysInfo Multiple Input Validation Vulnerabilities",
        "body": "phpSysinfo is prone to multiple input-validation vulnerabilities: - a local file-include issue- an HTTP response-splitting vulnerability- cross-site scripting attacks. These issues are due to a lack of proper sanitization of user-supplied input. An attacker may exploit these vulnerabilities to access files within the context of the webserver application, to poison web proxy server caches, and to execute arbitrary HTML and script code within the context of the victim's browser. Other attacks are also possible. Note that the cross-site scripting issues are not exploitable on Debian systems. "
      },
      {
        "url": "http://www.securityfocus.com/bid/15396",
        "title": "PHPSysInfo Multiple Input Validation Vulnerabilities",
        "body": "phpSysInfo is prone to multiple input validation vulnerabilities.  These issues are due to a failure in the application to properly sanitize user-supplied input.phpSysInfo is prone to cross-site scripting, HTTP response splitting and arbitrary  local file inclusion vulnerabilities.An attacker can exploit these vulnerabilities to steal cookie-based authentication credentials, aid in phishing style attacks and retrieve privileged or sensitive information; other attacks are also possible."
      }
    ],
    "CVE-2005-3348": [
      {
        "url": "http://www.securityfocus.com/archive/1/416543",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/bid/15414",
        "title": "PHPsysInfo Multiple Input Validation Vulnerabilities",
        "body": "phpSysinfo is prone to multiple input-validation vulnerabilities: - a local file-include issue- an HTTP response-splitting vulnerability- cross-site scripting attacks. These issues are due to a lack of proper sanitization of user-supplied input. An attacker may exploit these vulnerabilities to access files within the context of the webserver application, to poison web proxy server caches, and to execute arbitrary HTML and script code within the context of the victim's browser. Other attacks are also possible. Note that the cross-site scripting issues are not exploitable on Debian systems. "
      },
      {
        "url": "http://www.securityfocus.com/bid/15396",
        "title": "PHPSysInfo Multiple Input Validation Vulnerabilities",
        "body": "phpSysInfo is prone to multiple input validation vulnerabilities.  These issues are due to a failure in the application to properly sanitize user-supplied input.phpSysInfo is prone to cross-site scripting, HTTP response splitting and arbitrary  local file inclusion vulnerabilities.An attacker can exploit these vulnerabilities to steal cookie-based authentication credentials, aid in phishing style attacks and retrieve privileged or sensitive information; other attacks are also possible."
      }
    ],
    "CVE-2005-3354": [
      {
        "url": "http://www.securityfocus.com/bid/15363",
        "title": "Sylpheed LDIF Import Remote Buffer Overflow Vulnerability",
        "body": "Sylpheed is prone to a buffer-overflow vulnerability. A buffer overflow can occur when an unsuspecting user imports a malicious LFID file into an address book. Exploitation of this vulnerability may allow an attacker to gain unauthorized access to the computer in the context of the Sylpheed client."
      }
    ],
    "CVE-2005-3355": [
      {
        "url": "http://www.securityfocus.com/bid/15496",
        "title": "GNU gnump3d CGI And Cookie Parameter Directory Traversal Vulnerability",
        "body": "GNU gnump3d is prone to a directory-traversal vulnerability. Very little information is available on this issue. Presumably, an attacker can exploit this vulnerability to retrieve or corrupt arbitrary files. This may aid in further attacks against the underlying system; other attacks are also possible."
      }
    ],
    "CVE-2005-3357": [
      {
        "url": "http://www.securityfocus.com/bid/16152",
        "title": "Apache Mod_SSL Custom Error Document Remote Denial Of Service Vulnerability",
        "body": "Apache's mod_ssl module is susceptible to a remote denial-of-service vulnerability. A flaw in the module results in a NULL-pointer dereference that causes the server to crash. This issue is present only when virtual hosts are configured with a custom 'ErrorDocument' statement for '400' errors or 'SSLEngine optional'. Depending on the configuration of Apache, attackers may crash the entire webserver or individual child processes. Repeated attacks are required to deny service to legitimate users when Apache is configured for multiple child processes to handle connections. This issue affects Apache 2.x versions."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/450315/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/445206/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/425399/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3365": [
      {
        "url": "http://www.securityfocus.com/bid/15183",
        "title": "DCP-Portal Multiple Input Validation Vulnerabilities",
        "body": "DCP-Portal is prone to multiple cross-site scripting and SQL injection vulnerabilities.Exploitation could allow for theft of cookie-based authentication credentials or unauthorized access to database data. Other attacks are also possible."
      },
      {
        "url": "http://www.securityfocus.com/bid/27167",
        "title": "DCP-Portal 'index.php' SQL Injection Vulnerability",
        "body": "DCP-Portal is prone to an SQL-injection vulnerability because it fails to sufficiently sanitize user-supplied data before using it in an SQL query.Exploiting this issue could allow an attacker to compromise the application, access or modify data, or exploit latent vulnerabilities in the underlying database.This issue affects DCP-Portal 6.11; other versions may also be vulnerable."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/419280/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3398": [
      {
        "url": "http://www.securityfocus.com/bid/15222",
        "title": "Sun Solaris Management Console HTTP TRACE Information Disclosure Vulnerability",
        "body": "Sun Solaris Management Console is prone to an information-disclosure vulnerability.  The issue presents itself because the server responds to the HTTP TRACE request by default.  With HTTP TRACE functionality enabled by default, an attacker can compromise user accounts by gaining access to sensitive header information. The attacker may exploit this issue along with other attacks, such as cross-site scripting, to steal cookie-based authentication credentials."
      }
    ],
    "CVE-2005-3467": [
      {
        "url": "http://www.securityfocus.com/bid/15273",
        "title": "RhinoSoft Serv-U FTP Server Unspecified Denial of Service Vulnerability",
        "body": "Serv-U FTP server is prone to an unspecified denial of service vulnerability.  This issue is most likely due to a failure in the application to handle exceptional conditions.Specific details regarding this issue are not currently available, this BID will be updated as more information becomes available.An attacker can exploit this vulnerability to cause the server to crash, effectively denying service to legitimate users."
      }
    ],
    "CVE-2005-3498": [
      {
        "url": "http://www.securityfocus.com/bid/15303",
        "title": "IBM WebSphere Application Server QueryString Information Disclosure Vulnerability",
        "body": "A remote information disclosure vulnerability reportedly affects the IBM WebSphere Application Server.A malicious user may leverage this issue to disclose potentially sensitive information, aiding them in further attacks."
      }
    ],
    "CVE-2005-3501": [
      {
        "url": "http://www.securityfocus.com/bid/15317",
        "title": "Clam Anti-Virus ClamAV CAB File Handling Denial Of Service Vulnerability",
        "body": "ClamAV is prone to a denial of service vulnerability. This is due to a failure in the application to handle malformed CAB files.Exploitation could cause the application to enter an infinite loop, resulting in a denial of service."
      }
    ],
    "CVE-2005-3534": [
      {
        "url": "http://www.securityfocus.com/bid/16029",
        "title": "Network Block Device Server Buffer Overflow Vulnerability",
        "body": "NBD is prone to a remote buffer-overflow vulnerability. This issue is due to a failure in the server to do proper bounds checking on user-supplied data before using it in finite-sized buffers. An attacker can exploit this issue to execute arbitrary code in the context of the affected application. This may facilitate a compromise of the underlying system."
      }
    ],
    "CVE-2005-3548": [
      {
        "url": "http://www.securityfocus.com/archive/1/415798/30/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3552": [
      {
        "url": "http://www.securityfocus.com/bid/15354",
        "title": "PHPKit Multiple Input Validation Vulnerabilities",
        "body": "PHPKIT is prone to multiple input-validation vulnerabilities. These issues are due to a failure in the application to properly santize user-supplied input. The application is prone to multiple cross-site scripting, HTTP-injection, SQL-injection, local file- inclusion, and arbitrary code-execution vulnerabilities."
      }
    ],
    "CVE-2005-3553": [
      {
        "url": "http://www.securityfocus.com/bid/15354",
        "title": "PHPKit Multiple Input Validation Vulnerabilities",
        "body": "PHPKIT is prone to multiple input-validation vulnerabilities. These issues are due to a failure in the application to properly santize user-supplied input. The application is prone to multiple cross-site scripting, HTTP-injection, SQL-injection, local file- inclusion, and arbitrary code-execution vulnerabilities."
      }
    ],
    "CVE-2005-3554": [
      {
        "url": "http://www.securityfocus.com/bid/15354",
        "title": "PHPKit Multiple Input Validation Vulnerabilities",
        "body": "PHPKIT is prone to multiple input-validation vulnerabilities. These issues are due to a failure in the application to properly santize user-supplied input. The application is prone to multiple cross-site scripting, HTTP-injection, SQL-injection, local file- inclusion, and arbitrary code-execution vulnerabilities."
      }
    ],
    "CVE-2005-3567": [
      {
        "url": "http://www.securityfocus.com/bid/15367",
        "title": "IBM Tivoli Directory Server Unspecified Unauthorized Access Vulnerability",
        "body": "IBM Tivoli Directory Server is susceptible to an unspecified flaw that allows remote unauthorized access to the directory server allowing attackers to access, alter, or delete data contained in the directory server database. Very little information is available on this vulnerability; this BID will be updated if further information becomes available."
      }
    ],
    "CVE-2005-3570": [
      {
        "url": "http://www.securityfocus.com/bid/15409",
        "title": "Horde Unspecified Error Message Cross-Site Scripting Vulnerability",
        "body": "Horde is prone to an unspecified cross-site scripting vulnerability. This issue is related to how Horde renders error messages. Successful exploitation could let an attacker inject hostile HTML and script code into the browser session of another user in the context of the site hosting Horde. This could allow the attacker to steal cookie-based authentication credentials or to launch other attacks."
      }
    ],
    "CVE-2005-3571": [
      {
        "url": "http://www.securityfocus.com/bid/15417",
        "title": "Codegrrl Protection.PHP Unspecified Code Execution Vulnerability",
        "body": "Unspecified Codegrrl applications are prone to a remote arbitrary code execution vulnerability. This is due to a lack of proper sanitization of user-supplied input.An attacker can exploit this to execute arbitrary code in the context of the Web server process.  This may facilitate a compromise of the system; other attacks are also possible."
      },
      {
        "url": "http://www.securityfocus.com/bid/21664",
        "title": "PHPFanBase Protection.PHP Remote File Include Vulnerability",
        "body": "PHPFanBase is prone to a remote file-include vulnerability because it fails to sufficiently sanitize user-supplied data.Exploiting this issue may allow an attacker to compromise the application and the underlying system; other attacks are also possible."
      }
    ],
    "CVE-2005-3590": [
      {
        "url": "http://www.securityfocus.com/bid/107871",
        "title": "GNU glibc CVE-2005-3590 Remote Buffer Overflow Vulnerability",
        "body": "GNU glibc is prone to a buffer-overflow vulnerability.          Attackers can exploit this issue to execute arbitrary code within the context of the affected application. Failed exploits will result in denial-of-service condition.        Versions prior to glibc 2.3.5 are vulnerable."
      }
    ],
    "CVE-2005-3591": [
      {
        "url": "http://www.securityfocus.com/bid/15334",
        "title": "Macromedia Flash ActionDefineFunction Memory Access Vulnerability",
        "body": "The Macromedia Flash plug-in is vulnerable to an input validation error that may be exploited to execute arbitrary code or carry out a denial of service attack.  The vulnerability is due to an input validation error for a critical array index value. An attacker can exploit this vulnerability to execute arbitrary code.  The most likely vector of attack is through a malicious SWF file designed to trigger the vulnerability that has been placed on a Web site.Macromedia Flash 6 and 7 are reported affected.It should be noted that this issue similar to the vulnerability described in BID 15332 (Macromedia Flash Array Index Memory Access Vulnerability), however, this issue affects a different function."
      }
    ],
    "CVE-2005-3624": [
      {
        "url": "http://www.securityfocus.com/bid/16143",
        "title": "KPDF and KWord Multiple Unspecified Buffer and Integer Overflow Vulnerabilities",
        "body": "KPDF and KWord are prone to multiple buffer and integer overflows. Successful exploitation could result in arbitrary code execution in the context of the user running the vulnerable application.     Specific details of these issues are not currently available. This record will be updated when more information becomes available.     The following are vulnerable:    - kdegraphics package  - KPDF 3.4.3 and earlier  - KOffice  - KWord 1.4.2 and earlier"
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427990/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427053/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3625": [
      {
        "url": "http://www.securityfocus.com/bid/16143",
        "title": "KPDF and KWord Multiple Unspecified Buffer and Integer Overflow Vulnerabilities",
        "body": "KPDF and KWord are prone to multiple buffer and integer overflows. Successful exploitation could result in arbitrary code execution in the context of the user running the vulnerable application.     Specific details of these issues are not currently available. This record will be updated when more information becomes available.     The following are vulnerable:    - kdegraphics package  - KPDF 3.4.3 and earlier  - KOffice  - KWord 1.4.2 and earlier"
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427990/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427053/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3626": [
      {
        "url": "http://www.securityfocus.com/bid/16143",
        "title": "KPDF and KWord Multiple Unspecified Buffer and Integer Overflow Vulnerabilities",
        "body": "KPDF and KWord are prone to multiple buffer and integer overflows. Successful exploitation could result in arbitrary code execution in the context of the user running the vulnerable application.     Specific details of these issues are not currently available. This record will be updated when more information becomes available.     The following are vulnerable:    - kdegraphics package  - KPDF 3.4.3 and earlier  - KOffice  - KWord 1.4.2 and earlier"
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427990/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427053/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3627": [
      {
        "url": "http://www.securityfocus.com/bid/16143",
        "title": "KPDF and KWord Multiple Unspecified Buffer and Integer Overflow Vulnerabilities",
        "body": "KPDF and KWord are prone to multiple buffer and integer overflows. Successful exploitation could result in arbitrary code execution in the context of the user running the vulnerable application.     Specific details of these issues are not currently available. This record will be updated when more information becomes available.     The following are vulnerable:    - kdegraphics package  - KPDF 3.4.3 and earlier  - KOffice  - KWord 1.4.2 and earlier"
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427990/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427053/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3631": [
      {
        "url": "http://www.securityfocus.com/bid/15994",
        "title": "RedHat Enterprise Linux UDEV Insecure Permissions Vulnerability",
        "body": "Red Hat Enterprise Linux is susceptible to an insecure-permissions vulnerability. This issue is due to a flaw in the 'udev' package that improperly creates '/dev/input' files. This issue allows local attackers to improperly access files in '/dev/input'. This allows them to sniff user-supplied keyboard and mouse input. Information gathered through this issue, such as passwords, will aid malicious users in further attacks."
      }
    ],
    "CVE-2005-3640": [
      {
        "url": "http://www.securityfocus.com/bid/15449",
        "title": "Floosietek FTGate IMAP Server Buffer Overflow Vulnerability",
        "body": "Floosietek FTGate is prone to a remote buffer overflow vulnerability in the IMAP server.  Successful exploitation could result in a denial of service or execution of arbitrary code.Attackers require valid login credentials to exploit this vulnerability."
      }
    ],
    "CVE-2005-3644": [
      {
        "url": "http://www.securityfocus.com/bid/15460",
        "title": "Microsoft Windows Plug and Play Denial of Service Vulnerability",
        "body": "Microsoft Windows Plug and Play service is prone to a denial of service condition.  This issue is caused by a malformed request to the service that causes virtual memory consumption.On Windows XP, a remote attacker must authenticate over RPC to exploit this issue using the originally described attack vector.Update: A reliable source has indicated that this issue is anonymously exploitable via named pipes or other MSRPC calls on Microsoft Windows XP SP2. This issue may be exploited by differing attack vectors than originally described by Microsoft."
      }
    ],
    "CVE-2005-3646": [
      {
        "url": "http://www.securityfocus.com/bid/15385/",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3650": [
      {
        "url": "http://www.securityfocus.com/bid/15430",
        "title": "First 4 Internet CodeSupport Uninstallation ActiveX Software Remote Code Execution Vulnerability",
        "body": "First 4 Internet CodeSupport is susceptible to a remote code execution vulnerability.The CodeSupport package can be told to download, and then execute arbitrary content from remote Web sites. As it fails to verify that the source of the remote content is from a trusted source, attackers may utilize it to download and execute malicious code from arbitrary sources, facilitating the remote compromise of targeted computers."
      }
    ],
    "CVE-2005-3653": [
      {
        "url": "http://www.securityfocus.com/bid/16354",
        "title": "Computer Associates iTechnology iGateway Service Content-Length Heap Overflow Vulnerability",
        "body": "The iGateway component of various Computer Associates products allows remote attackers to execute arbitrary code by exploiting a heap-overflow vulnerability. The attacker can trigger the vulnerability by supplying a negative HTTP Content-Length value and a large URI to the service.A successful attack can result in corrupting process memory and the execution of arbitrary code with SYSTEM privileges on Windows platforms. The vendor has reported that this issue triggers only a denial-of-service condition on other platforms.Products containing iGateway 4.0.051230 are vulnerable to this issue."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/423403/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/423288/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3658": [
      {
        "url": "http://www.securityfocus.com/bid/16275",
        "title": "EMC Legato Networker Multiple Remote Vulnerabilities",
        "body": "EMC Legato Networker is affected by multiple remote vulnerabilities. A denial-of-service issue and two remote code-execution issues have been identified. Version 7.2.1 of Legato Networker is vulnerable to these issues; prior versions may also be affected."
      }
    ],
    "CVE-2005-3659": [
      {
        "url": "http://www.securityfocus.com/bid/16275",
        "title": "EMC Legato Networker Multiple Remote Vulnerabilities",
        "body": "EMC Legato Networker is affected by multiple remote vulnerabilities. A denial-of-service issue and two remote code-execution issues have been identified. Version 7.2.1 of Legato Networker is vulnerable to these issues; prior versions may also be affected."
      }
    ],
    "CVE-2005-3662": [
      {
        "url": "http://www.securityfocus.com/bid/15427",
        "title": "PNMToPNG Alphas_Of_Color Buffer Overflow Vulnerability",
        "body": "The pnmtopng utility is prone to a buffer-overflow vulnerability. This issue is due to the application's failure to properly bounds-check user-supplied data before copying it to an insufficiently sized memory buffer. This issue reportedly occurs only when the '-alpha' command-line option is used. This issue allows attackers to create malicious PNM files that, when parsed by the affected utility, allow arbitrary machine code to be executed. This occurs in the context of the user running the affected utility."
      }
    ],
    "CVE-2005-3678": [
      {
        "url": "http://www.securityfocus.com/bid/15369",
        "title": "Google Talk Email Notification Denial Of Service Vulnerability",
        "body": "Google Talk is prone to a denial of service vulnerability. This is due to a programming error in which exceptional conditions cause the victim to have to interact and close multiple error popup windows.Specially crafted email messages may be repeatedly sent by an attacker to deny service to the client application user."
      }
    ],
    "CVE-2005-3709": [
      {
        "url": "http://www.securityfocus.com/bid/16202",
        "title": "RETIRED: Apple QuickTime Multiple Code Execution Vulnerabilities",
        "body": "Apple QuickTime is prone to multiple remote code-execution vulnerabilities.   These issues arise when the application handles specially crafted QTIF, TGA, TIFF, and GIF image formats.  Successful exploits of these issues may allow remote attackers to trigger a denial-of-service condition or to gain unauthorized access.  Versions prior to QuickTime 7.0.4 are vulnerable.NOTE: This BID is being retired because the issues are now documented in the following individual records:16852 Apple QuickTime QTIF Image Processing Remote Heap Overflow Vulnerability16864 Apple QuickTime GIF Image Processing Remote Heap Overflow Vulnerability16867 Apple QuickTime TIFF Image Processing Remote Integer Overflow Vulnerability16869 Apple QuickTime TIFF Image Processing Strips/Bands Integer Overflow Vulnerability16872 Apple QuickTime TGA Image Processing Remote Buffer Overflow Vulnerability16873 Apple QuickTime TGA Image Processing Remote Integer Overflow Vulnerability16875 Apple QuickTime TGA Image Processing Remote Integer Underflow Vulnerability"
      }
    ],
    "CVE-2005-3710": [
      {
        "url": "http://www.securityfocus.com/bid/16202",
        "title": "RETIRED: Apple QuickTime Multiple Code Execution Vulnerabilities",
        "body": "Apple QuickTime is prone to multiple remote code-execution vulnerabilities.   These issues arise when the application handles specially crafted QTIF, TGA, TIFF, and GIF image formats.  Successful exploits of these issues may allow remote attackers to trigger a denial-of-service condition or to gain unauthorized access.  Versions prior to QuickTime 7.0.4 are vulnerable.NOTE: This BID is being retired because the issues are now documented in the following individual records:16852 Apple QuickTime QTIF Image Processing Remote Heap Overflow Vulnerability16864 Apple QuickTime GIF Image Processing Remote Heap Overflow Vulnerability16867 Apple QuickTime TIFF Image Processing Remote Integer Overflow Vulnerability16869 Apple QuickTime TIFF Image Processing Strips/Bands Integer Overflow Vulnerability16872 Apple QuickTime TGA Image Processing Remote Buffer Overflow Vulnerability16873 Apple QuickTime TGA Image Processing Remote Integer Overflow Vulnerability16875 Apple QuickTime TGA Image Processing Remote Integer Underflow Vulnerability"
      },
      {
        "url": "http://www.securityfocus.com/archive/1/421797/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3711": [
      {
        "url": "http://www.securityfocus.com/bid/16202",
        "title": "RETIRED: Apple QuickTime Multiple Code Execution Vulnerabilities",
        "body": "Apple QuickTime is prone to multiple remote code-execution vulnerabilities.   These issues arise when the application handles specially crafted QTIF, TGA, TIFF, and GIF image formats.  Successful exploits of these issues may allow remote attackers to trigger a denial-of-service condition or to gain unauthorized access.  Versions prior to QuickTime 7.0.4 are vulnerable.NOTE: This BID is being retired because the issues are now documented in the following individual records:16852 Apple QuickTime QTIF Image Processing Remote Heap Overflow Vulnerability16864 Apple QuickTime GIF Image Processing Remote Heap Overflow Vulnerability16867 Apple QuickTime TIFF Image Processing Remote Integer Overflow Vulnerability16869 Apple QuickTime TIFF Image Processing Strips/Bands Integer Overflow Vulnerability16872 Apple QuickTime TGA Image Processing Remote Buffer Overflow Vulnerability16873 Apple QuickTime TGA Image Processing Remote Integer Overflow Vulnerability16875 Apple QuickTime TGA Image Processing Remote Integer Underflow Vulnerability"
      },
      {
        "url": "http://www.securityfocus.com/archive/1/421831/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/421799/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3712": [
      {
        "url": "http://www.securityfocus.com/bid/16907",
        "title": "Apple Mac OS X Security Update 2006-001 Multiple Vulnerabilities",
        "body": "Apple has released Security Update 2006-001 to address multiple remote and local Mac OS X vulnerabilities.Apple has also released updates to address these issues."
      }
    ],
    "CVE-2005-3713": [
      {
        "url": "http://www.securityfocus.com/bid/16202",
        "title": "RETIRED: Apple QuickTime Multiple Code Execution Vulnerabilities",
        "body": "Apple QuickTime is prone to multiple remote code-execution vulnerabilities.   These issues arise when the application handles specially crafted QTIF, TGA, TIFF, and GIF image formats.  Successful exploits of these issues may allow remote attackers to trigger a denial-of-service condition or to gain unauthorized access.  Versions prior to QuickTime 7.0.4 are vulnerable.NOTE: This BID is being retired because the issues are now documented in the following individual records:16852 Apple QuickTime QTIF Image Processing Remote Heap Overflow Vulnerability16864 Apple QuickTime GIF Image Processing Remote Heap Overflow Vulnerability16867 Apple QuickTime TIFF Image Processing Remote Integer Overflow Vulnerability16869 Apple QuickTime TIFF Image Processing Strips/Bands Integer Overflow Vulnerability16872 Apple QuickTime TGA Image Processing Remote Buffer Overflow Vulnerability16873 Apple QuickTime TGA Image Processing Remote Integer Overflow Vulnerability16875 Apple QuickTime TGA Image Processing Remote Integer Underflow Vulnerability"
      },
      {
        "url": "http://www.securityfocus.com/archive/1/421561/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/421547/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3714": [
      {
        "url": "http://www.securityfocus.com/bid/16146",
        "title": "Apple AirPort Remote Denial of Service Vulnerability",
        "body": "Apple AirPort firmware is prone to a denial of service condition.  This occurs when the device handles malformed packets.Specific details regarding this issue are not currently known.  This record will be updated when more information becomes available.AirPort Express firmware versions prior to 6.3 and AirPort Extreme firmware versions prior to 5.7 are vulnerable."
      }
    ],
    "CVE-2005-3724": [
      {
        "url": "http://www.securityfocus.com/bid/15478",
        "title": "Zyxel P2000W VOIP WIFI Phone Information Disclosure Vulnerability",
        "body": "The Zyxel P2000W VOIP WIFI Phone is prone to an information disclosure  vulnerability.  Sensitive information may be disclosed to attackers, and could be useful in further attacks. Informataion obtained may aid an attacker to perform denial of service attacks.Both version 1, and 2 of these phones are vulnerable to this issue. Due to code reuse, other devices and versions may also be affected."
      }
    ],
    "CVE-2005-3732": [
      {
        "url": "http://www.securityfocus.com/bid/15523",
        "title": "IPSec-Tools IKE Message Handling Denial of Service Vulnerability",
        "body": "IPsec-Tools is prone to a denial-of-service vulnerability. This issue is due to a failure in the application to handle exceptional conditions when in 'AGGRESSIVE' mode. An attacker can exploit this issue to crash the application, thus denying service to legitimate users. These vulnerabilities were discovered by, and may be reproduced by, the University of Oulu Secure Programming Group PROTOS IPSec Test Suite."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/436343/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3759": [
      {
        "url": "http://www.securityfocus.com/bid/15535",
        "title": "Horde MIME Viewer Inline Attachment HTML Injection Vulnerability",
        "body": "Horde MIME Viewer is prone to an HTML-injection vulnerability. This issue is due to a failure in the application to properly sanitize user-supplied input before using it in dynamically generated content. Attacker-supplied HTML and script code would be executed in the context of the affected site, potentially allowing an attacker to steal cookie-based authentication credentials. An attacker could also exploit this issue to control how the site is rendered to the user; other attacks are also possible."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/417436/30/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3784": [
      {
        "url": "http://www.securityfocus.com/bid/15625",
        "title": "Linux Kernel PTraced Child Auto-Reap Local Denial of Service Vulnerability",
        "body": "Linux kernel is prone to a local denial-of-service vulnerability. The kernel improperly auto-reaps processes when they are being ptraced, leading to an invalid pointer. Further operations on this pointer result in a kernel crash. This issue allows local users to crash the kernel, denying service to legitimate users. A complete compromise of the affected computer has also been reported, but this has not been confirmed.Kernel versions prior to 2.6.15 are vulnerable to this issue."
      },
      {
        "url": "http://www.securityfocus.com/advisories/9806",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/439623/100/100/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427981/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/419522/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3806": [
      {
        "url": "http://www.securityfocus.com/bid/15729",
        "title": "Linux Kernel IPv6 FlowLable Denial Of Service Vulnerability",
        "body": "Linux Kernel is prone to a local denial-of-service vulnerability. Local attackers can exploit this vulnerability to corrupt kernel memory or free non-allocated memory. Successful exploitation will crash the kernel, effectively denying service to legitimate users."
      },
      {
        "url": "http://www.securityfocus.com/advisories/9806",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/428058/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/428028/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427981/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/419522/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3817": [
      {
        "url": "http://www.securityfocus.com/bid/15561",
        "title": "Softbiz Web Host Directory Script Multiple SQL Injection Vulnerabilities",
        "body": "Softbiz Web Host Directory Script is prone to multiple SQL injection vulnerabilities. These issues occur because the application fails to properly sanitize user-supplied input before using it in an SQL query.  Successful exploitation could result in a compromise of the application, disclosure or modification of data, or may permit an attacker to exploit vulnerabilities in the underlying database implementation.  Version 1.1 and earlier are affected; other versions may also be affected."
      }
    ],
    "CVE-2005-3831": [
      {
        "url": "http://www.securityfocus.com/archive/1/417588/30/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3832": [
      {
        "url": "http://www.securityfocus.com/archive/1/417588/30/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3845": [
      {
        "url": "http://www.securityfocus.com/bid/16133",
        "title": "EZ Invoice Inc. EZI Invoices.PHP SQL Injection Vulnerability",
        "body": "EZI is prone to an SQL injection vulnerability.  This issue is due to a failure in the application to properly sanitize user-supplied input before using it in an SQL query.Successful exploitation could result in a compromise of the application, disclosure or modification of data, or may permit an attacker to exploit vulnerabilities in the underlying database implementation."
      }
    ],
    "CVE-2005-3857": [
      {
        "url": "http://www.securityfocus.com/bid/15627",
        "title": "Linux Kernel Time_Out_Leases PrintK Local Denial of Service Vulnerability",
        "body": "Linux kernel is susceptible to a local denial-of-service vulnerability. Local attackers may trigger this issue by obtaining numerous file-lock leases, which will consume excessive kernel log memory. Once the leases timeout, the event will be logged, and kernel memory will be consumed. This issue allows local attackers to consume excessive kernel memory, eventually leading to an out-of-memory condition and a denial of service for legitimate users. Kernel versions prior to 2.6.15-rc3 are vulnerable to this issue."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/428058/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/428028/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/427981/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3859": [
      {
        "url": "http://www.securityfocus.com/bid/15576",
        "title": "Q-News Remote File Include Vulnerability",
        "body": "Q-News is prone to a remote file include vulnerability.  This issue is due to a failure in the application to properly sanitize user-supplied input.An attacker can exploit this issue to execute arbitrary remote PHP code on an affected computer with the privileges of the Web server process. This may facilitate unauthorized access."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/417797/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3860": [
      {
        "url": "http://www.securityfocus.com/bid/15574",
        "title": "Athena PHP Website Administration Remote File Include Vulnerability",
        "body": "Athena PHP Website Administration is prone to a remote file include vulnerability.  This issue is due to a failure in the application to properly sanitize user-supplied input.An attacker can exploit this issue to execute arbitrary remote PHP code on an affected computer with the privileges of the Web server process. This may facilitate unauthorized access."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/417796/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3861": [
      {
        "url": "http://www.securityfocus.com/bid/15575",
        "title": "PHPGreetz Remote File Include Vulnerability",
        "body": "phpGreetz is prone to a remote file include vulnerability.  This issue is due to a failure in the application to properly sanitize user-supplied input.An attacker can exploit this issue to execute arbitrary remote PHP code on an affected computer with the privileges of the Web server process. This may facilitate unauthorized access."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/417798/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3863": [
      {
        "url": "http://www.securityfocus.com/bid/15600",
        "title": "KTools Remote Buffer Overflow Vulnerability",
        "body": "The ktools library is prone to a remote buffer-overflow vulnerability. An attacker may execute arbitrary code with the privileges of the application and gain unauthorized remote access. Version 0.3 (and prior) of ktools is vulnerable to this issue."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/417906/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3955": [
      {
        "url": "http://www.securityfocus.com/bid/15555",
        "title": "BlogBuddies Multiple Cross-Site Scripting Vulnerabilities",
        "body": "blogBuddies is prone to multiple cross-site scripting vulnerabilities. These issues are due to a failure in the application to properly sanitize user-supplied input.An attacker may leverage these issues to have arbitrary script code executed in the browser of an unsuspecting user in the context of the affected site.  This may facilitate the theft of cookie-based authentication credentials as well as other attacks."
      },
      {
        "url": "http://www.securityfocus.com/bid/18665",
        "title": "Jaws Search Gadget Multiple Input Validation Vulnerabilities",
        "body": "Jaws is prone to multiple input-validation vulnerabilities because it fails to properly sanitize user-supplied input.An attacker may leverage these issues to compromise the application, access or modify data, steal cookie-based authentication credentials, or exploit vulnerabilities in the underlying database implementation. Other attacks may also be possible."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/438434/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3962": [
      {
        "url": "http://www.securityfocus.com/bid/15629",
        "title": "Perl Perl_sv_vcatpvfn Format String Integer Wrap Vulnerability",
        "body": "Perl is prone to a format-string vulnerability because it fails to properly handle format specifiers in formatted-printing functions. An attacker may leverage this issue to write to arbitrary process memory, facilitating code execution in the context of the Perl interpreter process. This can result in unauthorized remote access. Developers should treat the formatted-printing functions in Perl as equivalently vulnerable to exploits as the C library versions and should properly sanitize all data passed in the format-specifier argument. All applications that use formatted-printing functions in an unsafe manner should be considered exploitable."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/438726/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/418333/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-3996": [
      {
        "url": "http://www.securityfocus.com/bid/15690",
        "title": "Zen Cart Password_Forgotten.PHP SQL Injection Vulnerability",
        "body": "Zen Cart is prone to an SQL-injection vulnerability. This issue is due to a failure in the application to properly sanitize user-supplied input before using it in an SQL query. Successful exploitation could allow an attacker to compromise the application, access or modify data, or exploit vulnerabilities in the underlying database implementation."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/418995/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/418517/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-4011": [
      {
        "url": "http://www.securityfocus.com/bid/15636",
        "title": "ltwCalendar Calendar.PHP SQL Injection Vulnerability",
        "body": "ltwCalendar is prone to an SQL injection vulnerability. This issue is due to a failure in the application to properly sanitize user-supplied input before using it in an SQL query.Successful exploitation could result in a compromise of the application, disclosure or modification of data, or may permit an attacker to exploit vulnerabilities in the underlying database implementation.Versions 4.1.3 and prior are vulnerable; other versions may also be affected."
      },
      {
        "url": "http://www.securityfocus.com/bid/18593",
        "title": "PHP Event Calendar SQL Injection Vulnerability",
        "body": "PHP Event Calendar is prone to an SQL-injection vulnerability. This issue is due to a failure in the application to properly sanitize user-supplied input before using it in SQL queries.A successful exploit could allow an attacker to compromise the application, access or modify data, or exploit vulnerabilities in the underlying database implementation."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/438580/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/438232/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-4040": [
      {
        "url": "http://www.securityfocus.com/bid/15706",
        "title": "FileLister Definesearch.JSP Cross-SIte Scripting Vulnerability",
        "body": "FileLister is prone to a cross-site scripting vulnerability. This issue is due to a failure in the application to properly sanitize user-supplied input.An attacker may leverage this issue to have arbitrary script code executed in the browser of an unsuspecting user in the context of the affected site.  This may facilitate the theft of cookie-based authentication credentials as well as other attacks."
      }
    ],
    "CVE-2005-4048": [
      {
        "url": "http://www.securityfocus.com/bid/15743",
        "title": "FFmpeg LibAVCodec Heap Buffer Overflow Vulnerability",
        "body": "FFmpeg's 'libavcodec' is prone to a heap buffer-overflow vulnerability. This issue is due to the library's failure to properly bounds-check user-supplied data before using it in memory allocation and copy operations. Attackers may exploit this vulnerability to execute arbitrary code in the context of applications that use an affected version of the libavcodec library. An attacker can exploit this issue by enticing a user to open a malformed PNG file with an application that uses a vulnerable version of libavcodec. If the application is configured as the default handler for PNG files, this could present a viable web or email attack vector -- when the PNG is clicked from an appropriate client application, the application using the vulnerable library will automatically be invoked."
      }
    ],
    "CVE-2005-4060": [
      {
        "url": "http://www.securityfocus.com/bid/15740",
        "title": "RWAuction Pro Search.ASP Cross-Site Scripting Vulnerability",
        "body": "The 'rwAuction Pro' application is prone to a cross-site scripting vulnerability. This issue is due to a failure in the application to properly sanitize user-supplied input. An attacker may leverage this issue to have arbitrary script code executed in the browser of an unsuspecting user in the context of the affected site. This may help the attacker steal cookie-based authentication credentials and launch other attacks.Versions 4.0 is vulnerable; prior versions may also be affected. "
      }
    ],
    "CVE-2005-4069": [
      {
        "url": "http://www.securityfocus.com/bid/15754",
        "title": "Sony SunnComm MediaMax Insecure Directory Permissions Vulnerability",
        "body": "SunnComm MediaMax is prone to an insecure directory permissions vulnerability.The vulnerability presents itself because the 'SunnComm Shared' directory allows 'Full Control' permissions to 'Everyone'. This insecure access control list associated with the directory can permit unprivileged attackers to read, modify and delete contents in the directory.  Local privilege escalation is also possible.SunnComm MediaMax 5.0.21.0 is known to be vulnerable to this issue, however, other versions may be affected as well."
      }
    ],
    "CVE-2005-4071": [
      {
        "url": "http://www.securityfocus.com/bid/15774",
        "title": "CFMagic Multiple Products Input Validation Vulnerabilities",
        "body": "CFMagic Products are prone to multiple input validation vulnerabilities. These are due to a lack of proper sanitization of user-supplied input.These vulnerabilities allow an attacker to inject malicious SQL code into database queries, and conduct cross-site scripting attacks. Magic Book Professional version 2.0 and prior, Magic List Professional version 2.5 and prior, and Magic Forum Personal versions 2.5 and prior are vulnerable.Other versions of these applications may also be affected."
      }
    ],
    "CVE-2005-4077": [
      {
        "url": "http://www.securityfocus.com/bid/15756",
        "title": "cURL / libcURL URL Parser Buffer Overflow Vulnerability",
        "body": "cURL and libcURL are prone to a buffer-overflow vulnerability. This issue is due to a failure in the library to perform proper bounds checks on user-supplied data before using it in a finite-sized buffer. The issues occur when the URL parser function handles an excessively long URL string. An attacker can exploit this issue to crash the affected library, effectively denying service. Arbitrary code execution may also be possible, which may facilitate a compromise of the underlying system."
      },
      {
        "url": "http://www.securityfocus.com/bid/17951",
        "title": "Apple Mac OS X Security Update 2006-003 Multiple Vulnerabilities",
        "body": "Apple Mac OS X is reported prone to multiple security vulnerabilities.These issue affect Mac OS X in the following applications or modules:- AppKit- ImageIO- BOM- CFNetwork- ClamAV- CoreFoundation- CoreGraphics- Finder- FTPServer- Flash Player- ImageIO- Keychain- LaunchServices- libcurl- Mail- MySQL Manager- Preview- QuickDraw- QuickTime Streaming Server- Ruby- SafariA remote attacker may exploit these issues to execute arbitrary code, trigger a denial-of-service condition, gain access to potentially sensitive information, or overwrite files. Other attacks may also be possible.Apple Mac OS X 10.4.6 and prior are reported vulnerable to these issues."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/418849/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-4089": [
      {
        "url": "http://www.securityfocus.com/bid/15660",
        "title": "Microsoft Internet Explorer CSS Import Cross-Domain Restriction Bypass Vulnerability",
        "body": "Microsoft Internet Explorer is prone to an issue that allows a violation of the cross-domain security model. The vulnerability arises because Internet Explorer fails to properly parse CSS files and facilitates importing of files that are not valid CSS files. This allows attackers to access HTML and script code from the remote site that was improperly imported as a CSS file. This site may reside in a domain other than the site that exploits the issue. An attacker may exploit this issue to steal sensitive information, which may aid in other attacks."
      }
    ],
    "CVE-2005-4092": [
      {
        "url": "http://www.securityfocus.com/bid/15732",
        "title": "Apple QuickTime/iTunes QuickTime.QTS Heap Overflow Vulnerability",
        "body": "A heap-based buffer overflow vulnerability has been reported in Apple QuickTime and iTunes.  This issue affects both Mac OS X and Microsoft Windows releases of the software.  This issue may be triggered when the application processes a malformed movie (.MOV) file. Successful exploitation will result in execution of arbitrary code in the context of the currently logged in user.This issue affects Apple QuickTime 7.0.3 and iTunes 6.0.1.  Earlier versions may also be affected."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/421635/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/421569/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/421547/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-4093": [
      {
        "url": "http://www.securityfocus.com/bid/15757",
        "title": "Check Point VPN-1 SecureClient Policy Bypass Vulnerability",
        "body": "VPN-1 SecureClient is reported prone to a policy bypass vulnerability. This issue is due to a failure of the application to securely implement remote administrator-provided policies on affected computers.This issue allows remote VPN users to bypass the administratively-defined security policies. Specific issues arising from this vulnerability depend on the intended policies defined by administrators. Some examples of the consequences are: unauthorized computers may connect, scripts may not execute, or insecure network configurations may be possible."
      }
    ],
    "CVE-2005-4190": [
      {
        "url": "http://www.securityfocus.com/bid/15802",
        "title": "Horde Turba Multiple HTML Injection Vulnerabilities",
        "body": "Turba is prone to multiple HTML-injection vulnerabilities because the application fails to properly validate user-supplied input before using it in dynamically generated content. Attacker-supplied HTML and script code would be executed in the context of the affected website, potentially allowing attackers to steal cookie-based authentication credentials. An attacker could also exploit these issues to control how the site is rendered to the user; other attacks are also possible."
      },
      {
        "url": "http://www.securityfocus.com/bid/15808",
        "title": "Horde Kronolith Multiple HTML Injection Vulnerabilities",
        "body": "Kronolith is prone to multiple HTML-injection vulnerabilities. These issues are due to a failure in the application to properly sanitize user-supplied input before using it in dynamically generated content. Attacker-supplied HTML and script code would be executed in the context of the affected website, potentially allowing for theft of cookie-based authentication credentials. An attacker could also exploit these issues to control how the site is rendered to the user; other attacks are also possible."
      },
      {
        "url": "http://www.securityfocus.com/bid/15803",
        "title": "Horde Mnemo Remote HTML Injection Vulnerabilities",
        "body": "Mnemo is prone to multiple HTML-injection vulnerabilities. Attacker-supplied HTML and script code would be executed in the context of the affected website, potentially allowing attackers to steal cookie-based authentication credentials. An attacker could also exploit these issues to control how the site is rendered to the user; other attacks are also possible. Mnemo 2.0.2 and prior versions are affected by these issues."
      },
      {
        "url": "http://www.securityfocus.com/bid/15804",
        "title": "Horde Nag Remote HTML Injection Vulnerabilities",
        "body": "Nag is prone to multiple HTML-injection vulnerabilities. Attacker-supplied HTML and script code would be executed in the context of the affected website, potentially allowing attackers to steal cookie-based authentication credentials. An attacker could also exploit these issues to control how the site is rendered to the user; other attacks are also possible. Nag 2.0.3 and prior versions are affected by these issues."
      },
      {
        "url": "http://www.securityfocus.com/bid/15806",
        "title": "Horde Application Framework Input Validation Vulnerabilities",
        "body": "Horde Application Framework is prone to multiple input-validation vulnerabilities. Remote attackers could exploit these vulnerabilities to perform cross-site scripting attacks to execute arbitrary HTML and script code in the browser of a vulnerable user. Horde Application Framework 3.0.7 and earlier are affected by these issues."
      },
      {
        "url": "http://www.securityfocus.com/bid/15810",
        "title": "Horde Application Framework CSV File Upload Code Execution Vulnerability",
        "body": "Horde Application Framework is prone to an arbitrary scriptcode-execution vulnerability when uploading CSV files. The application fails to properly sanitize user-supplied input. Horde Application Framework 3.0.7 and earlier are affected by this issue."
      }
    ],
    "CVE-2005-4195": [
      {
        "url": "http://www.securityfocus.com/bid/15818",
        "title": "Scout Portal Toolkit Multiple Input Validation Vulnerabilities",
        "body": "Scout Portal Toolkit is prone to multiple input-validation vulnerabilities because the application fails to properly sanitize user-supplied input. A successful exploit could allow an attacker to compromise the application, access or modify data, or exploit vulnerabilities in the underlying database. Other attacks are also possible."
      },
      {
        "url": "http://www.securityfocus.com/bid/29034",
        "title": "Scout Portal Toolkit 'ParentId' Parameter SQL Injection Vulnerability",
        "body": "Scout Portal Toolkit is prone to an SQL-injection vulnerability because it fails to sufficiently sanitize user-supplied data before using it in an SQL query.Exploiting this issue could allow an attacker to compromise the application, access or modify data, or exploit latent vulnerabilities in the underlying database.This issue affects Scout Portal Toolkit 1.4.0; other versions may also be vulnerable."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/491611/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-4198": [
      {
        "url": "http://www.securityfocus.com/bid/15801",
        "title": "Netref Index.php SQL Injection Scripting Vulnerability",
        "body": "Netref is prone to an SQL injection vulnerability.  This issue is due to a failure in the application to properly sanitize user-supplied input before using it in an SQL query.This vulnerability could permit remote attackers to pass malicious input to database queries, resulting in modification of query logic or other attacks.  Successful exploitation could also result in a compromise of the application, disclosure or modification of data, or may permit an attacker to exploit vulnerabilities in the underlying database implementation. Netref 3 is vulnerable to this issue; other versions may also be affected."
      },
      {
        "url": "http://www.securityfocus.com/bid/15862",
        "title": "Netref Index.PHP SQL Injection Vulnerability",
        "body": "Netref is prone to an SQL-injection vulnerability because the application fails to properly sanitize user-supplied input before using it in an SQL query.  A successful exploit could allow an attacker to compromise the application, access or modify data, or exploit vulnerabilities in the underlying database."
      }
    ],
    "CVE-2005-4199": [
      {
        "url": "http://www.securityfocus.com/bid/15793",
        "title": "MyBB Multiple SQL Injection Vulnerabilities",
        "body": "MyBB is prone to multiple SQL injection vulnerabilities.MyBB is prone to multiple SQL injection vulnerabilities. These issues are due to a failure in the application to properly sanitize user-supplied input before using it in SQL queries.  Successful exploitation could result in a compromise of the application, disclosure or modification of data, or may permit an attacker to exploit vulnerabilities in the underlying database implementation. "
      },
      {
        "url": "http://www.securityfocus.com/archive/1/420159/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/419067/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-4209": [
      {
        "url": "http://www.securityfocus.com/bid/15815",
        "title": "Alt-N MDaemon WorldClient Denial Of Service Vulnerability",
        "body": "MDaemon WorldClient is prone to a denial of service vulnerability.  This issue is due to a failure in the application to properly sanitize user-supplied input.An attacker can exploit this vulnerability to prevent a user from accessing their mail remotely through the WorldClient client application."
      }
    ],
    "CVE-2005-4214": [
      {
        "url": "http://www.securityfocus.com/archive/1/419382/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-4217": [
      {
        "url": "http://www.securityfocus.com/bid/15833",
        "title": "Apple Mac OS X Perl Insecure Privilege Dropping Weakness",
        "body": "Apple Mac OS X's Perl is susceptible to an insecure privilege-dropping weakness. This issue is due to Perl's failure to correctly drop privileges. Presumably, the cause of this issue is a flaw in Perl's compilation options. This vulnerability may allow attackers that exploit latent vulnerabilities in Perl applications to gain elevated privileges, increasing the potential for damage. The exact impact of exploitation depends on the specific use and implementation of the privilege-dropping facilities in affected Perl applications. Mac OS X version 10.3.9 is reported vulnerable to this issue. Other versions may also be affected."
      },
      {
        "url": "http://www.securityfocus.com/bid/16907",
        "title": "Apple Mac OS X Security Update 2006-001 Multiple Vulnerabilities",
        "body": "Apple has released Security Update 2006-001 to address multiple remote and local Mac OS X vulnerabilities.Apple has also released updates to address these issues."
      }
    ],
    "CVE-2005-4263": [
      {
        "url": "http://www.securityfocus.com/bid/15857",
        "title": "Envolution Multiple Input Validation Vulnerabilities",
        "body": "Envolution is prone to multiple input validation vulnerabilities.Successful exploitation of these vulnerabilities could result in a compromise of the application, disclosure or modification of data, the theft of cookie-based authentication credentials. They may also permit an attacker to exploit vulnerabilities in the underlying database implementation as well as other attacks."
      }
    ],
    "CVE-2005-4267": [
      {
        "url": "http://www.securityfocus.com/bid/15980",
        "title": "Qualcomm WorldMail IMAPD Buffer Overflow Vulnerability",
        "body": "WorldMail IMAPd service is prone to a remote buffer-overflow vulnerability. This issue is due to a failure in the application to do proper bounds checking on user-supplied data before using it in finite-sized buffers. An attacker can exploit this issue to crash the server resulting in a denial of service to legitimate users. Arbitrary code execution may also be possible; this may facilitate a compromise of the underlying system. This issue is reported to affect IMAPd service version 6.1.19.0 of WorldMail 3.0; other versions may also be vulnerable."
      }
    ],
    "CVE-2005-4268": [
      {
        "url": "http://www.securityfocus.com/bid/16057",
        "title": "CPIO File Size Stack Buffer Overflow Vulnerability",
        "body": "The cpio utility is prone to a stack buffer-overflow vulnerability. This issue presents itself when cpio tries to create an archive containing files of extremely large sizes, potentially resulting in a memory buffer being overrun. Note that this vulnerability presents itself only on 64-bit platforms. Presumably, on 32-bit platforms using 64-bit filesystems, this may be exploited to crash cpio."
      }
    ],
    "CVE-2005-4320": [
      {
        "url": "http://www.securityfocus.com/archive/1/419470/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-4348": [
      {
        "url": "http://www.securityfocus.com/bid/15987",
        "title": "Fetchmail Missing Email Header Remote Denial of Service Vulnerability",
        "body": "Fetchmail is affected by a remote denial-of-service vulnerability. This issue is due to the application's failure to handle unexpected input. This issue occurs only when Fetchmail is configured in 'multidrop' mode."
      },
      {
        "url": "http://www.securityfocus.com/bid/19289",
        "title": "Apple Mac OS X Multiple Security Vulnerabilities",
        "body": "Apple Mac OS X is prone to multiple security vulnerabilities.These issue affect Mac OS X and various applications including AFP Server, Bluetooth, Bom, DHCP, Image RAW, ImageIO, Launch Services, OpenSSH, and WebKit. A remote attacker may exploit these issues to execute arbitrary code, trigger denial-of-service conditions, escalate privileges, and disclose potentially sensitive information.Apple Mac OS X 10.4.7 and prior are reported vulnerable to these issues."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/435197/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/420098/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-4360": [
      {
        "url": "http://www.securityfocus.com/bid/15921",
        "title": "Microsoft Internet Information Server 5.1 DLL Request Remote Code Execution Vulnerability",
        "body": "Microsoft IIS is prone to a remote code-execution vulnerability because the application fails to properly bounds-check user-supplied data before copying it to an insufficiently sized memory buffer.Successfully exploiting this issue allows remote attackers to execute arbitrary code in the context of the vulnerable application, which may lead to the complete compromise of affected computers.This issue affects Microsoft IIS 5.1 running on Windows XP SP2.Note: this issue was previously reported as a denial-of-service vulnerability. New information from the vendor states that code execution is possible."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/419707/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-4380": [
      {
        "url": "http://www.securityfocus.com/bid/15962",
        "title": "Bitweaver Multiple Input Validation Vulnerabilities",
        "body": "bitweaver is prone to multiple input validation vulnerabilities. These issues are due to a failure in the application to properly sanitize user-supplied input.Successful exploitation of these vulnerabilities could result in a compromise of the application, disclosure or modification of data, the theft of cookie-based authentication credentials. They may also permit an attacker to exploit vulnerabilities in the underlying database implementation as well as other attacks.bitweaver 1.1.1 beta and prior are vulnerable; other versions may also be affected."
      }
    ],
    "CVE-2005-4444": [
      {
        "url": "http://www.securityfocus.com/bid/15973",
        "title": "Pegasus Mail Multiple Remote Code Execution Vulnerabilities",
        "body": "Pegasus Mail is prone to multiple remote code execution vulnerabilities.  The following specific vulnerabilities were identified:A buffer overflow vulnerability arises when the application handles a malformed POP3 reply from a server.An off-by-one buffer overflow vulnerability arises when the application handles a malicious email message.Pegasus Mail 4.21c and 4.30PB1 are reportedly vulnerable.  Other versions may be affected as well."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/419908/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-4459": [
      {
        "url": "http://www.securityfocus.com/bid/15998",
        "title": "VMWare Remote Arbitrary Code Execution Vulnerability",
        "body": "Multiple VMWare products are affected by a remote arbitrary code execution vulnerability.Successful exploitation can allow an attacker to execute arbitrary code on the vulnerable computer hosting VMWare.  This may result in a complete compromise.This issue affects VMWare Workstation, VMWare GSX Server, VMWare ACE, and VMWare Player."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/420017/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/419997/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-4500": [
      {
        "url": "http://www.securityfocus.com/bid/16030",
        "title": "MusicBox Type Parameter SQL Injection Vulnerability",
        "body": "MusicBox is prone to an SQL injection vulnerability.Successful exploitation could result in a compromise of the application, disclosure or modification of data, or may permit an attacker to exploit vulnerabilities in the underlying database implementation. This issue affects MusicBox version 2.3; other versions may also be vulnerable."
      }
    ],
    "CVE-2005-4515": [
      {
        "url": "http://www.securityfocus.com/bid/16038",
        "title": "Lois Software WebDB Search Module SQL Injection Vulnerability",
        "body": "Lois Software WebDB is prone to an SQL injection vulnerability.  This issue is due to a failure in the application to properly sanitize user-supplied input before using it in an SQL query.Successful exploitation could result in a compromise of the application, disclosure or modification of data, or may permit an attacker to exploit vulnerabilities in the underlying database implementation.WebDB 1.1 and prior are affected by this issue."
      }
    ],
    "CVE-2005-4560": [
      {
        "url": "http://www.securityfocus.com/bid/16074",
        "title": "Microsoft Windows Graphics Rendering Engine WMF SetAbortProc Code Execution Vulnerability",
        "body": "Microsoft Windows WMF graphics rendering engine is affected by a remote code-execution vulnerability. This issue affects the 'SetAbortProc' function. The problem presents itself when a user views a malicious WMF formatted file, triggering the vulnerability when the engine attempts to parse the file. The issue may be exploited remotely or locally. Any remote code execution that occurs will be with the privileges of the user viewing a malicious image. An attacker may gain SYSTEM privileges if an administrator views the malicious file. Local code execution may facilitate a complete compromise."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/420773/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/420687/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/420684/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/420682/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/420664/30/7730/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/420546/30/7730/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/420446/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/420378/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/420367/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/420357/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/420351/100/0/threaded",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/420288/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-4573": [
      {
        "url": "http://www.securityfocus.com/bid/15992",
        "title": "Plogger Remote File Include Vulnerabilities",
        "body": "Plogger is prone to a remote file include vulnerability.An attacker can exploit this issue to include an arbitrary remote file containing malicious PHP code and execute it in the context of the Web server process. This may facilitate a compromise of the application and the underlying system; other attacks are also possible."
      }
    ],
    "CVE-2005-4583": [
      {
        "url": "http://www.securityfocus.com/bid/16086",
        "title": "VMWare ESX Server Management Interface HTML Injection Vulnerability",
        "body": "VMware ESX Server is prone to an HTML-injection vulnerability in the Management Interface.This vulnerability may allow remote attackers to inject hostile HTML and script code into the application. This code may be executed in the browser of a vulnerable user.This issue may allow an attacker to potentially obtain administrative credentials."
      }
    ],
    "CVE-2005-4600": [
      {
        "url": "http://www.securityfocus.com/bid/16083",
        "title": "TinyMCE Compressor Multiple Vulnerabilities",
        "body": "TinyMCE Compressor is prone to multiple remote vulnerabilities. The script is affected by a file disclosure vulnerability.  Information gathered through the exploitation of this issue may aid in other attacks.The script is also affected by multiple cross-site scripting and HTML injection vulnerabilities.  An attacker may leverage these issues to have arbitrary script code executed in the browser of an unsuspecting user in the context of the affected site. This may facilitate the theft of cookie-based authentication credentials as well as other attacks. TinyMCE Compressor 1.0.5 and prior versions are vulnerable to these issues."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/420543/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-4667": [
      {
        "url": "http://www.securityfocus.com/bid/15968",
        "title": "Info-ZIP UnZip File Name Buffer Overflow Vulnerability",
        "body": "Info-ZIP 'unzip' is susceptible to a filename buffer-overflow vulnerability. The application fails to properly bounds-check user-supplied data before copying it into an insufficiently sized memory buffer. This issue allows attackers to execute arbitrary machine code in the context of users running the affected application."
      },
      {
        "url": "http://www.securityfocus.com/archive/1/430300/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-4807": [
      {
        "url": "http://www.securityfocus.com/bid/19555",
        "title": "GNU BinUtils GAS Buffer Overflow Vulnerability",
        "body": "GNU binutils GAS (GNU assembler) is prone to a buffer-overflow vulnerability because it fails to properly bounds-check user-supplied input before copying it to an insufficiently sized memory buffer.Remote attackers may crash the application or execute arbitrary machine code in the context of the application."
      }
    ],
    "CVE-2005-4837": [
      {
        "url": "http://www.securityfocus.com/bid/23762",
        "title": "Net-SNMP TCP Disconnect Remote Denial Of Service Vulnerability",
        "body": "Net-SNMP is prone to a remote denial-of-service vulnerability. The issue is exposed when Net-SNMP is configured to communicate over TCP; Net-SNMP using UDP is unaffected. This issue affects Net-SNMP when running in 'master agentx' mode. An attacker can exploit this issue to cause the affected service to crash, effectively denying service to legitimate users."
      }
    ],
    "CVE-2005-4840": [
      {
        "url": "http://www.securityfocus.com/archive/1/391803",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.securityfocus.com/archive/1/470694/100/0/threaded",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2005-4863": [
      {
        "url": "http://www.securityfocus.com/bid/11397",
        "title": "IBM DB2 DB2FMP Command String Buffer Overflow Vulnerability",
        "body": "A locally exploitable buffer overflow exists in IBM DB2.  This issue is due to insufficient bounds checking of data passed in a command string to the DB2FMP executable.Successful exploitation may allow execution of arbitrary code with elevated privileges.This is likely one of the issues announced in BIDs 11089 and 11327. It is now being assigned its own BID since the vendor has provided additional technical information.It is reported that some versions of DB2FMP may drop superuser privileges prior to the overflow condition being exploitable."
      }
    ],
    "CVE-2005-4864": [
      {
        "url": "http://www.securityfocus.com/bid/11390",
        "title": "IBM DB2 DB2LPORT Environment Variable Buffer Overflow Vulnerability",
        "body": "A locally exploitable buffer overflow exists in IBM DB2.  This issue is due to insufficient bounds checking of data included in the DB2LPORT environment variable.Successful exploitation may allow execution of arbitrary code with elevated privileges.This is likely one of the issues announced in BIDs 11089 and 11327. It is now being assigned its own BID since the vendor has provided additional technical information."
      }
    ],
    "CVE-2005-4865": [
      {
        "url": "http://www.securityfocus.com/bid/11399",
        "title": "IBM DB2 Stored Procedure Interface Library Name Buffer Overflow Vulnerability",
        "body": "A remotely exploitable buffer overflow exists in IBM DB2.  This issue is due to insufficient bounds checking of library names passed to the stored procedure interface.Successful exploitation may allow execution of arbitrary code, compromising the database server.This is likely one of the issues announced in BIDs 11089 and 11327. It is now being assigned its own BID since the vendor has provided additional technical information."
      }
    ],
    "CVE-2005-4866": [
      {
        "url": "http://www.securityfocus.com/bid/11401",
        "title": "IBM DB2 JDBC Applet Server Buffer Overflow Vulnerability",
        "body": "A remotely exploitable buffer overflow exists in IBM DB2 JDBC Applet Server.  This issue is due to insufficient bounds checking of data included in JDBC connection requests.Successful exploitation may allow execution of arbitrary code with the privileges of the affected service.This is likely one of the issues announced in BIDs 11089 and 11327. It is now being assigned its own BID since the vendor has provided additional technical information."
      }
    ],
    "CVE-2005-4867": [
      {
        "url": "http://www.securityfocus.com/bid/11396",
        "title": "IBM DB2 Universal Database Satadmin.SatEncrypt Remote Buffer Overflow Vulnerability",
        "body": "IBM DB2 Universal database is affected by a remote buffer overflow vulnerability.  This issue is due to a failure of the application to properly validate the length of user-supplied strings prior to copying them into finite process buffers.  The issue exists in the 'SATENCRYPT' function in the 'SATADMIN' schema.An attacker may leverage this issue to execute arbitrary code in the context of the vulnerable database application, facilitating unauthorized access and privilege escalation.This is one of the issues announced in BIDs 11089 and 11327. It is now being assigned its own BID since the vendor has provided additional technical information."
      }
    ],
    "CVE-2005-4868": [
      {
        "url": "http://www.securityfocus.com/bid/11402",
        "title": "IBM DB2 Universal Database Information Disclosure Vulnerability",
        "body": "An information disclosure vulnerability has been reported in IBM DB2. This vulnerability only exists when DB2 is installed on Microsoft Windows operating systems. This is due to a Windows permissions issue related to shared memory sections, culminating in authorized access to sensitive information.This vulnerability allows local users to inappropriately connect to DB2 IPC resources, and to also read files that may contain potentially sensitive information. This may aid them in further attacks.This issue was announced in BIDs 11089 and 11327. It is now being assigned its own BID since the vendor has provided additional technical information."
      }
    ],
    "CVE-2005-4870": [
      {
        "url": "http://www.securityfocus.com/bid/11404",
        "title": "IBM DB2 XML Extender UDF Buffer Overflow Vulnerabilities",
        "body": "Remotely exploitable buffer overflow vulnerabilities exist in IBM DB2.  These issues are due to insufficient bounds checking of data handled through XML Extender UDF's.Successful exploitation may allow execution of arbitrary code with the privilege of the DB2 UDB processes. It is reported that privileged code execution is also possible.These are likely some of the issues announced in BIDs 11089 and 11327. It is now being assigned its own BID since the vendor has provided additional technical information."
      }
    ],
    "CVE-2005-4871": [
      {
        "url": "http://www.securityfocus.com/bid/12170",
        "title": "IBM DB2 XML Function Unauthorized File Creation and Disclosure Vulnerability",
        "body": "IBM DB2 is reported prone to a vulnerability allowing attackers to create and disclose arbitrary files on an affected computer.  This issue may allow an attacker to corrupt data, disclose sensitive information and ultimately execute arbitrary code on a vulnerable computer.It is reported that this issue can be exploited by employing XML functions supplied with DB2 that allow users to create, overwrite, and disclose arbitrary files with the permissions of the DB2 server.The attacker must have a database connection to exploit this issue.  A successful attack can result in a complete compromise of the computer or the database.This issue appears to correspond to one of the unspecified vulnerabilities announced in BID 11327."
      }
    ],
    "CVE-2005-4879": [
      {
        "url": "http://www.securityfocus.com/bid/28523",
        "title": "Jax Guestbook 'jax_guestbook.php' Cross-Site Scripting Vulnerability",
        "body": "Jax Guestbook is prone to a cross-site scripting vulnerability because it fails to properly sanitize user-supplied input. An attacker may leverage this issue to execute arbitrary script code in the browser of an unsuspecting user in the context of the affected site. This may allow the attacker to steal cookie-based authentication credentials and to launch other attacks."
      }
    ]
  }
}