{
  "year": 2005,
  "total": 9,
  "reference": "docs.microsoft.com",
  "reports": {
    "CVE-2005-0563": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2005/ms05-029",
        "title": "Vulnerability in Outlook Web Access for Exchange Server 5.5 Could Allow Cross-Site Scripting Attacks (895179)",
        "body": "Who should read this document: System administrators who have servers that are running Outlook Web Access for Microsoft Exchange Server 5.5 Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Important Recommendation: Customers should apply the update at the earliest opportunity Security Update Replacement: None Caveats: None Version Requirements for Dependent Components for This Update:For this update to be installed successfully, the Microsoft Outlook Web Access server must have one of the following installed: Internet Explorer 5.01 Service Pack 3 installed when using Windows 2000 Service Pack 3Internet Explorer 5.01 Service Pack 4 installed when using Windows 2000 Service Pack 4Internet Explorer 6 Service Pack 1 installed when using other supported operating systems Version Recommendations for Dependent Components on the Outlook Web Access Server:The following versions are recommended for dependent components on the Outlook Web Access server: Microsoft Internet Information Services (IIS):IIS 5.0 on Windows 2000 Service Pack 3 or laterMicrosoft Internet Explorer:Internet Explorer 6.0 Service Pack 1",
        "extra": "This update resolves a newly-discovered, privately-reported vulnerability. A cross-site scripting and spoofing vulnerability exists in Outlook Web Access for Exchange Server 5.5 that could allow an attacker to convince a user to run a malicious script. The vulnerability is documented in the “Vulnerability Details” section of this bulletin. An attacker who successfully exploited the vulnerability could perform cross-site scripting attacks. We recommend customers should apply the update at the earliest opportunity."
      }
    ],
    "CVE-2005-0050": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2005/ms05-010",
        "title": "Vulnerability in the License Logging Service Could Allow Code Execution (885834)",
        "body": "Who should read this document: Customers who use Microsoft Windows Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately. Security Update Replacement: None Caveats: Microsoft Knowledge Base Article 885834 documents the currently known issues that customers may experience when they install this security update. The article also documents recommended solutions for these issues. For more information, see Microsoft Knowledge Base Article 885834.",
        "extra": "This update resolves a newly-discovered, privately-reported vulnerability. The vulnerability is documented in the “Vulnerability Details” section of this bulletin. An attacker who successfully exploited this vulnerability could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. We recommend that customers apply the update immediately."
      }
    ],
    "CVE-2005-0560": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2005/ms05-021",
        "title": "Vulnerability in Exchange Server Could Allow Remote Code Execution (894549)",
        "body": "Who should read this document: Customers who use Microsoft Exchange Server Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately. Security Update Replacement: This bulletin replaces a prior security update. See the frequently asked questions (FAQ) section of this bulletin for the complete list. Caveats: The security update for Exchange 2000 Server Service Pack 3 requires, as a prerequisite, the Exchange 2000 Server Post-Service Pack 3 (SP3) Update Rollup. You must install the Update Rollup for Exchange 2000 (KB870540) before you install the security update that is provided in this security bulletin. This security update will detect whether the Update Rollup is installed. If the Update Rollup is not installed, you will be directed to the download Web site. For more information, see Microsoft Knowledge Base Article 870540. To download the prerequisite update, visit this Web site.",
        "extra": "This update resolves a newly-discovered, privately-reported vulnerability in Microsoft Exchange Server that could allow an attacker to run arbitrary code on the system. The vulnerability is documented in the “Vulnerability Details” section of this bulletin. An attacker who successfully exploited this vulnerability could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights."
      }
    ],
    "CVE-2005-0803": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2005/ms05-053",
        "title": "Vulnerabilities in Graphics Rendering Engine Could Allow Code Execution (896424)",
        "body": "Who should read this document: Customers who use Microsoft Windows Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately. Security Update Replacement: This bulletin replaces several prior security updates. See the frequently asked questions (FAQ) section of this bulletin for the complete list. Caveats: None",
        "extra": "This update resolves several newly-discovered, privately reported and public vulnerabilities. Each vulnerability is documented in this bulletin in its own \"Vulnerability Details\" section of this bulletin. An attacker who successfully exploited the most severe of these vulnerabilities could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. We recommend that customers apply the update immediately."
      }
    ],
    "CVE-2005-1790": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2005/ms05-054",
        "title": "Cumulative Security Update for Internet Explorer (905915)",
        "body": "Who should read this document: Customers who use Microsoft Windows Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately. Security Update Replacement: This update replaces the update that is included with Microsoft Security Bulletin MS05-052. That update is also a cumulative update. Caveats: Microsoft Knowledge Base Article 905915 documents the currently known issues that customers may experience when they install this security update. The article also documents recommended solutions for these issues. For more information, see Microsoft Knowledge Base Article 905915. This update does include hotfixes that have been released since the release of MS04-004 and MS04-025, but they will only be installed on systems that need them. Customers who have received hotfixes from Microsoft or from their support providers since the release of MS04-004 or MS04-025 should review the “I have received a hotfix from Microsoft or my support provider since the release of MS04-004. Is that hotfix included in this security update?” question in the FAQ section of this bulletin to determine how you can make sure that the necessary hotfixes are installed. Microsoft Knowledge Base Article 905915 also documents this in more detail.",
        "extra": "This update resolves several newly-discovered, publicly and privately reported vulnerabilities. Each vulnerability is documented in its own “Vulnerability Details” section of this bulletin. If a user is logged on with administrative user rights, an attacker who successfully exploited the most severe of these vulnerabilities could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than users who operate with administrative user rights. We recommend that customers apply the update immediately."
      }
    ],
    "CVE-2005-2087": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2005/ms05-037",
        "title": "Vulnerability in JView Profiler Could Allow Remote Code Execution (903235)",
        "body": "Who should read this document: Customers who use Microsoft Windows Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately. Security Update Replacement: None Caveats: None",
        "extra": "This update resolves a newly-discovered, public vulnerability. A COM object, the JView Profiler (Javaprxy.dll), when instantiated in Internet Explorer, contains a remote code execution vulnerability that could allow an attacker to take complete control of an affected system. Since the JView Profiler COM object was not designed to be accessed through Internet Explorer, this update sets the kill bit for the JView Profiler (Javaprxy.dll) COM object. The vulnerability is documented in the “Vulnerability Details” section of this bulletin. If a user is logged on with administrative user rights, an attacker who successfully exploited this vulnerability could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than users who operate with administrative user rights. We recommend that customers apply the update immediately."
      }
    ],
    "CVE-2005-2127": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2005/ms05-052",
        "title": "Cumulative Security Update for Internet Explorer (896688)",
        "body": "Who should read this document: Customers who use Microsoft Windows Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately. Security Update Replacement: This update replaces the update that is included with Microsoft Security Bulletin MS05-038. That update is also a cumulative update. Caveats: Microsoft Knowledge Base Article 896688 documents the currently known issues that customers may experience when they install this security update. The article also documents recommended solutions for these issues. For more information, see Microsoft Knowledge Base Article 896688. This update does include hotfixes that have been released since the release of MS04-004 or MS04-025, but they will only be installed on systems that need them. Customers who have received hotfixes from Microsoft or from their support providers since the release of MS04-004 or MS04-025 should review the “I have received a hotfix from Microsoft or my support provider since the release of MS04-004. Is that hotfix included in this security update?” question in the FAQ section of this bulletin to determine how you can make sure that the necessary hotfixes are installed. Microsoft Knowledge Base Article 896688 also documents this in more detail.",
        "extra": "This update resolves a newly-discovered public vulnerability and other privately-reported variations of the same vulnerability. The Microsoft DDS Library Shape Control (Msdds.dll) and other COM objects could, when instantiated in Internet Explorer, allow an attacker to take complete control of an affected system. Because these COM objects were not designed to be instantiated in Internet Explorer, this update sets the kill bit for the affected Class Identifiers (CLSID) in these COM objects. The vulnerability is documented in the “Vulnerability Details” section of this bulletin. If a user is logged on with administrative user rights, an attacker who successfully exploited this vulnerability could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than users who operate with administrative user rights. We recommend that customers apply the update immediately."
      }
    ],
    "CVE-2005-4089": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2006/ms06-021",
        "title": "Cumulative Security Update for Internet Explorer (916281)",
        "body": "Who should read this document: Customers who use Microsoft Windows Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately. Security Update Replacement: This bulletin replaces several prior security updates. See the frequently asked questions (FAQ) section of this bulletin for the complete list. Caveats: Microsoft Knowledge Base Article 916281 documents the currently known issues that customers may experience when they install this security update. The article also documents recommended solutions for these issues. For more information, see Microsoft Knowledge Base Article 916281. Microsoft is releasing an additional security update included with Microsoft Security Bulletin MS06-023: Vulnerability in Microsoft JScript Could Allow Remote Code Execution (917344). We recommend that you install both security updates at the same time as an update in Microsoft Security Bulletin MS06-021: Cumulative Security Update for Internet Explorer (916281) could expose the JScript vulnerability or cause application compatibility issues.This security update also replaces the cumulative update for Internet Explorer that was released on February 28, 2006. For more information about this update, see Microsoft Knowledge Base Article 912945.This security update also replaces the compatibility patch released on April 11, 2006. That compatibility patch temporarily returned Internet Explorer to the previous functionality for handling ActiveX controls, to help enterprise customers who needed more time to prepare for the ActiveX update changes discussed in Microsoft Knowledge Base Article 912945. This security update replaces that compatibility patch, and makes the changes in Microsoft Knowledge Base Article 912945 permanent. For more information about these changes, see Microsoft Knowledge Base Article 912945 and the product documentation.",
        "extra": "This update resolves several newly discovered, publicly and privately reported vulnerabilities. Each vulnerability is documented in its own “Vulnerability Details” section of this bulletin. If a user is logged on with administrative user rights, an attacker who successfully exploited the most severe of these vulnerabilities could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than users who operate with administrative user rights. We recommend that customers apply the update immediately."
      }
    ],
    "CVE-2005-4560": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2006/ms06-001",
        "title": "Vulnerability in Graphics Rendering Engine Could Allow Remote Code Execution (912919)",
        "body": "Who should read this document: Customers who use Microsoft Windows Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately. Security Update Replacement: None",
        "extra": "This update resolves a newly-discovered, public vulnerability. The vulnerability is documented in the \"Vulnerability Details\" section of this bulletin. Note This vulnerability is currently being exploited and was previously discussed by Microsoft in Microsoft Security Advisory 912840. If a user is logged on with administrative user rights, an attacker who successfully exploited this vulnerability could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than users who operate with administrative user rights. We recommend that customers apply the update immediately."
      }
    ]
  }
}