{
  "year": 2011,
  "total": 177,
  "reference": "kb.cert.org",
  "reports": {
    "CVE-2011-0049": [
      {
        "url": "http://www.kb.cert.org/vuls/id/363726",
        "title": "Majordomo 2 _list_file_get() directory traversal vulnerability",
        "overview": "Majordomo 2 contains a directory traversal vulnerability in the _list_file_get()function, which may allow a remote, unauthenticated attacker to obtain sensitive information.",
        "description": "Majordomo 2 contains a directory traversal vulnerability in the _list_file_get()function (lib/Majordomo.pm) caused by an input validation error when handling files. An attacker can exploit this vulnerability via directory traversal specifiers sent in a specially crafted request to any of the application's interfaces (e.g. email or web).Additional information regarding this vulnerability can be found in this Sitewatch Advisory.",
        "impact": "A remote unauthenticated attacker could obtain sensitive information."
      }
    ],
    "CVE-2011-0096": [
      {
        "url": "http://www.kb.cert.org/vuls/id/326549",
        "title": "Microsoft Windows MHTML script injection vulnerability",
        "overview": "Microsoft Windows contains an script injection vulnerability in the MHTML protocol handler, which may allow an attacker to execute arbitrary script within the context of another website domain.",
        "description": "Microsoft Windows contains a script injection vulnerability caused by the way MHTML interprets MIME-formatted requests for content blocks within a document. According to Microsoft TechNet Security Research & Defense blog: \"It is possible under certain conditions for this vulnerability to allow an attacker to inject a client-side script in the response of a Web request run in the context of the victim's Internet Explorer. The script could spoof content, disclose information, or take any action that the user could take on the affected Web site on behalf of the targeted user.\"",
        "impact": "By convincing a user to view a specially crafted HTML document (e.g., a web page or an HTML email message), an attacker may be able to obtain access to web content in another domain. The impact is similar to that of a cross-site scripting vulnerability. For a more detailed description of the impact of cross-site scripting vulnerabilities, please see CERT Advisory CA-2000-02."
      }
    ],
    "CVE-2011-0284": [
      {
        "url": "http://www.kb.cert.org/vuls/id/943220",
        "title": "MIT KDC vulnerable to double-free when PKINIT enabled",
        "overview": "The KDC in releases krb5-1.7 and later are vulnerable to a double-free vulnerability if they are configured to respond to PKINIT requests.",
        "description": "The MIT krb5 Security Advisory 2011-003 states:\"The MIT Kerberos 5 Key Distribution Center (KDC) daemon is vulnerable to a double-free condition if the Public Key Cryptography for Initial Authentication (PKINIT) capability is enabled, resulting in daemon crash or arbitrary code execution (which is believed to be difficult).\"",
        "impact": "An unauthenticated remote attacker can induce a double-free event, causing the KDC daemon to crash (denial of service), or to execute arbitrary code."
      }
    ],
    "CVE-2011-0346": [
      {
        "url": "http://www.kb.cert.org/vuls/id/427980",
        "title": "Microsoft Internet Explorer 8 use-after-free vulnerability",
        "overview": "Microsoft Internet Explorer 8 is susceptible to a use-after-free vulnerability in the mshtml.dll library.",
        "description": "The use-after-free vulnerability is triggered when handling circular memory references. Full details of the crash can be found at Michal Zalewski's website. Additional details about the fuzzer used to find this vulnerability can be found at Michal Zalewski's blog.",
        "impact": "An attacker can cause the browser to crash and may be able to execute arbitrary code as the user."
      }
    ],
    "CVE-2011-0406": [
      {
        "url": "http://www.kb.cert.org/vuls/id/180119",
        "title": "WellinTech KingView 6.53 remote heap overflow vulnerability",
        "overview": "WellinTech KingView 6.53 contains a remote heap overflow vulnerability in the HistorySrv process which may allow a remote, unauthenticated attacker to execute arbitrary code.",
        "description": "According to WellinTech's website: \"KingView software is a high-pormance production which can be used to building a data information service platform in automatic field. KingView software can provide graphic visualization which takes your operations management, control and optimization. KingView is widely used in power, water conservancy,buildings, coalmine, environmental protection, metallurgy and so on. \" KingView runs a HistorySrv service that listens on port 777 that listens for incoming connections. This service is vulnerable to a remote heap overflow when a payload containing malicious Flink and Blink pointers are sent to the service.Exploit code for this vulnerability is publicly available.",
        "impact": "An attacker can cause the service to crash and may be able to execute arbitrary code as the user."
      }
    ],
    "CVE-2011-0408": [
      {
        "url": "http://www.kb.cert.org/vuls/id/643140",
        "title": "Libpng 1.5.0 png_set_rgb_to_gray() vulnerability",
        "overview": "Libpng-1.5.0 introduced a vulnerability in the rgb-to-gray transform function.",
        "description": "Libpng based applications that call the png_set_rgb_to_gray() function from pngrtran.c are vulnerable. Libpng versions prior to 1.5.0 are not vulnerable.",
        "impact": "An attacker may cause the application to crash or execute arbitrary code as the user."
      }
    ],
    "CVE-2011-0410": [
      {
        "url": "http://www.kb.cert.org/vuls/id/547167",
        "title": "CollabNet ScrumWorks Basic Server transmits credential information in plaintext",
        "overview": "Communication between the Collabnet ScrumWorks Basic Server and CollabNet ScrumWorks Desktop Client transmits credential information in plaintext.",
        "description": "The communication between the CollabNet ScrumWorks Basic Server and CollabNet ScrumWorks Desktop Client is transmitting credential information in plaintext. The CollabNet ScrumWorks Basic Server communicates with the CollabNet ScrumWorks Desktop Client using unencrypted java objects. These unencrypted java objects contain the username and password of the active user or (by calling specific functions) all users on the CollabNet ScrumWorks Basic Server. An additional vulnerability exists in CollabNet ScrumWorks where the ScrumWorks Basic Server stores unencrypted client username and passwords in its internal database.",
        "impact": "An attacker could view the credentials of the active client or all of the authenticated client's username and password hashs using a packet capturing tool."
      }
    ],
    "CVE-2011-0411": [
      {
        "url": "http://www.kb.cert.org/vuls/id/MORO-8ELH6Z",
        "title": "STARTTLS plaintext command injection vulnerability",
        "overview": "Some STARTTLS implementations could allow a remote attacker to inject commands during the plaintext phase of the protocol.",
        "description": "STARTTLS is an extension to plaintext communication protocols that offers a way to upgrade a plaintext connection to an encrypted (TLS or SSL) connection instead of using a separate port for encrypted communication. Some implementations of STARTTLS contain a vulnerability that could allow a remote unauthenticated attacker to inject commands during the plaintext protocol phase, that will be executed during the ciphertext protocol phase. This vulnerability is caused by the switch from plaintext to TLS being implemented below the application's I/O buffering layer.This issue is only of practical concern for affected implementations that also perform correct certificate validation. Implementations which do not perform certificate validation are already inherently vulnerable to man-in-the-middle attacks.Note: Not all implementations of STARTTLS are affected by this vulnerability. Some implementations of Simple Authentication and Security Layer (SASL) could also be affected by this vulnerability. Please see the Vendor Information below for specific vendor information.",
        "impact": "A remote attacker with the ability to pose as a man-in-the-middle may be able to inject commands for the corresponding protocol (e.g., SMTP, POP3, etc.) during the plaintext protocol phase, that will then be executed during the ciphertext protocol phase."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/555316",
        "title": "STARTTLS plaintext command injection vulnerability",
        "overview": "Some STARTTLS implementations could allow a remote attacker to inject commands during the plaintext phase of the protocol.",
        "description": "STARTTLS is an extension to plaintext communication protocols that offers a way to upgrade a plaintext connection to an encrypted (TLS or SSL) connection instead of using a separate port for encrypted communication. Some implementations of STARTTLS contain a vulnerability that could allow a remote unauthenticated attacker to inject commands during the plaintext protocol phase, that will be executed during the ciphertext protocol phase. This vulnerability is caused by the switch from plaintext to TLS being implemented below the application's I/O buffering layer.This issue is only of practical concern for affected implementations that also perform correct certificate validation. Implementations which do not perform certificate validation are already inherently vulnerable to man-in-the-middle attacks.Note: Not all implementations of STARTTLS are affected by this vulnerability. Some implementations of Simple Authentication and Security Layer (SASL) could also be affected by this vulnerability. Please see the Vendor Information below for specific vendor information.",
        "impact": "A remote attacker with the ability to pose as a man-in-the-middle may be able to inject commands for the corresponding protocol (e.g., SMTP, POP3, etc.) during the plaintext protocol phase, that will then be executed during the ciphertext protocol phase."
      }
    ],
    "CVE-2011-0413": [
      {
        "url": "http://www.kb.cert.org/vuls/id/686084",
        "title": "ISC DHCP server DHCPv6 decline message processing vulnerability",
        "overview": "ISC DHCPv6 versions 4.0.x - 4.2.x are susceptible to a denial-of-service vulnerability.",
        "description": "The ISC Advisory states:\"When the DHCPv6 server code processes a message for an address that was previously declined and internally tagged as abandoned it can trigger an assert failure resulting in the server crashing. This could be used to crash DHCPv6 servers remotely. This issue only affects DHCPv6 servers. DHCPv4 servers are unaffected.\"",
        "impact": "A remote attacker may cause a denial of service."
      }
    ],
    "CVE-2011-0414": [
      {
        "url": "http://www.kb.cert.org/vuls/id/559980",
        "title": "ISC Bind 9 IXFR or DDNS update combined with high query rate DoS vulnerability",
        "overview": "A denial-of-service condition exists in certain cases when an ISC Bind server processes a IXFR transfer or dynamic update.",
        "description": "The ISC security advisory states:\"When an authoritative server processes a successful IXFR transfer or a dynamic update, there is a small window of time during which the IXFR/update coupled with a query may cause a deadlock to occur. This deadlock will cause the server to stop processing all requests. A high query rate and/or a high update rate will increase the probability of this condition.\"",
        "impact": "An attacker may cause the Bind server to stop processing all requests."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/449980"
      }
    ],
    "CVE-2011-0487": [
      {
        "url": "http://www.kb.cert.org/vuls/id/680540",
        "title": "ICQ 7 fails to verify the origin of software updates",
        "overview": "ICQ 7 does not verify the origin of automatic updates which may allow a remote attacker to execute arbitrary code.",
        "description": "According to ICQ's website: \"ICQ, the pioneer of Instant Messaging (IM), now offers the optimal integration between Instant Messaging and Social Networks with the newest ICQ version – the Social Messaging tool that can be downloaded free of charge at www.icq.com.\" ICQ 7 checks for updates on start-up but does not verify the origin of updates through digital signatures or other means. An attacker who can successfully spoof update.icq.com using a man-in-the-middle attack, DNS poisoning, or some other means can cause the client to download a malicious software update.",
        "impact": "By successfully spoofing the update site, an attacker may be able to execute arbitrary code with the privileges of the user."
      }
    ],
    "CVE-2011-0488": [
      {
        "url": "http://www.kb.cert.org/vuls/id/506864",
        "title": "InduSoft NTWebServer web service stack-based buffer overflow",
        "overview": "InduSoft NTWebServer web service contains a stack-based buffer overflow vulnerability.",
        "description": "According to InduSoft's website: \"InduSoft Web Studio™ is a powerful collection of automation tools that provide all the automation building blocks to develop HMIs, SCADA systems and embedded instrumentation solutions. Utilize InduSoft integrated Web technologies to take advantage of Internet/intranet connectivity.\" InduSoft NTWebServer runs a test web service on port 80/tcp. InduSoft NTWebServer test web service is vulnerable to a stack-based buffer overflow when more than 2048 bytes are written to the fixed-size stack buffer causing the test web service to write past the bounds of the buffer and corrupt the memory.",
        "impact": "An attacker can cause the service to crash and may be able to execute arbitrary code."
      }
    ],
    "CVE-2011-0489": [
      {
        "url": "http://www.kb.cert.org/vuls/id/782567",
        "title": "Objectivity/DB administration tools lack authentication",
        "overview": "The administration tools (i.e. ookillls, oostopams, etc) for Objectivity/DB do not require authentication for local or remote operation.",
        "description": "Objectivity/DB comes with several administration tools for database maintenance. By design, these tools do not require authentication. An attacker can emulate the functionality of the administration tools with a custom script as well.",
        "impact": "An unauthenticated remote attacker can run commands on the database server. Confidentiality, Integrity, and Availability of the data can be compromised by the attacker."
      }
    ],
    "CVE-2011-0517": [
      {
        "url": "http://www.kb.cert.org/vuls/id/496040",
        "title": "Sielco Sistemi Winlog server stack overflow",
        "overview": "Sielco Sistemi Winlog TCP/IP server contains a stack overflow vulnerability",
        "description": "According to Sielco Sistemi's website: \"Winlog is a software package for SCADA/HMI applications with web support, OPC client and a wide library of communication drivers and protocols for most PLCs (Siemens, Omron, Allen Bradley, Modbus, etc.)\" Sielco Sistemi Winlog has the capability to accept remote connections by enabling the \"Run TCP/IP server\" option. The server listens on port 46823/tcp. A specially crafted packet from a remote attacker can cause a stack overflow possibly allowing an attacker to execute arbitrary code.For additional information see ICS-CERT Advisory ICSA-11-017-02.Public exploit code is available for this vulnerability.",
        "impact": "A remote attacker can cause the device to crash and may be able to execute arbitrary code."
      }
    ],
    "CVE-2011-0538": [
      {
        "url": "http://www.kb.cert.org/vuls/id/215900",
        "title": "Wireshark 6LoWPAN denial of service vulnerability",
        "overview": "Wireshark will crash on 32-bit systems while reading a malformed 6LoWPAN packet.",
        "description": "Paul Makowski's report states:dissect_6lowpan_iphc() in /epan/dissectors/packet-6lowpan.c trusts user supplied data when incrementing 'offset'. It is possible for the user to increment 'offset' to a value greater than tvb->length and/or tvb->reported_length, forcing the dissector to attempt dissection out of bounds. If 'offset' is greater than tvb->length or tvb->reported_length, then tvb_length_remaining() or tvb_reported_length_remaining() will return -1 respectively. If tvb_length_remaining() returns -1, then a buffer is allocated 1 byte too short, leading to a partial overwrite of the heap canary.",
        "impact": "An attacker may trigger a denial of service, causing any active capture or .pcap dissection to crash Wireshark/tshark."
      }
    ],
    "CVE-2011-0560": [
      {
        "url": "http://www.kb.cert.org/vuls/id/812969",
        "title": "Adobe Flash memory corruption vulnerability",
        "overview": "Adobe Flash contains an memory corruption vulnerability that can allow a remote, unauthenticated attacker to execute arbitrary code.",
        "description": "Adobe Flash versions 10.1.102.64 and earlier contain a vulnerability that can result in memory corruption, which can allow arbitrary code execution. Please see Adobe Security Bulletin APSB11-02 and Adobe Security Bulletin APSB11-03.Note that separate instances of Flash are provided in a variety of Adobe products, including Adobe Reader and Acrobat. Updating Flash Player does not update the Flash runtime included in other products.",
        "impact": "By convincing a user to view a specially crafted HTML document (e.g., a web page or an HTML email message or attachment), PDF file, Microsoft Office document, or any other document that supports embedded SWF content, an attacker may be able to execute arbitrary code. The vulnerability reportedly affects Flash Player 10.1.102.64 and earlier versions for Windows, Macintosh, Linux, and Solaris."
      }
    ],
    "CVE-2011-0561": [
      {
        "url": "http://www.kb.cert.org/vuls/id/812969",
        "title": "Adobe Flash memory corruption vulnerability",
        "overview": "Adobe Flash contains an memory corruption vulnerability that can allow a remote, unauthenticated attacker to execute arbitrary code.",
        "description": "Adobe Flash versions 10.1.102.64 and earlier contain a vulnerability that can result in memory corruption, which can allow arbitrary code execution. Please see Adobe Security Bulletin APSB11-02 and Adobe Security Bulletin APSB11-03.Note that separate instances of Flash are provided in a variety of Adobe products, including Adobe Reader and Acrobat. Updating Flash Player does not update the Flash runtime included in other products.",
        "impact": "By convincing a user to view a specially crafted HTML document (e.g., a web page or an HTML email message or attachment), PDF file, Microsoft Office document, or any other document that supports embedded SWF content, an attacker may be able to execute arbitrary code. The vulnerability reportedly affects Flash Player 10.1.102.64 and earlier versions for Windows, Macintosh, Linux, and Solaris."
      }
    ],
    "CVE-2011-0611": [
      {
        "url": "http://www.kb.cert.org/vuls/id/230057",
        "title": "Adobe Flash Player contains unspecified code execution vulnerability",
        "overview": "Adobe Flash contains a vulnerability that can allow a remote, unauthenticated attacker to execute arbitrary code on a vulnerable system.",
        "description": "The following versions of Adobe Flash versions contain an unspecified vulnerability that can result in memory corruption:Adobe Flash Player 10.2.153.1 and earlier versions for Windows, Macintosh, Linux and Solaris operating systemsAdobe Flash Player 10.2.154.25 and earlier for Google Chrome usersAdobe Flash Player 10.2.156.11 and earlier for AndroidThe Authplay.dll component that ships with Adobe Reader and Acrobat X (10.0.2) and earlier 10.x and 9.x versions for Windows and Macintosh operating systems.This vulnerability is being actively exploited in the wild. Exploit code for this vulnerability is publicly available as well.Any application that supports Flash or provides its own runtime may be vulnerable. Updating Flash Player does not update the Flash runtime included in those products. Note that separate instances of Flash are provided in a variety of Adobe products, including Adobe Reader and Acrobat. Adobe states that Adobe Reader 9.x for UNIX, Adobe Reader for Android, and Adobe Reader and Acrobat 8.x are not affected by this issue.",
        "impact": "By convincing a user to view a specially crafted HTML document (e.g., a web page or an HTML email message or attachment), PDF file, Microsoft Office document, or any other document that supports embedded SWF content, an attacker may be able to execute arbitrary code."
      }
    ],
    "CVE-2011-0654": [
      {
        "url": "http://www.kb.cert.org/vuls/id/323172",
        "title": "Microsoft Windows browser election message kernel pool overflow",
        "overview": "A vulnerability exists in the way the Microsoft Windows browser service handles Browser Election messages.",
        "description": "From Description of the Microsoft Computer Browser Service:\"The browser service maintains a list of the domain name or workgroup name the computer is in, and the protocol being used for each computer on the network segment being served by the computer running the browser service. On each network segment, a master browser is elected from the group of computers located on the segment that are running the browser service.\"The computer browser service protocol driver contains an integer underflow error in browser election message handling, which can cause a kernel pool buffer overrun resulting in memory corruption. The vulnerable code is only reached if the computer is the Master Browser. However, according to the Microsoft Security Research and Defense blog, the election of the Master Browser varies depending on network configuration:\"In normal enterprise networks the Primary Domain Controller (PDC) will become Master Browser, but depending on the network configuration, other computers on the network can become Master Browser, and therefore be vulnerable. A single system will be Master Browser at any point in time.\"For more information, please see Microsoft Security Bulletin MS11-019.",
        "impact": "Using a specially crafted Browser Election message, an attacker may be able to cause a Denial of Service (DoS) or execute arbitrary code."
      }
    ],
    "CVE-2011-0679": [
      {
        "url": "http://www.kb.cert.org/vuls/id/375127",
        "title": "IBM WebSphere Portal Server input validation vulnerability",
        "overview": "IBM WebSphere Portal Server does not validate entry path inputted data.",
        "description": "From the IBM Portal website: \"IBM WebSphere Portal software provides a composite application or business mashup framework and the advanced tooling needed to build flexible, SOA-based solutions, as well as the unmatched scalability required by any size organization.\" IBM WebSphere Portal Server is vulnerable to data leakage caused by missing input validation on inputted entry path transmitted via XML.",
        "impact": "An attacker with valid login credentials could leverage this vulnerability to retrieve system information, such as /etc/passwd."
      }
    ],
    "CVE-2011-0713": [
      {
        "url": "http://www.kb.cert.org/vuls/id/215900",
        "title": "Wireshark 6LoWPAN denial of service vulnerability",
        "overview": "Wireshark will crash on 32-bit systems while reading a malformed 6LoWPAN packet.",
        "description": "Paul Makowski's report states:dissect_6lowpan_iphc() in /epan/dissectors/packet-6lowpan.c trusts user supplied data when incrementing 'offset'. It is possible for the user to increment 'offset' to a value greater than tvb->length and/or tvb->reported_length, forcing the dissector to attempt dissection out of bounds. If 'offset' is greater than tvb->length or tvb->reported_length, then tvb_length_remaining() or tvb_reported_length_remaining() will return -1 respectively. If tvb_length_remaining() returns -1, then a buffer is allocated 1 byte too short, leading to a partial overwrite of the heap canary.",
        "impact": "An attacker may trigger a denial of service, causing any active capture or .pcap dissection to crash Wireshark/tshark."
      }
    ],
    "CVE-2011-0764": [
      {
        "url": "http://www.kb.cert.org/vuls/id/376500",
        "title": "Foolabs Xpdf contains a denial of service vulnerability",
        "overview": "Foolabs Xpdf contains a denial of service vulnerability caused by the t1lib library incorrectly parsing Type 1 fonts.",
        "description": "According to Foolabs: Xpdf is an open source viewer for Portable Document Format (PDF) files. (These are sometimes also called 'Acrobat' files, from the name of Adobe's PDF software.) The Xpdf project also includes a PDF text extractor, PDF-to-PostScript converter, and various other utilities. Foolabs Xpdf contains a denial of service vulnerability caused by the t1lib library incorrectly parsing Type 1 fonts. This vulnerability may allow an attacker to execute arbitrary code.",
        "impact": "A remote attacker can cause the device to crash and may be able to execute arbitrary code."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/MAPG-8ECL8X",
        "title": "Foolabs Xpdf contains a denial of service vulnerability",
        "overview": "Foolabs Xpdf contains a denial of service vulnerability caused by the t1lib library incorrectly parsing Type 1 fonts.",
        "description": "According to Foolabs: Xpdf is an open source viewer for Portable Document Format (PDF) files. (These are sometimes also called 'Acrobat' files, from the name of Adobe's PDF software.) The Xpdf project also includes a PDF text extractor, PDF-to-PostScript converter, and various other utilities. Foolabs Xpdf contains a denial of service vulnerability caused by the t1lib library incorrectly parsing Type 1 fonts. This vulnerability may allow an attacker to execute arbitrary code.",
        "impact": "A remote attacker can cause the device to crash and may be able to execute arbitrary code."
      }
    ],
    "CVE-2011-0766": [
      {
        "url": "http://www.kb.cert.org/vuls/id/178990",
        "title": "Erlang/OTP SSH library uses a weak random number generator",
        "overview": "The Erlang/OTP SSH library's random number generator is not cryptographically strong because it relies on predictable seed material.",
        "description": "Geoff Cant's report states:The Erlang/OTP ssh library implements a number of cryptographic operations that depend on cryptographically strong random numbers. Unfortunately the RNG used by the library is not cryptographically strong, and is further weakened by the use of predictable seed material. The RNG (Wichman-Hill) is not mixed with an entropy source.The seed used for all ssh connections in the library is the current time (to approximately microsecond resolution). By observing the time a connection from this library is established, the first two components of the three RNG seed can be guessed.The third component can be recovered by brute-force; trying each possible value (1..1000000).Guessing the exact seed is made easier by the 16 byte random session cookie that the library will send in its plaintext kexinit message. This cookie will be bytes 17-32 of the RNG sequence.Once the session RNG seed is recovered, an attacker can simply perform the same DH key exchange operation as the SSH library and recover the session secret. Additionally, if the ssh library is used on the server side of the connection and DSA host key is used, the private key can be recovered from the kex_dh messages. The secret signing value k is known from the RNG seed (bytes 170 - 190 of the sequence), so with the public DSA key data in the kex_dh_reply message the private part can be recovered by inverting the signature operation.",
        "impact": "An attacker can recover SSH session keys and DSA host keys."
      }
    ],
    "CVE-2011-0767": [
      {
        "url": "http://www.kb.cert.org/vuls/id/567774",
        "title": "Imperva SecureSphere management GUI contains an XSS vulnerability",
        "overview": "An XSS vulnerability exists in the Imperva SecureSphere management GUI.",
        "description": "Dell SecureWorks' SWRX-2011-001 advisory states:\"A vulnerability exists in Imperva SecureSphere due to improper validation of user-controlled input. User-controllable input is not properly sanitized for illegal or malicious content prior to being stored and later returned to an administrator in dynamically generated web content. Remote attackers could leverage this issue to conduct persistent cross-site scripting attacks. When the malicious content is viewed, arbitrary script or HTML code injected into the affected database field will be executed in the SecureSphere administrative user’s browser session in the security context of the SecureSphere administrative GUI. Successful exploitation may aid an attacker in retrieving session cookies, stealing recently submitted data, or launching further attacks.\"Additional details can be found in Imperva's advisory, Imperva Security Response for CVE-2011-0767.",
        "impact": "An attacker may be able to execute arbitrary script in the security context of the user's browser session accessing the management GUI."
      }
    ],
    "CVE-2011-0770": [
      {
        "url": "http://www.kb.cert.org/vuls/id/122054",
        "title": "HP ArcSight Connector Appliance XSS vulnerability",
        "overview": "ArcSight Connector Appliance v6.0.0.60023.2, and possibly previous versions, contains a module which is vulnerable to cross site scripting (XSS).",
        "description": "Windows Event Log SmartConnector, a component of ArcSight Connector Appliance v6.0.0.60023.2 does not sanitize all input fields. As a result, cross site scripting (XSS) attacks can be conducted. An exportable report from the Windows Event Log SmartConnector for table parameters contains a drop-down selection field for \"Microsoft OS Version\". In some cases, this exported report is world-writeable with a default name. In the exported file an attacker can inject javascript code that will be run after the file is imported and the table parameters section is accessed for editing again.For example, the following javascript code can be injected into the \"Windows XP\" variable of the exported file:...,\"Windows XP<script> alert('XSS')</script>\",\"en_US\"",
        "impact": "An attacker with access to the ArcSight Connector Appliance can conduct a cross site scripting attack, which could be used to result in information leakage, privilege escalation, and/or denial of service."
      }
    ],
    "CVE-2011-0997": [
      {
        "url": "http://www.kb.cert.org/vuls/id/107886",
        "title": "ISC dhclient vulnerability",
        "overview": "The ISC dhclient contains a vulnerability that could allow a remote attacker to execute arbitrary code on the client machine.",
        "description": "According to ISC:ISC dhclient did not strip or escape certain shell meta-characters in responses from the dhcp server (like hostname) before passing the responses on to dhclient-script. Depending on the script and OS, this can result in execution of exploit code on the client.",
        "impact": "An unauthenticated remote attacker could cause the ISC dhclient to execute arbitrary code on the client machine."
      }
    ],
    "CVE-2011-1104": [
      {
        "url": "http://www.kb.cert.org/vuls/id/136612",
        "title": "Mutare Software Enabled VoiceMail (EVM) system web interface cross-site request forgery vulnerabilities",
        "overview": "The Mutare Software Enabled VoiceMail (EVM) system web interface is susceptible to cross-site request forgery and cross-site scripting attacks.",
        "description": "The Mutare Software Enabled VoiceMail (EVM) system web interface allows the user to change their Enabled VoiceMail (EVM) PIN, delete their voice messages, and add or modify their email delivery address for voicemails. These HTTP requests do not perform proper validity checks and are susceptible to cross-site request forgery and cross-site scripting attacks.",
        "impact": "An attacker can change a user's Enabled VoiceMail (EVM) PIN, delete their voice messages, and add or modify their email delivery address for voicemails, if able to trick a user into visiting a specially crafted link."
      }
    ],
    "CVE-2011-1105": [
      {
        "url": "http://www.kb.cert.org/vuls/id/136612",
        "title": "Mutare Software Enabled VoiceMail (EVM) system web interface cross-site request forgery vulnerabilities",
        "overview": "The Mutare Software Enabled VoiceMail (EVM) system web interface is susceptible to cross-site request forgery and cross-site scripting attacks.",
        "description": "The Mutare Software Enabled VoiceMail (EVM) system web interface allows the user to change their Enabled VoiceMail (EVM) PIN, delete their voice messages, and add or modify their email delivery address for voicemails. These HTTP requests do not perform proper validity checks and are susceptible to cross-site request forgery and cross-site scripting attacks.",
        "impact": "An attacker can change a user's Enabled VoiceMail (EVM) PIN, delete their voice messages, and add or modify their email delivery address for voicemails, if able to trick a user into visiting a specially crafted link."
      }
    ],
    "CVE-2011-1138": [
      {
        "url": "http://www.kb.cert.org/vuls/id/215900",
        "title": "Wireshark 6LoWPAN denial of service vulnerability",
        "overview": "Wireshark will crash on 32-bit systems while reading a malformed 6LoWPAN packet.",
        "description": "Paul Makowski's report states:dissect_6lowpan_iphc() in /epan/dissectors/packet-6lowpan.c trusts user supplied data when incrementing 'offset'. It is possible for the user to increment 'offset' to a value greater than tvb->length and/or tvb->reported_length, forcing the dissector to attempt dissection out of bounds. If 'offset' is greater than tvb->length or tvb->reported_length, then tvb_length_remaining() or tvb_reported_length_remaining() will return -1 respectively. If tvb_length_remaining() returns -1, then a buffer is allocated 1 byte too short, leading to a partial overwrite of the heap canary.",
        "impact": "An attacker may trigger a denial of service, causing any active capture or .pcap dissection to crash Wireshark/tshark."
      }
    ],
    "CVE-2011-1139": [
      {
        "url": "http://www.kb.cert.org/vuls/id/215900",
        "title": "Wireshark 6LoWPAN denial of service vulnerability",
        "overview": "Wireshark will crash on 32-bit systems while reading a malformed 6LoWPAN packet.",
        "description": "Paul Makowski's report states:dissect_6lowpan_iphc() in /epan/dissectors/packet-6lowpan.c trusts user supplied data when incrementing 'offset'. It is possible for the user to increment 'offset' to a value greater than tvb->length and/or tvb->reported_length, forcing the dissector to attempt dissection out of bounds. If 'offset' is greater than tvb->length or tvb->reported_length, then tvb_length_remaining() or tvb_reported_length_remaining() will return -1 respectively. If tvb_length_remaining() returns -1, then a buffer is allocated 1 byte too short, leading to a partial overwrite of the heap canary.",
        "impact": "An attacker may trigger a denial of service, causing any active capture or .pcap dissection to crash Wireshark/tshark."
      }
    ],
    "CVE-2011-1140": [
      {
        "url": "http://www.kb.cert.org/vuls/id/215900",
        "title": "Wireshark 6LoWPAN denial of service vulnerability",
        "overview": "Wireshark will crash on 32-bit systems while reading a malformed 6LoWPAN packet.",
        "description": "Paul Makowski's report states:dissect_6lowpan_iphc() in /epan/dissectors/packet-6lowpan.c trusts user supplied data when incrementing 'offset'. It is possible for the user to increment 'offset' to a value greater than tvb->length and/or tvb->reported_length, forcing the dissector to attempt dissection out of bounds. If 'offset' is greater than tvb->length or tvb->reported_length, then tvb_length_remaining() or tvb_reported_length_remaining() will return -1 respectively. If tvb_length_remaining() returns -1, then a buffer is allocated 1 byte too short, leading to a partial overwrite of the heap canary.",
        "impact": "An attacker may trigger a denial of service, causing any active capture or .pcap dissection to crash Wireshark/tshark."
      }
    ],
    "CVE-2011-1141": [
      {
        "url": "http://www.kb.cert.org/vuls/id/215900",
        "title": "Wireshark 6LoWPAN denial of service vulnerability",
        "overview": "Wireshark will crash on 32-bit systems while reading a malformed 6LoWPAN packet.",
        "description": "Paul Makowski's report states:dissect_6lowpan_iphc() in /epan/dissectors/packet-6lowpan.c trusts user supplied data when incrementing 'offset'. It is possible for the user to increment 'offset' to a value greater than tvb->length and/or tvb->reported_length, forcing the dissector to attempt dissection out of bounds. If 'offset' is greater than tvb->length or tvb->reported_length, then tvb_length_remaining() or tvb_reported_length_remaining() will return -1 respectively. If tvb_length_remaining() returns -1, then a buffer is allocated 1 byte too short, leading to a partial overwrite of the heap canary.",
        "impact": "An attacker may trigger a denial of service, causing any active capture or .pcap dissection to crash Wireshark/tshark."
      }
    ],
    "CVE-2011-1430": [
      {
        "url": "http://www.kb.cert.org/vuls/id/MAPG-8DBRD4",
        "title": "STARTTLS plaintext command injection vulnerability",
        "overview": "Some STARTTLS implementations could allow a remote attacker to inject commands during the plaintext phase of the protocol.",
        "description": "STARTTLS is an extension to plaintext communication protocols that offers a way to upgrade a plaintext connection to an encrypted (TLS or SSL) connection instead of using a separate port for encrypted communication. Some implementations of STARTTLS contain a vulnerability that could allow a remote unauthenticated attacker to inject commands during the plaintext protocol phase, that will be executed during the ciphertext protocol phase. This vulnerability is caused by the switch from plaintext to TLS being implemented below the application's I/O buffering layer.This issue is only of practical concern for affected implementations that also perform correct certificate validation. Implementations which do not perform certificate validation are already inherently vulnerable to man-in-the-middle attacks.Note: Not all implementations of STARTTLS are affected by this vulnerability. Some implementations of Simple Authentication and Security Layer (SASL) could also be affected by this vulnerability. Please see the Vendor Information below for specific vendor information.",
        "impact": "A remote attacker with the ability to pose as a man-in-the-middle may be able to inject commands for the corresponding protocol (e.g., SMTP, POP3, etc.) during the plaintext protocol phase, that will then be executed during the ciphertext protocol phase."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/555316",
        "title": "STARTTLS plaintext command injection vulnerability",
        "overview": "Some STARTTLS implementations could allow a remote attacker to inject commands during the plaintext phase of the protocol.",
        "description": "STARTTLS is an extension to plaintext communication protocols that offers a way to upgrade a plaintext connection to an encrypted (TLS or SSL) connection instead of using a separate port for encrypted communication. Some implementations of STARTTLS contain a vulnerability that could allow a remote unauthenticated attacker to inject commands during the plaintext protocol phase, that will be executed during the ciphertext protocol phase. This vulnerability is caused by the switch from plaintext to TLS being implemented below the application's I/O buffering layer.This issue is only of practical concern for affected implementations that also perform correct certificate validation. Implementations which do not perform certificate validation are already inherently vulnerable to man-in-the-middle attacks.Note: Not all implementations of STARTTLS are affected by this vulnerability. Some implementations of Simple Authentication and Security Layer (SASL) could also be affected by this vulnerability. Please see the Vendor Information below for specific vendor information.",
        "impact": "A remote attacker with the ability to pose as a man-in-the-middle may be able to inject commands for the corresponding protocol (e.g., SMTP, POP3, etc.) during the plaintext protocol phase, that will then be executed during the ciphertext protocol phase."
      }
    ],
    "CVE-2011-1498": [
      {
        "url": "http://www.kb.cert.org/vuls/id/153049"
      }
    ],
    "CVE-2011-1506": [
      {
        "url": "http://www.kb.cert.org/vuls/id/MAPG-8D9M4P",
        "title": "STARTTLS plaintext command injection vulnerability",
        "overview": "Some STARTTLS implementations could allow a remote attacker to inject commands during the plaintext phase of the protocol.",
        "description": "STARTTLS is an extension to plaintext communication protocols that offers a way to upgrade a plaintext connection to an encrypted (TLS or SSL) connection instead of using a separate port for encrypted communication. Some implementations of STARTTLS contain a vulnerability that could allow a remote unauthenticated attacker to inject commands during the plaintext protocol phase, that will be executed during the ciphertext protocol phase. This vulnerability is caused by the switch from plaintext to TLS being implemented below the application's I/O buffering layer.This issue is only of practical concern for affected implementations that also perform correct certificate validation. Implementations which do not perform certificate validation are already inherently vulnerable to man-in-the-middle attacks.Note: Not all implementations of STARTTLS are affected by this vulnerability. Some implementations of Simple Authentication and Security Layer (SASL) could also be affected by this vulnerability. Please see the Vendor Information below for specific vendor information.",
        "impact": "A remote attacker with the ability to pose as a man-in-the-middle may be able to inject commands for the corresponding protocol (e.g., SMTP, POP3, etc.) during the plaintext protocol phase, that will then be executed during the ciphertext protocol phase."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/555316",
        "title": "STARTTLS plaintext command injection vulnerability",
        "overview": "Some STARTTLS implementations could allow a remote attacker to inject commands during the plaintext phase of the protocol.",
        "description": "STARTTLS is an extension to plaintext communication protocols that offers a way to upgrade a plaintext connection to an encrypted (TLS or SSL) connection instead of using a separate port for encrypted communication. Some implementations of STARTTLS contain a vulnerability that could allow a remote unauthenticated attacker to inject commands during the plaintext protocol phase, that will be executed during the ciphertext protocol phase. This vulnerability is caused by the switch from plaintext to TLS being implemented below the application's I/O buffering layer.This issue is only of practical concern for affected implementations that also perform correct certificate validation. Implementations which do not perform certificate validation are already inherently vulnerable to man-in-the-middle attacks.Note: Not all implementations of STARTTLS are affected by this vulnerability. Some implementations of Simple Authentication and Security Layer (SASL) could also be affected by this vulnerability. Please see the Vendor Information below for specific vendor information.",
        "impact": "A remote attacker with the ability to pose as a man-in-the-middle may be able to inject commands for the corresponding protocol (e.g., SMTP, POP3, etc.) during the plaintext protocol phase, that will then be executed during the ciphertext protocol phase."
      }
    ],
    "CVE-2011-1527": [
      {
        "url": "http://www.kb.cert.org/vuls/id/659251",
        "title": "Multiple MIT KRB5 KDC daemon vulnerabilities",
        "overview": "MIT's KRB5 KDC version 1.8 and 1.9 contain multiple vulnerabilities.",
        "description": "The MIT krb5 Security Advisory 2011-006 states:CVE-2011-1527: In releases krb5-1.9 and later, the KDC can crash due to a null pointer dereference if configured to use the LDAP back end. A trigger condition is publicly known but not known to be widely circulated.CVE-2011-1528: In releases krb5-1.8 and later, the KDC can crash due to an assertion failure. No exploit is known to exist, but there is public evidence that the unidentified trigger condition occurs in the field.CVE-2011-1529: In releases krb5-1.8 and later, the KDC can crash due to a null pointer dereference. No exploit is known to exist.CVE-2011-4151: In releases krb5-1.8 through krb5-1.8.4, the KDC can crash due to an assertion failure if configured to use the Berkeley DB (\"db2\") back end.",
        "impact": "The MIT krb5 Security Advisory 2011-006 states:CVE-2011-1527: An unauthenticated remote attacker can crash a KDC daemon via null pointer dereference if the KDC is configured to use the LDAP back end. (This is not the default configuration.)CVE-2011-1528: An unauthenticated remote attacker can crash a KDC daemon via assertion failure.CVE-2011-1529: An unauthenticated remote attacker can crash a KDC daemon via null pointer dereference.CVE-2011-4151: An unauthenticated remote attacker can crash a KDC daemon via assertion failure if the KDC is configured to use the Berkeley DB (\"db2\") back end."
      }
    ],
    "CVE-2011-1528": [
      {
        "url": "http://www.kb.cert.org/vuls/id/659251",
        "title": "Multiple MIT KRB5 KDC daemon vulnerabilities",
        "overview": "MIT's KRB5 KDC version 1.8 and 1.9 contain multiple vulnerabilities.",
        "description": "The MIT krb5 Security Advisory 2011-006 states:CVE-2011-1527: In releases krb5-1.9 and later, the KDC can crash due to a null pointer dereference if configured to use the LDAP back end. A trigger condition is publicly known but not known to be widely circulated.CVE-2011-1528: In releases krb5-1.8 and later, the KDC can crash due to an assertion failure. No exploit is known to exist, but there is public evidence that the unidentified trigger condition occurs in the field.CVE-2011-1529: In releases krb5-1.8 and later, the KDC can crash due to a null pointer dereference. No exploit is known to exist.CVE-2011-4151: In releases krb5-1.8 through krb5-1.8.4, the KDC can crash due to an assertion failure if configured to use the Berkeley DB (\"db2\") back end.",
        "impact": "The MIT krb5 Security Advisory 2011-006 states:CVE-2011-1527: An unauthenticated remote attacker can crash a KDC daemon via null pointer dereference if the KDC is configured to use the LDAP back end. (This is not the default configuration.)CVE-2011-1528: An unauthenticated remote attacker can crash a KDC daemon via assertion failure.CVE-2011-1529: An unauthenticated remote attacker can crash a KDC daemon via null pointer dereference.CVE-2011-4151: An unauthenticated remote attacker can crash a KDC daemon via assertion failure if the KDC is configured to use the Berkeley DB (\"db2\") back end."
      }
    ],
    "CVE-2011-1529": [
      {
        "url": "http://www.kb.cert.org/vuls/id/659251",
        "title": "Multiple MIT KRB5 KDC daemon vulnerabilities",
        "overview": "MIT's KRB5 KDC version 1.8 and 1.9 contain multiple vulnerabilities.",
        "description": "The MIT krb5 Security Advisory 2011-006 states:CVE-2011-1527: In releases krb5-1.9 and later, the KDC can crash due to a null pointer dereference if configured to use the LDAP back end. A trigger condition is publicly known but not known to be widely circulated.CVE-2011-1528: In releases krb5-1.8 and later, the KDC can crash due to an assertion failure. No exploit is known to exist, but there is public evidence that the unidentified trigger condition occurs in the field.CVE-2011-1529: In releases krb5-1.8 and later, the KDC can crash due to a null pointer dereference. No exploit is known to exist.CVE-2011-4151: In releases krb5-1.8 through krb5-1.8.4, the KDC can crash due to an assertion failure if configured to use the Berkeley DB (\"db2\") back end.",
        "impact": "The MIT krb5 Security Advisory 2011-006 states:CVE-2011-1527: An unauthenticated remote attacker can crash a KDC daemon via null pointer dereference if the KDC is configured to use the LDAP back end. (This is not the default configuration.)CVE-2011-1528: An unauthenticated remote attacker can crash a KDC daemon via assertion failure.CVE-2011-1529: An unauthenticated remote attacker can crash a KDC daemon via null pointer dereference.CVE-2011-4151: An unauthenticated remote attacker can crash a KDC daemon via assertion failure if the KDC is configured to use the Berkeley DB (\"db2\") back end."
      }
    ],
    "CVE-2011-1547": [
      {
        "url": "http://www.kb.cert.org/vuls/id/668220",
        "title": "IPComp encapsulation nested payload vulnerability",
        "overview": "Some IPComp implementations may contain a kernel memory corruption vulnerability in their handling of nested encapsulation of IPComp payloads.",
        "description": "RFC 3173 defines the IP Payload Compression Protocol (IPComp) as:IP payload compression is a protocol to reduce the size of IP datagrams. This protocol will increase the overall communication performance between a pair of communicating hosts/gateways (\"nodes\") by compressing the datagrams, provided the nodes have sufficient computation power, through either CPU capacity or a compression coprocessor, and the communication is over slow or congested links.IPComp is commonly used in conjunction with IPsec implementations.Some network stack implementations, particularly those incorporating the KAME project or NetBSD project IPComp and IPsec implementations, may fail to check for stack overflow in their recursive handling of nested IPComp-encapsulated payloads. Exploitation of this vulnerability could allow a remote attacker to cause kernel memory corruption.",
        "impact": "A remote attacker can cause a kernel stack overflow leading to a denial of service or possibly execute arbitrary code."
      }
    ],
    "CVE-2011-1552": [
      {
        "url": "http://www.kb.cert.org/vuls/id/376500",
        "title": "Foolabs Xpdf contains a denial of service vulnerability",
        "overview": "Foolabs Xpdf contains a denial of service vulnerability caused by the t1lib library incorrectly parsing Type 1 fonts.",
        "description": "According to Foolabs: Xpdf is an open source viewer for Portable Document Format (PDF) files. (These are sometimes also called 'Acrobat' files, from the name of Adobe's PDF software.) The Xpdf project also includes a PDF text extractor, PDF-to-PostScript converter, and various other utilities. Foolabs Xpdf contains a denial of service vulnerability caused by the t1lib library incorrectly parsing Type 1 fonts. This vulnerability may allow an attacker to execute arbitrary code.",
        "impact": "A remote attacker can cause the device to crash and may be able to execute arbitrary code."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/MAPG-8ECL8X",
        "title": "Foolabs Xpdf contains a denial of service vulnerability",
        "overview": "Foolabs Xpdf contains a denial of service vulnerability caused by the t1lib library incorrectly parsing Type 1 fonts.",
        "description": "According to Foolabs: Xpdf is an open source viewer for Portable Document Format (PDF) files. (These are sometimes also called 'Acrobat' files, from the name of Adobe's PDF software.) The Xpdf project also includes a PDF text extractor, PDF-to-PostScript converter, and various other utilities. Foolabs Xpdf contains a denial of service vulnerability caused by the t1lib library incorrectly parsing Type 1 fonts. This vulnerability may allow an attacker to execute arbitrary code.",
        "impact": "A remote attacker can cause the device to crash and may be able to execute arbitrary code."
      }
    ],
    "CVE-2011-1553": [
      {
        "url": "http://www.kb.cert.org/vuls/id/376500",
        "title": "Foolabs Xpdf contains a denial of service vulnerability",
        "overview": "Foolabs Xpdf contains a denial of service vulnerability caused by the t1lib library incorrectly parsing Type 1 fonts.",
        "description": "According to Foolabs: Xpdf is an open source viewer for Portable Document Format (PDF) files. (These are sometimes also called 'Acrobat' files, from the name of Adobe's PDF software.) The Xpdf project also includes a PDF text extractor, PDF-to-PostScript converter, and various other utilities. Foolabs Xpdf contains a denial of service vulnerability caused by the t1lib library incorrectly parsing Type 1 fonts. This vulnerability may allow an attacker to execute arbitrary code.",
        "impact": "A remote attacker can cause the device to crash and may be able to execute arbitrary code."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/MAPG-8ECL8X",
        "title": "Foolabs Xpdf contains a denial of service vulnerability",
        "overview": "Foolabs Xpdf contains a denial of service vulnerability caused by the t1lib library incorrectly parsing Type 1 fonts.",
        "description": "According to Foolabs: Xpdf is an open source viewer for Portable Document Format (PDF) files. (These are sometimes also called 'Acrobat' files, from the name of Adobe's PDF software.) The Xpdf project also includes a PDF text extractor, PDF-to-PostScript converter, and various other utilities. Foolabs Xpdf contains a denial of service vulnerability caused by the t1lib library incorrectly parsing Type 1 fonts. This vulnerability may allow an attacker to execute arbitrary code.",
        "impact": "A remote attacker can cause the device to crash and may be able to execute arbitrary code."
      }
    ],
    "CVE-2011-1554": [
      {
        "url": "http://www.kb.cert.org/vuls/id/376500",
        "title": "Foolabs Xpdf contains a denial of service vulnerability",
        "overview": "Foolabs Xpdf contains a denial of service vulnerability caused by the t1lib library incorrectly parsing Type 1 fonts.",
        "description": "According to Foolabs: Xpdf is an open source viewer for Portable Document Format (PDF) files. (These are sometimes also called 'Acrobat' files, from the name of Adobe's PDF software.) The Xpdf project also includes a PDF text extractor, PDF-to-PostScript converter, and various other utilities. Foolabs Xpdf contains a denial of service vulnerability caused by the t1lib library incorrectly parsing Type 1 fonts. This vulnerability may allow an attacker to execute arbitrary code.",
        "impact": "A remote attacker can cause the device to crash and may be able to execute arbitrary code."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/MAPG-8ECL8X",
        "title": "Foolabs Xpdf contains a denial of service vulnerability",
        "overview": "Foolabs Xpdf contains a denial of service vulnerability caused by the t1lib library incorrectly parsing Type 1 fonts.",
        "description": "According to Foolabs: Xpdf is an open source viewer for Portable Document Format (PDF) files. (These are sometimes also called 'Acrobat' files, from the name of Adobe's PDF software.) The Xpdf project also includes a PDF text extractor, PDF-to-PostScript converter, and various other utilities. Foolabs Xpdf contains a denial of service vulnerability caused by the t1lib library incorrectly parsing Type 1 fonts. This vulnerability may allow an attacker to execute arbitrary code.",
        "impact": "A remote attacker can cause the device to crash and may be able to execute arbitrary code."
      }
    ],
    "CVE-2011-1591": [
      {
        "url": "http://www.kb.cert.org/vuls/id/243670",
        "title": "Wireshark DECT dissector vulnerability",
        "overview": "Wireshark's DECT dissector contains a remote code execution vulnerability in the context of the user running a packet capture or reading a packet capture file.",
        "description": "Paul Makowski's report states:/epan/dissectors/packet-dect.c contains a stack-based buffer overflow via a call to memcpy() whose length is controlled by the attacker. Absent exploit mitigations independant of Wireshark's default build options, an attacker is able to execute arbitrary code in the context of the user running a packet capture. On *NIX systems, such capability is frequently reserved for the root user. The overflowable buffer is pkt_bfield.Data.",
        "impact": "An attacker may cause any active capture or .pcap dissection to crash Wireshark/tshark. Remote code execution is also possible."
      }
    ],
    "CVE-2011-1672": [
      {
        "url": "http://www.kb.cert.org/vuls/id/598700",
        "title": "Dell Kace K2000 Appliance unauthenticated access and information disclosure vulnerability",
        "overview": "Dell KACE K2000 Systems Deployment Appliance contains a hidden CIFS share that allows anonymous access.",
        "description": "According to Dell KACE's knowledge base article: \"The Dell KACE K2000 Systems Deployment Appliance version 3.3.36822 and earlier uses a read-only CIFS fileshare named \"peinst\" to facilitate Windows deployments. This hidden, read-only fileshare is populated with pre- and post-installation tasks as well as deployment bootfiles and media used for Windows network operating system installs (called \"Scripted Installs\") and imaging (called \"K-images\"). This fileshare is hidden. It provides anonymous read-only access because of limitations with Windows PE 2005 and earlier in accessing a password-protected share as a root drive.\"",
        "impact": "A remote unauthenticated attacker may be able to retrieve the device's administrator password and device system information."
      }
    ],
    "CVE-2011-1673": [
      {
        "url": "http://www.kb.cert.org/vuls/id/644812",
        "title": "NetGear WNAP210 remote password disclosure and password bypass vulnerability",
        "overview": "NetGear WNAP210 is vulnerable to remote administrator password disclosure and administrative web page login bypass.",
        "description": "Netgear's ProSafe Wireless-N Access Point WNAP210 contains a vulnerability which may allow a remote unauthenticated attacker to recover the device's administrator password. An attacker with network access to the device can navigate to the web page http://NetGearDeviceIP/BackupConfig.php. The attacker will be prompted to download the device's configuration without entering any login credentials. This configuration file will contain the device's administrator password stored in plaintext. A second vulnerability found in Netgear's ProSafe Wireless-N Access Point WNAP210 allows a remote unauthenticated attacker to bypass the device's login web page allowing the attacker to directly access the device's configuration web page. An attacker with network access to the device can navigate to the web page http://NetGearDeviceIP/recreate.php. The web page will display \"recreateok\". Next the attacker would navigate to the web page http://NetGearDeviceIP/index.php, permitting them direct access to the device's configuration web page without entering any login credentials.This vulnerability has been reported in Netgear's ProSafe Wireless-N Access Point WNAP210 firmware version 2.0.12.",
        "impact": "A remote unauthenticated attacker may be able to retrieve the device's administrator password, and bypass the device's login web page allowing them to directly access the device's configuration web page."
      }
    ],
    "CVE-2011-1674": [
      {
        "url": "http://www.kb.cert.org/vuls/id/644812",
        "title": "NetGear WNAP210 remote password disclosure and password bypass vulnerability",
        "overview": "NetGear WNAP210 is vulnerable to remote administrator password disclosure and administrative web page login bypass.",
        "description": "Netgear's ProSafe Wireless-N Access Point WNAP210 contains a vulnerability which may allow a remote unauthenticated attacker to recover the device's administrator password. An attacker with network access to the device can navigate to the web page http://NetGearDeviceIP/BackupConfig.php. The attacker will be prompted to download the device's configuration without entering any login credentials. This configuration file will contain the device's administrator password stored in plaintext. A second vulnerability found in Netgear's ProSafe Wireless-N Access Point WNAP210 allows a remote unauthenticated attacker to bypass the device's login web page allowing the attacker to directly access the device's configuration web page. An attacker with network access to the device can navigate to the web page http://NetGearDeviceIP/recreate.php. The web page will display \"recreateok\". Next the attacker would navigate to the web page http://NetGearDeviceIP/index.php, permitting them direct access to the device's configuration web page without entering any login credentials.This vulnerability has been reported in Netgear's ProSafe Wireless-N Access Point WNAP210 firmware version 2.0.12.",
        "impact": "A remote unauthenticated attacker may be able to retrieve the device's administrator password, and bypass the device's login web page allowing them to directly access the device's configuration web page."
      }
    ],
    "CVE-2011-1720": [
      {
        "url": "http://www.kb.cert.org/vuls/id/727230",
        "title": "Postfix SMTP server Cyrus SASL support contains a memory corruption vulnerability",
        "overview": "The Postfix SMTP server has a memory corruption error when the Cyrus SASL library is used with authentication mechanisms other than PLAIN and LOGIN.",
        "description": "The Postfix Advisory for CVE-2011-1720 states:\"The Postfix SMTP server fails to create a new Cyrus SASL server handle after authentication failure. This causes memory corruption when, for example, a client requests CRAM-MD5 authentication, fails to authenticate, and then invokes some other authentication mechanism except PLAIN (or ANONYMOUS if available). The likely outcome is that the Postfix SMTP server process crashes with a segmentation violation error (SIGSEGV, a.k.a. signal 11).\"...\"The memory corruption is known to result in a program crash (SIGSEV). Remote code execution cannot be excluded. Such code would execute as the unprivileged \"postfix\" user. This user has no control over processes that run with non-postfix privileges including Postfix processes running as root; the impact may be reduced with configurations that enable the Postfix chroot feature or that use platform-dependent privilege-reducing features.\"",
        "impact": "A remote attacker can cause a denial of service or possibly execute arbitrary code."
      }
    ],
    "CVE-2011-1824": [
      {
        "url": "http://www.kb.cert.org/vuls/id/778396"
      }
    ],
    "CVE-2011-1901": [
      {
        "url": "http://www.kb.cert.org/vuls/id/790980",
        "title": "Proofpoint Protection Server contains multiple vulnerabilities",
        "overview": "Proofpoint Protection Server contains multiple vulnerabilities including authentication bypass, insufficient authorization checks, command injection, SQL injection, and directory traversal.",
        "description": "Clear Skies Security's advisory states:\"Enduser Authentication BypassUser-level access to the Proofpoint mail filter web interface can be obtained as any available user without providing the user’s login credentials.Path Traversal Allows Access to System FilesArbitrary files on the Proofpoint appliance can be obtained by manipulating a flaw in the web interface.Proofpoint SQL InjectionA publicly accessible function in the Proofpoint interface is vulnerable to SQL Injection.Proofpoint Command InjectionA function in the Proofpoint web interface can be manipulated into executing any command on the server.Proofpoint Forced Browsing / Insufficient Page AuthorizationSome administrative modules are accessible without authenticating with the application.\"",
        "impact": "An attacker may be able to bypass authentication to the web interface, run system commands, or download arbitrary files."
      }
    ],
    "CVE-2011-1902": [
      {
        "url": "http://www.kb.cert.org/vuls/id/790980",
        "title": "Proofpoint Protection Server contains multiple vulnerabilities",
        "overview": "Proofpoint Protection Server contains multiple vulnerabilities including authentication bypass, insufficient authorization checks, command injection, SQL injection, and directory traversal.",
        "description": "Clear Skies Security's advisory states:\"Enduser Authentication BypassUser-level access to the Proofpoint mail filter web interface can be obtained as any available user without providing the user’s login credentials.Path Traversal Allows Access to System FilesArbitrary files on the Proofpoint appliance can be obtained by manipulating a flaw in the web interface.Proofpoint SQL InjectionA publicly accessible function in the Proofpoint interface is vulnerable to SQL Injection.Proofpoint Command InjectionA function in the Proofpoint web interface can be manipulated into executing any command on the server.Proofpoint Forced Browsing / Insufficient Page AuthorizationSome administrative modules are accessible without authenticating with the application.\"",
        "impact": "An attacker may be able to bypass authentication to the web interface, run system commands, or download arbitrary files."
      }
    ],
    "CVE-2011-1903": [
      {
        "url": "http://www.kb.cert.org/vuls/id/790980",
        "title": "Proofpoint Protection Server contains multiple vulnerabilities",
        "overview": "Proofpoint Protection Server contains multiple vulnerabilities including authentication bypass, insufficient authorization checks, command injection, SQL injection, and directory traversal.",
        "description": "Clear Skies Security's advisory states:\"Enduser Authentication BypassUser-level access to the Proofpoint mail filter web interface can be obtained as any available user without providing the user’s login credentials.Path Traversal Allows Access to System FilesArbitrary files on the Proofpoint appliance can be obtained by manipulating a flaw in the web interface.Proofpoint SQL InjectionA publicly accessible function in the Proofpoint interface is vulnerable to SQL Injection.Proofpoint Command InjectionA function in the Proofpoint web interface can be manipulated into executing any command on the server.Proofpoint Forced Browsing / Insufficient Page AuthorizationSome administrative modules are accessible without authenticating with the application.\"",
        "impact": "An attacker may be able to bypass authentication to the web interface, run system commands, or download arbitrary files."
      }
    ],
    "CVE-2011-1904": [
      {
        "url": "http://www.kb.cert.org/vuls/id/790980",
        "title": "Proofpoint Protection Server contains multiple vulnerabilities",
        "overview": "Proofpoint Protection Server contains multiple vulnerabilities including authentication bypass, insufficient authorization checks, command injection, SQL injection, and directory traversal.",
        "description": "Clear Skies Security's advisory states:\"Enduser Authentication BypassUser-level access to the Proofpoint mail filter web interface can be obtained as any available user without providing the user’s login credentials.Path Traversal Allows Access to System FilesArbitrary files on the Proofpoint appliance can be obtained by manipulating a flaw in the web interface.Proofpoint SQL InjectionA publicly accessible function in the Proofpoint interface is vulnerable to SQL Injection.Proofpoint Command InjectionA function in the Proofpoint web interface can be manipulated into executing any command on the server.Proofpoint Forced Browsing / Insufficient Page AuthorizationSome administrative modules are accessible without authenticating with the application.\"",
        "impact": "An attacker may be able to bypass authentication to the web interface, run system commands, or download arbitrary files."
      }
    ],
    "CVE-2011-1905": [
      {
        "url": "http://www.kb.cert.org/vuls/id/790980",
        "title": "Proofpoint Protection Server contains multiple vulnerabilities",
        "overview": "Proofpoint Protection Server contains multiple vulnerabilities including authentication bypass, insufficient authorization checks, command injection, SQL injection, and directory traversal.",
        "description": "Clear Skies Security's advisory states:\"Enduser Authentication BypassUser-level access to the Proofpoint mail filter web interface can be obtained as any available user without providing the user’s login credentials.Path Traversal Allows Access to System FilesArbitrary files on the Proofpoint appliance can be obtained by manipulating a flaw in the web interface.Proofpoint SQL InjectionA publicly accessible function in the Proofpoint interface is vulnerable to SQL Injection.Proofpoint Command InjectionA function in the Proofpoint web interface can be manipulated into executing any command on the server.Proofpoint Forced Browsing / Insufficient Page AuthorizationSome administrative modules are accessible without authenticating with the application.\"",
        "impact": "An attacker may be able to bypass authentication to the web interface, run system commands, or download arbitrary files."
      }
    ],
    "CVE-2011-1910": [
      {
        "url": "http://www.kb.cert.org/vuls/id/795694",
        "title": "ISC BIND named negative caching vulnerability",
        "overview": "ISC BIND contains a vulnerability in the processing of large RRSIG RRsets included in a negative cache response.",
        "description": "According to ISC:DNS systems use negative caching to improve DNS response time. This will keep a DNS resolver from repeatedly looking up domains that do not exist. Any NXDOMAIN or NODATA/NOERROR response will be put into the negative cache.The authority data will be cached along with the negative cache information. These authoritative “Start of Authority” (SOA) and NSEC/NSEC3 records prove the nonexistence of the requested name/type. In DNSSEC, all of these records are signed; this adds one additional RRSIG record, per DNSSEC key, for each record returned in the authority section of the response.In this vulnerability, very large RRSIG RRsets included in a negative response can trigger an assertion failure that will crash named (BIND 9 DNS) due to an off-by-one error in a buffer size check.The nature of this vulnerability would allow remote exploit. An attacker can set up a DNSSEC signed authoritative DNS server with large RRSIG RRsets to act as the trigger. The attacker would then find ways to query an organization’s caching resolvers for non-existent names in the domain served by the bad server, getting a response that would “trigger” the vulnerability. The attacker would require access to an organization’s caching resolvers; access to the resolvers can be direct (open resolvers), through malware (using a BOTNET to query negative caches), or through driving DNS resolution (a SPAM run that has a domain in the E-mail that will cause the client to perform a lookup).",
        "impact": "A remote, unauthenticated attacker can cause the named daemon to crash creating a denial of service condition."
      }
    ],
    "CVE-2011-1911": [
      {
        "url": "http://www.kb.cert.org/vuls/id/519588",
        "title": "JasperServer cross-site request forgery vulnerability",
        "overview": "JasperSoft's JasperServer is vulnerable to a cross-site request forgery (CSRF) vulnerability.",
        "description": "According to JasperSoft's website: \"JasperReports Server is a powerful, yet flexible and lightweight reporting server. Generate, organize, secure, and deliver interactive reports and dashboards to users. Allow non-technical users to build their own reports and dashboards.\" The JasperSoft's JasperServer fails to adequately randomize certain parameters within the application creating cross-site request forgery (CSRF) vulnerabilities. According to the vulnerability reporter \"One of the parameters (_flowExecutionKey)is predictable and can be determined with a very high probability of success in bruteforce attacks with less than 100 requests\".This vulnerability has been reported to affect JasperServer 3.7.0 Community Edition and JasperServer 3.7.1 Community Edition. Other versions may be affected.",
        "impact": "By convincing a victim to load a specially crafted URL while authenticated to a JasperServer, an attacker could obtain user credentials or perform certain actions as that user. Exploiting the CSRF vulnerabilities could allow an attacker to take certain actions via the web interface, including adding users to the JasperServer."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/MAPG-8ELLJC",
        "title": "JasperServer cross-site request forgery vulnerability",
        "overview": "JasperSoft's JasperServer is vulnerable to a cross-site request forgery (CSRF) vulnerability.",
        "description": "According to JasperSoft's website: \"JasperReports Server is a powerful, yet flexible and lightweight reporting server. Generate, organize, secure, and deliver interactive reports and dashboards to users. Allow non-technical users to build their own reports and dashboards.\" The JasperSoft's JasperServer fails to adequately randomize certain parameters within the application creating cross-site request forgery (CSRF) vulnerabilities. According to the vulnerability reporter \"One of the parameters (_flowExecutionKey)is predictable and can be determined with a very high probability of success in bruteforce attacks with less than 100 requests\".This vulnerability has been reported to affect JasperServer 3.7.0 Community Edition and JasperServer 3.7.1 Community Edition. Other versions may be affected.",
        "impact": "By convincing a victim to load a specially crafted URL while authenticated to a JasperServer, an attacker could obtain user credentials or perform certain actions as that user. Exploiting the CSRF vulnerabilities could allow an attacker to take certain actions via the web interface, including adding users to the JasperServer."
      }
    ],
    "CVE-2011-1913": [
      {
        "url": "http://www.kb.cert.org/vuls/id/122142",
        "title": "Mercator SENTINEL SQL injection allows authentication bypass",
        "overview": "Mercator SENTINEL contains an SQL injection vulnerability that could allow an attacker to bypass authentication and access the system with administrative privileges.",
        "description": "Mercator SENTINEL is a flight safety management system. The login form of the web interface contains an SQL injection vulnerability. Please see CERT-NPS:2011:005 for more information.",
        "impact": "An attacker with network access to the SENTINEL web interface could access the system with administrative privileges."
      }
    ],
    "CVE-2011-1915": [
      {
        "url": "http://www.kb.cert.org/vuls/id/402731",
        "title": "Enspire eClient SQL injection allows authentication bypass",
        "overview": "Enspire eClient contains a SQL injection vulnerability that could allow an attacker to bypass authentication and access the system with administrative privileges.",
        "description": "The Enspire software suite includes an eClient web front-end which is susceptible to SQL injection attacks. This can be used to perform an authentication bypass or interact with the back-end database. Depending on the configuration this can lead to the compromise of the underlying host itself. Enspire version 7.3.2.7 and eClient version 7.3.2.3 are reported to be affected. Other versions may also be affected.",
        "impact": "An attacker with network access to the Enspire eClient web interface could access the system with administrative privileges and potentially compromise the underlying host."
      }
    ],
    "CVE-2011-1922": [
      {
        "url": "http://www.kb.cert.org/vuls/id/531342",
        "title": "Unbound DNS resolver denial of service vulnerability",
        "overview": "A specially crafted DNS query may cause Unbound to respond with an empty UDP packet which triggers an assertion failure and stops the daemon.",
        "description": "NLnetLabs advisory states:\"Certain types of DNS queries may cause Unbound to respond with a DNS error message. The code generating this error message contains an error whereby Unbound constructs an empty UDP message. That empty UDP message triggers an assertion failsafe in the part of Unbound that is invoked when the interface-automatic option is set. In the case that the interface-automatic option was not set or assertion failsafe is not configured the empty packets would be sent, which is not harmful. The error can only be triggered when Unbound is configured with assertions (--enable-checking or --enable-debug) and has the option interface-automatic turned on.Versions in which this error occurs: Unbound 1.0 up to and including Unbound 1.4.9FreeBSD ports for Unbound are not susceptible by default, as it does not enable assertions.RHEL/Fedora systems do compile Unbound with --enable-checking but do not set automatic-interface:yes per default.Debian/Ubuntu Unbound packages do not compile with assertions by default.\"",
        "impact": "A remote, unauthenticated attacker can cause the Unbound daemon to crash creating a denial of service condition."
      }
    ],
    "CVE-2011-1926": [
      {
        "url": "http://www.kb.cert.org/vuls/id/555316",
        "title": "STARTTLS plaintext command injection vulnerability",
        "overview": "Some STARTTLS implementations could allow a remote attacker to inject commands during the plaintext phase of the protocol.",
        "description": "STARTTLS is an extension to plaintext communication protocols that offers a way to upgrade a plaintext connection to an encrypted (TLS or SSL) connection instead of using a separate port for encrypted communication. Some implementations of STARTTLS contain a vulnerability that could allow a remote unauthenticated attacker to inject commands during the plaintext protocol phase, that will be executed during the ciphertext protocol phase. This vulnerability is caused by the switch from plaintext to TLS being implemented below the application's I/O buffering layer.This issue is only of practical concern for affected implementations that also perform correct certificate validation. Implementations which do not perform certificate validation are already inherently vulnerable to man-in-the-middle attacks.Note: Not all implementations of STARTTLS are affected by this vulnerability. Some implementations of Simple Authentication and Security Layer (SASL) could also be affected by this vulnerability. Please see the Vendor Information below for specific vendor information.",
        "impact": "A remote attacker with the ability to pose as a man-in-the-middle may be able to inject commands for the corresponding protocol (e.g., SMTP, POP3, etc.) during the plaintext protocol phase, that will then be executed during the ciphertext protocol phase."
      }
    ],
    "CVE-2011-1945": [
      {
        "url": "http://www.kb.cert.org/vuls/id/MAPG-8FENZ3",
        "title": "OpenSSL leaks ECDSA private key through a remote timing attack",
        "overview": "The OpenSSL ladder implementation for scalar multiplication of points on elliptic curves over binary fields is susceptible to a timing attack vulnerability. This vulnerability can be used to steal the private key of a TLS server that authenticates with ECDSA signatures and binary curves.",
        "description": "Billy Bob Brumley's and Nicola Tuveri's paper \"Remote Timing Attacks are Still Practical\" states: \"For over two decades, timing attacks have been an active area of research within applied cryptography. These attacks exploit cryptosystem or protocol implementations that do not run in constant time. When implementing an elliptic curve cryptosystem that provides side-channel resistance, the scalar multiplication routine is a critical component. In such instances, one attractive method often suggested in the literature is Montgomery’s ladder that performs a fixed sequence of curve and field operations. This paper describes a timing attack vulnerability in OpenSSL's ladder implementation for curves over binary fields. We use this vulnerability to steal the private key of a TLS server where the server authenticates with ECDSA signatures. Using the timing of the exchanged messages, the messages themselves, and the signatures, we mount a lattice attack that recovers the private key.\"",
        "impact": "A remote attacker can retrieve the private key of a TLS server that authenticates with ECDSA signatures and binary curves."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/536044",
        "title": "OpenSSL leaks ECDSA private key through a remote timing attack",
        "overview": "The OpenSSL ladder implementation for scalar multiplication of points on elliptic curves over binary fields is susceptible to a timing attack vulnerability. This vulnerability can be used to steal the private key of a TLS server that authenticates with ECDSA signatures and binary curves.",
        "description": "Billy Bob Brumley's and Nicola Tuveri's paper \"Remote Timing Attacks are Still Practical\" states: \"For over two decades, timing attacks have been an active area of research within applied cryptography. These attacks exploit cryptosystem or protocol implementations that do not run in constant time. When implementing an elliptic curve cryptosystem that provides side-channel resistance, the scalar multiplication routine is a critical component. In such instances, one attractive method often suggested in the literature is Montgomery’s ladder that performs a fixed sequence of curve and field operations. This paper describes a timing attack vulnerability in OpenSSL's ladder implementation for curves over binary fields. We use this vulnerability to steal the private key of a TLS server where the server authenticates with ECDSA signatures. Using the timing of the exchanged messages, the messages themselves, and the signatures, we mount a lattice attack that recovers the private key.\"",
        "impact": "A remote attacker can retrieve the private key of a TLS server that authenticates with ECDSA signatures and binary curves."
      }
    ],
    "CVE-2011-1982": [
      {
        "url": "http://www.kb.cert.org/vuls/id/909022",
        "title": "Microsoft Office uninitialized object pointer vulnerability",
        "overview": "Microsoft Office fails to properly handle certain Word documents, which may allow a remote, unauthenticated attacker to execute arbitrary code.",
        "description": "Code in the MSO.dll component of Microsoft Office 2003, 2007, and 2010 fails to properly initialize an object pointer when loading binary (Word 97-2003 format) Word documents.",
        "impact": "By convincing a user to open a specially crafted Office document, an attacker may be able to execute arbitrary code."
      }
    ],
    "CVE-2011-2004": [
      {
        "url": "http://www.kb.cert.org/vuls/id/675073",
        "title": "Microsoft Windows TrueType font array indexing vulnerability",
        "overview": "A vulnerability in the Microsoft Windows TrueType font parsing component could allow an attacker to cause a denial-of-service condition in Microsoft Windows.",
        "description": "The Microsoft Windows kernel includes a driver (win32k.sys) that handles a variety of graphics processing tasks, including the processing of TrueType fonts. A vulnerability exists in the way this driver validates array indexes. This can cause Windows to crash with a \"blue screen.\"",
        "impact": "By convincing a user to open a specially-crafted TrueType font file, a remote, unauthenticated attacker could cause a denial-of-service condition."
      }
    ],
    "CVE-2011-2039": [
      {
        "url": "http://www.kb.cert.org/vuls/id/490097",
        "title": "Cisco AnyConnect SSL VPN arbitrary code execution",
        "overview": "The Cisco AnyConnect SSL VPN ActiveX and Java clients contain a vulnerability that can allow a remote, unauthenticated attacker to execute arbitrary code on a vulnerable system.",
        "description": "Cisco AnyConnect is an SSL VPN solution that is commonly initiated through use of a web browser. When Internet Explorer is used, the AnyConnect VPN server provides an ActiveX control that downloads and installs the AnyConnect client software. When any other browser is used, the AnyConnect VPN server provides a signed Java applet to perform that same functionality. Both the ActiveX and Java versions of the AnyConnect VPN web control fail to validate the origin of the downloaded vpndownloader.exe file before executing it.",
        "impact": "By convincing a user to view a specially crafted HTML document (e.g., a web page or an HTML email message or attachment), an attacker may be able to execute arbitrary code."
      }
    ],
    "CVE-2011-2040": [
      {
        "url": "http://www.kb.cert.org/vuls/id/490097",
        "title": "Cisco AnyConnect SSL VPN arbitrary code execution",
        "overview": "The Cisco AnyConnect SSL VPN ActiveX and Java clients contain a vulnerability that can allow a remote, unauthenticated attacker to execute arbitrary code on a vulnerable system.",
        "description": "Cisco AnyConnect is an SSL VPN solution that is commonly initiated through use of a web browser. When Internet Explorer is used, the AnyConnect VPN server provides an ActiveX control that downloads and installs the AnyConnect client software. When any other browser is used, the AnyConnect VPN server provides a signed Java applet to perform that same functionality. Both the ActiveX and Java versions of the AnyConnect VPN web control fail to validate the origin of the downloaded vpndownloader.exe file before executing it.",
        "impact": "By convincing a user to view a specially crafted HTML document (e.g., a web page or an HTML email message or attachment), an attacker may be able to execute arbitrary code."
      }
    ],
    "CVE-2011-2105": [
      {
        "url": "http://www.kb.cert.org/vuls/id/264729",
        "title": "Adobe Reader and Acrobat font memory corruption vulnerability",
        "overview": "Adobe Reader and Acrobat fail to properly handle font data, which could allow a remote, unauthenticated attacker to execute arbitrary code on a vulnerable system.",
        "description": "A critical vulnerability exists in the font parsing code in Adobe Reader and Acrobat. The vulnerability results in memory corruption, which could allow for the execution of arbitrary code.",
        "impact": "An attacker may use a specifically crafted PDF document to cause a crash or execute arbitrary code."
      }
    ],
    "CVE-2011-2148": [
      {
        "url": "http://www.kb.cert.org/vuls/id/240150",
        "title": "SmarterTools default basic web server vulnerabilities",
        "overview": "Multiple SmarterTools applications install a default basic web server which contains multiple vulnerabilities",
        "description": "Multiple SmarterTools applications by default install a basic web server which allows administrators to start using the application immediately after installation. This basic web server is vulnerable to multiple vulnerabilites. According to the vulnerability reporter this basic web server is vulnerable to XML injection, operating system command execution, LDAP injection, directory path traversal, and denial of service.",
        "impact": "An attacker with network access to the SmarterTools application basic web server may be able to run system commands, inject arbitrary data, or download arbitrary files."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/MORO-8GYQR4",
        "title": "SmarterTools default basic web server vulnerabilities",
        "overview": "Multiple SmarterTools applications install a default basic web server which contains multiple vulnerabilities",
        "description": "Multiple SmarterTools applications by default install a basic web server which allows administrators to start using the application immediately after installation. This basic web server is vulnerable to multiple vulnerabilites. According to the vulnerability reporter this basic web server is vulnerable to XML injection, operating system command execution, LDAP injection, directory path traversal, and denial of service.",
        "impact": "An attacker with network access to the SmarterTools application basic web server may be able to run system commands, inject arbitrary data, or download arbitrary files."
      }
    ],
    "CVE-2011-2149": [
      {
        "url": "http://www.kb.cert.org/vuls/id/240150",
        "title": "SmarterTools default basic web server vulnerabilities",
        "overview": "Multiple SmarterTools applications install a default basic web server which contains multiple vulnerabilities",
        "description": "Multiple SmarterTools applications by default install a basic web server which allows administrators to start using the application immediately after installation. This basic web server is vulnerable to multiple vulnerabilites. According to the vulnerability reporter this basic web server is vulnerable to XML injection, operating system command execution, LDAP injection, directory path traversal, and denial of service.",
        "impact": "An attacker with network access to the SmarterTools application basic web server may be able to run system commands, inject arbitrary data, or download arbitrary files."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/MORO-8GYQR4",
        "title": "SmarterTools default basic web server vulnerabilities",
        "overview": "Multiple SmarterTools applications install a default basic web server which contains multiple vulnerabilities",
        "description": "Multiple SmarterTools applications by default install a basic web server which allows administrators to start using the application immediately after installation. This basic web server is vulnerable to multiple vulnerabilites. According to the vulnerability reporter this basic web server is vulnerable to XML injection, operating system command execution, LDAP injection, directory path traversal, and denial of service.",
        "impact": "An attacker with network access to the SmarterTools application basic web server may be able to run system commands, inject arbitrary data, or download arbitrary files."
      }
    ],
    "CVE-2011-2150": [
      {
        "url": "http://www.kb.cert.org/vuls/id/MORO-8GYQR4",
        "title": "SmarterTools default basic web server vulnerabilities",
        "overview": "Multiple SmarterTools applications install a default basic web server which contains multiple vulnerabilities",
        "description": "Multiple SmarterTools applications by default install a basic web server which allows administrators to start using the application immediately after installation. This basic web server is vulnerable to multiple vulnerabilites. According to the vulnerability reporter this basic web server is vulnerable to XML injection, operating system command execution, LDAP injection, directory path traversal, and denial of service.",
        "impact": "An attacker with network access to the SmarterTools application basic web server may be able to run system commands, inject arbitrary data, or download arbitrary files."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/240150",
        "title": "SmarterTools default basic web server vulnerabilities",
        "overview": "Multiple SmarterTools applications install a default basic web server which contains multiple vulnerabilities",
        "description": "Multiple SmarterTools applications by default install a basic web server which allows administrators to start using the application immediately after installation. This basic web server is vulnerable to multiple vulnerabilites. According to the vulnerability reporter this basic web server is vulnerable to XML injection, operating system command execution, LDAP injection, directory path traversal, and denial of service.",
        "impact": "An attacker with network access to the SmarterTools application basic web server may be able to run system commands, inject arbitrary data, or download arbitrary files."
      }
    ],
    "CVE-2011-2151": [
      {
        "url": "http://www.kb.cert.org/vuls/id/240150",
        "title": "SmarterTools default basic web server vulnerabilities",
        "overview": "Multiple SmarterTools applications install a default basic web server which contains multiple vulnerabilities",
        "description": "Multiple SmarterTools applications by default install a basic web server which allows administrators to start using the application immediately after installation. This basic web server is vulnerable to multiple vulnerabilites. According to the vulnerability reporter this basic web server is vulnerable to XML injection, operating system command execution, LDAP injection, directory path traversal, and denial of service.",
        "impact": "An attacker with network access to the SmarterTools application basic web server may be able to run system commands, inject arbitrary data, or download arbitrary files."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/MORO-8GYQR4",
        "title": "SmarterTools default basic web server vulnerabilities",
        "overview": "Multiple SmarterTools applications install a default basic web server which contains multiple vulnerabilities",
        "description": "Multiple SmarterTools applications by default install a basic web server which allows administrators to start using the application immediately after installation. This basic web server is vulnerable to multiple vulnerabilites. According to the vulnerability reporter this basic web server is vulnerable to XML injection, operating system command execution, LDAP injection, directory path traversal, and denial of service.",
        "impact": "An attacker with network access to the SmarterTools application basic web server may be able to run system commands, inject arbitrary data, or download arbitrary files."
      }
    ],
    "CVE-2011-2152": [
      {
        "url": "http://www.kb.cert.org/vuls/id/MORO-8GYQR4",
        "title": "SmarterTools default basic web server vulnerabilities",
        "overview": "Multiple SmarterTools applications install a default basic web server which contains multiple vulnerabilities",
        "description": "Multiple SmarterTools applications by default install a basic web server which allows administrators to start using the application immediately after installation. This basic web server is vulnerable to multiple vulnerabilites. According to the vulnerability reporter this basic web server is vulnerable to XML injection, operating system command execution, LDAP injection, directory path traversal, and denial of service.",
        "impact": "An attacker with network access to the SmarterTools application basic web server may be able to run system commands, inject arbitrary data, or download arbitrary files."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/240150",
        "title": "SmarterTools default basic web server vulnerabilities",
        "overview": "Multiple SmarterTools applications install a default basic web server which contains multiple vulnerabilities",
        "description": "Multiple SmarterTools applications by default install a basic web server which allows administrators to start using the application immediately after installation. This basic web server is vulnerable to multiple vulnerabilites. According to the vulnerability reporter this basic web server is vulnerable to XML injection, operating system command execution, LDAP injection, directory path traversal, and denial of service.",
        "impact": "An attacker with network access to the SmarterTools application basic web server may be able to run system commands, inject arbitrary data, or download arbitrary files."
      }
    ],
    "CVE-2011-2153": [
      {
        "url": "http://www.kb.cert.org/vuls/id/MORO-8GYQR4",
        "title": "SmarterTools default basic web server vulnerabilities",
        "overview": "Multiple SmarterTools applications install a default basic web server which contains multiple vulnerabilities",
        "description": "Multiple SmarterTools applications by default install a basic web server which allows administrators to start using the application immediately after installation. This basic web server is vulnerable to multiple vulnerabilites. According to the vulnerability reporter this basic web server is vulnerable to XML injection, operating system command execution, LDAP injection, directory path traversal, and denial of service.",
        "impact": "An attacker with network access to the SmarterTools application basic web server may be able to run system commands, inject arbitrary data, or download arbitrary files."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/240150",
        "title": "SmarterTools default basic web server vulnerabilities",
        "overview": "Multiple SmarterTools applications install a default basic web server which contains multiple vulnerabilities",
        "description": "Multiple SmarterTools applications by default install a basic web server which allows administrators to start using the application immediately after installation. This basic web server is vulnerable to multiple vulnerabilites. According to the vulnerability reporter this basic web server is vulnerable to XML injection, operating system command execution, LDAP injection, directory path traversal, and denial of service.",
        "impact": "An attacker with network access to the SmarterTools application basic web server may be able to run system commands, inject arbitrary data, or download arbitrary files."
      }
    ],
    "CVE-2011-2154": [
      {
        "url": "http://www.kb.cert.org/vuls/id/240150",
        "title": "SmarterTools default basic web server vulnerabilities",
        "overview": "Multiple SmarterTools applications install a default basic web server which contains multiple vulnerabilities",
        "description": "Multiple SmarterTools applications by default install a basic web server which allows administrators to start using the application immediately after installation. This basic web server is vulnerable to multiple vulnerabilites. According to the vulnerability reporter this basic web server is vulnerable to XML injection, operating system command execution, LDAP injection, directory path traversal, and denial of service.",
        "impact": "An attacker with network access to the SmarterTools application basic web server may be able to run system commands, inject arbitrary data, or download arbitrary files."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/MORO-8GYQR4",
        "title": "SmarterTools default basic web server vulnerabilities",
        "overview": "Multiple SmarterTools applications install a default basic web server which contains multiple vulnerabilities",
        "description": "Multiple SmarterTools applications by default install a basic web server which allows administrators to start using the application immediately after installation. This basic web server is vulnerable to multiple vulnerabilites. According to the vulnerability reporter this basic web server is vulnerable to XML injection, operating system command execution, LDAP injection, directory path traversal, and denial of service.",
        "impact": "An attacker with network access to the SmarterTools application basic web server may be able to run system commands, inject arbitrary data, or download arbitrary files."
      }
    ],
    "CVE-2011-2155": [
      {
        "url": "http://www.kb.cert.org/vuls/id/240150",
        "title": "SmarterTools default basic web server vulnerabilities",
        "overview": "Multiple SmarterTools applications install a default basic web server which contains multiple vulnerabilities",
        "description": "Multiple SmarterTools applications by default install a basic web server which allows administrators to start using the application immediately after installation. This basic web server is vulnerable to multiple vulnerabilites. According to the vulnerability reporter this basic web server is vulnerable to XML injection, operating system command execution, LDAP injection, directory path traversal, and denial of service.",
        "impact": "An attacker with network access to the SmarterTools application basic web server may be able to run system commands, inject arbitrary data, or download arbitrary files."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/MORO-8GYQR4",
        "title": "SmarterTools default basic web server vulnerabilities",
        "overview": "Multiple SmarterTools applications install a default basic web server which contains multiple vulnerabilities",
        "description": "Multiple SmarterTools applications by default install a basic web server which allows administrators to start using the application immediately after installation. This basic web server is vulnerable to multiple vulnerabilites. According to the vulnerability reporter this basic web server is vulnerable to XML injection, operating system command execution, LDAP injection, directory path traversal, and denial of service.",
        "impact": "An attacker with network access to the SmarterTools application basic web server may be able to run system commands, inject arbitrary data, or download arbitrary files."
      }
    ],
    "CVE-2011-2156": [
      {
        "url": "http://www.kb.cert.org/vuls/id/240150",
        "title": "SmarterTools default basic web server vulnerabilities",
        "overview": "Multiple SmarterTools applications install a default basic web server which contains multiple vulnerabilities",
        "description": "Multiple SmarterTools applications by default install a basic web server which allows administrators to start using the application immediately after installation. This basic web server is vulnerable to multiple vulnerabilites. According to the vulnerability reporter this basic web server is vulnerable to XML injection, operating system command execution, LDAP injection, directory path traversal, and denial of service.",
        "impact": "An attacker with network access to the SmarterTools application basic web server may be able to run system commands, inject arbitrary data, or download arbitrary files."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/MORO-8GYQR4",
        "title": "SmarterTools default basic web server vulnerabilities",
        "overview": "Multiple SmarterTools applications install a default basic web server which contains multiple vulnerabilities",
        "description": "Multiple SmarterTools applications by default install a basic web server which allows administrators to start using the application immediately after installation. This basic web server is vulnerable to multiple vulnerabilites. According to the vulnerability reporter this basic web server is vulnerable to XML injection, operating system command execution, LDAP injection, directory path traversal, and denial of service.",
        "impact": "An attacker with network access to the SmarterTools application basic web server may be able to run system commands, inject arbitrary data, or download arbitrary files."
      }
    ],
    "CVE-2011-2157": [
      {
        "url": "http://www.kb.cert.org/vuls/id/MORO-8GYQR4",
        "title": "SmarterTools default basic web server vulnerabilities",
        "overview": "Multiple SmarterTools applications install a default basic web server which contains multiple vulnerabilities",
        "description": "Multiple SmarterTools applications by default install a basic web server which allows administrators to start using the application immediately after installation. This basic web server is vulnerable to multiple vulnerabilites. According to the vulnerability reporter this basic web server is vulnerable to XML injection, operating system command execution, LDAP injection, directory path traversal, and denial of service.",
        "impact": "An attacker with network access to the SmarterTools application basic web server may be able to run system commands, inject arbitrary data, or download arbitrary files."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/240150",
        "title": "SmarterTools default basic web server vulnerabilities",
        "overview": "Multiple SmarterTools applications install a default basic web server which contains multiple vulnerabilities",
        "description": "Multiple SmarterTools applications by default install a basic web server which allows administrators to start using the application immediately after installation. This basic web server is vulnerable to multiple vulnerabilites. According to the vulnerability reporter this basic web server is vulnerable to XML injection, operating system command execution, LDAP injection, directory path traversal, and denial of service.",
        "impact": "An attacker with network access to the SmarterTools application basic web server may be able to run system commands, inject arbitrary data, or download arbitrary files."
      }
    ],
    "CVE-2011-2165": [
      {
        "url": "http://www.kb.cert.org/vuls/id/MAPG-8D9M75",
        "title": "STARTTLS plaintext command injection vulnerability",
        "overview": "Some STARTTLS implementations could allow a remote attacker to inject commands during the plaintext phase of the protocol.",
        "description": "STARTTLS is an extension to plaintext communication protocols that offers a way to upgrade a plaintext connection to an encrypted (TLS or SSL) connection instead of using a separate port for encrypted communication. Some implementations of STARTTLS contain a vulnerability that could allow a remote unauthenticated attacker to inject commands during the plaintext protocol phase, that will be executed during the ciphertext protocol phase. This vulnerability is caused by the switch from plaintext to TLS being implemented below the application's I/O buffering layer.This issue is only of practical concern for affected implementations that also perform correct certificate validation. Implementations which do not perform certificate validation are already inherently vulnerable to man-in-the-middle attacks.Note: Not all implementations of STARTTLS are affected by this vulnerability. Some implementations of Simple Authentication and Security Layer (SASL) could also be affected by this vulnerability. Please see the Vendor Information below for specific vendor information.",
        "impact": "A remote attacker with the ability to pose as a man-in-the-middle may be able to inject commands for the corresponding protocol (e.g., SMTP, POP3, etc.) during the plaintext protocol phase, that will then be executed during the ciphertext protocol phase."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/555316",
        "title": "STARTTLS plaintext command injection vulnerability",
        "overview": "Some STARTTLS implementations could allow a remote attacker to inject commands during the plaintext phase of the protocol.",
        "description": "STARTTLS is an extension to plaintext communication protocols that offers a way to upgrade a plaintext connection to an encrypted (TLS or SSL) connection instead of using a separate port for encrypted communication. Some implementations of STARTTLS contain a vulnerability that could allow a remote unauthenticated attacker to inject commands during the plaintext protocol phase, that will be executed during the ciphertext protocol phase. This vulnerability is caused by the switch from plaintext to TLS being implemented below the application's I/O buffering layer.This issue is only of practical concern for affected implementations that also perform correct certificate validation. Implementations which do not perform certificate validation are already inherently vulnerable to man-in-the-middle attacks.Note: Not all implementations of STARTTLS are affected by this vulnerability. Some implementations of Simple Authentication and Security Layer (SASL) could also be affected by this vulnerability. Please see the Vendor Information below for specific vendor information.",
        "impact": "A remote attacker with the ability to pose as a man-in-the-middle may be able to inject commands for the corresponding protocol (e.g., SMTP, POP3, etc.) during the plaintext protocol phase, that will then be executed during the ciphertext protocol phase."
      }
    ],
    "CVE-2011-2328": [
      {
        "url": "http://www.kb.cert.org/vuls/id/987308",
        "title": "HP LoadRunner buffer overflow vulnerability",
        "overview": "HP LoadRunner contains a buffer overflow vulnerability when parsing Virtual User script files.",
        "description": "According to HP's website: HP LoadRunner software is the industry standard for performance validation. It allows you to prevent application performance problems by detecting bottlenecks before a new system or upgrade is deployed. HP LoadRunner contains a buffer overflow vulnerability when parsing Virtual User script (.usr) files containing long strings for directives, causing the HP LoadRunner application to crash.",
        "impact": "An attacker could exploit the vulnerability by tricking a user into opening a crafted .usr file, causing HP LoadRunner to crash leading to possible execution of arbitrary code."
      }
    ],
    "CVE-2011-2468": [
      {
        "url": "http://www.kb.cert.org/vuls/id/603590",
        "title": "Anymacro Mail System G4X email server web interface directory traversal vulnerability",
        "overview": "Anymacro Mail System G4X email server web interface contains a directory traversal vulnerability.",
        "description": "According to Anymacro's website: Anymacro Mail System is a professional e-mail and unified messaging product solution. Anymacro Mail System can be used for an e-mail platform for unified messaging, mail security, mail lists, and mail robots. Anymacro Mail System G4X email server web interface contains a directory traversal vulnerability in the e-mail filtering system caused by the mail system failing to pass the relevant page of the strict parameters securely. An attacker can exploit this vulnerability via directory traversal specifier sent in a specially crafted request to the application's web interface.",
        "impact": "A remote unauthenticated attacker could obtain sensitive information."
      }
    ],
    "CVE-2011-2530": [
      {
        "url": "http://www.kb.cert.org/vuls/id/MAPG-8G9PWX",
        "title": "RSLinx Classic EDS Wizard buffer overflow vulnerability",
        "overview": "Rockwell Automation RSLinx Classic EDS Hardware Installation Tool contains a buffer overflow vulnerability.",
        "description": "According to Rockwell Automation's website: RSLinx Classic provides plant-floor device connectivity for a wide variety of Rockwell Software applications such as RSLogix™ 5/500/5000 and RSView32. The EDS Hardware Installation Tool (RSHWare.exe) that comes bundled with RSLinx Classic contains a buffer overflow vulnerability while parsing improperly formatted EDS files.",
        "impact": "An attacker could exploit the vulnerability by tricking a user into opening a crafted .eds file, causing EDS Hardware Installation Tool to crash leading to possible execution of arbitrary code."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/127584",
        "title": "RSLinx Classic EDS Wizard buffer overflow vulnerability",
        "overview": "Rockwell Automation RSLinx Classic EDS Hardware Installation Tool contains a buffer overflow vulnerability.",
        "description": "According to Rockwell Automation's website: RSLinx Classic provides plant-floor device connectivity for a wide variety of Rockwell Software applications such as RSLogix™ 5/500/5000 and RSView32. The EDS Hardware Installation Tool (RSHWare.exe) that comes bundled with RSLinx Classic contains a buffer overflow vulnerability while parsing improperly formatted EDS files.",
        "impact": "An attacker could exploit the vulnerability by tricking a user into opening a crafted .eds file, causing EDS Hardware Installation Tool to crash leading to possible execution of arbitrary code."
      }
    ],
    "CVE-2011-2685": [
      {
        "url": "http://www.kb.cert.org/vuls/id/953183",
        "title": "LibreOffice 3.3 'Lotus Word Pro' document import filter contains multiple vulnerabilities",
        "overview": "LibreOffice 3.3.2 includes a feature to import 'Lotus Word Pro' (.lwp) documents. This import filter contains multiple vulnerabilities. CERT/CC has confirmed that code execution is possible by exploiting a stack buffer overflow.",
        "description": "LibreOffice 3.3.2, 3.3.1, and possibly earlier versions fail to properly handle 'Lotus Word Pro' (.lwp) documents. The (.lwp) format is the native file format for Lotus Word Pro that is a word processor developed by IBM's Lotus Software group. More details can be found by reviewing the following patch commits: Commit 1 and Commit 2.",
        "impact": "By convincing a user to open a specifically crafted 'Lotus Word Pro' (.lwp) document, an attacker may be able to execute arbitrary code."
      }
    ],
    "CVE-2011-2692": [
      {
        "url": "http://www.kb.cert.org/vuls/id/819894",
        "title": "libpng invalid sCAL chunk processing vulnerability",
        "overview": "libpng reads uninitialized memory when processing invalid sCAL chunks.",
        "description": "When libpng encounters a sCAL chunk that is empty it will read uninitialized memory. libpng also does not properly handle a sCAL chunk that lacks the terminating zero between the two strings conveyed.Additional details can be found on the png-mng-implement mailing list archives.",
        "impact": "By tricking a user into opening a specifically crafted PNG file within an application that uses libpng, an attacker may be able to cause a denial of service crash."
      }
    ],
    "CVE-2011-2751": [
      {
        "url": "http://www.kb.cert.org/vuls/id/246310",
        "title": "Parodia blind SQL injection vulnerability",
        "overview": "The Parodia job board software is vulnerable to a blind SQL injection vulnerability. Parodia 6.8 and earlier versions are reported to be affected.",
        "description": "Parodia is an ASP based job board application used for recruitment web sites. The Parodia software fails to properly sanitize SQL queries, which makes it vulnerable to a blind SQL injection attack.",
        "impact": "A remote unauthenticated attacker may be able to compromise sensitive information."
      }
    ],
    "CVE-2011-2755": [
      {
        "url": "http://www.kb.cert.org/vuls/id/543310",
        "title": "ManageEngine ServiceDesk directory traversal vulnerability",
        "overview": "ManageEngine ServiceDesk contains a directory traversal vulnerability which may allow a remote, unauthenticated attacker to obtain sensitive information.",
        "description": "ManageEngine ServiceDesk Plus 8.0, and possibly prior versions, contains a directory traversal vulnerability in the FileDownload.jsp page caused by an input validation error when handling requests. Additionally, ServiceDesk Plus 8.0 fails to verify that requests to the FileDownload.jsp page originate from an authenticated user. An unauthenticated attacker can exploit these vulnerabilities via directory traversal specifiers sent in a specially crafted request to the FileDownload.jsp page.",
        "impact": "A remote unauthenticated attacker could obtain sensitive information."
      }
    ],
    "CVE-2011-2756": [
      {
        "url": "http://www.kb.cert.org/vuls/id/543310",
        "title": "ManageEngine ServiceDesk directory traversal vulnerability",
        "overview": "ManageEngine ServiceDesk contains a directory traversal vulnerability which may allow a remote, unauthenticated attacker to obtain sensitive information.",
        "description": "ManageEngine ServiceDesk Plus 8.0, and possibly prior versions, contains a directory traversal vulnerability in the FileDownload.jsp page caused by an input validation error when handling requests. Additionally, ServiceDesk Plus 8.0 fails to verify that requests to the FileDownload.jsp page originate from an authenticated user. An unauthenticated attacker can exploit these vulnerabilities via directory traversal specifiers sent in a specially crafted request to the FileDownload.jsp page.",
        "impact": "A remote unauthenticated attacker could obtain sensitive information."
      }
    ],
    "CVE-2011-2760": [
      {
        "url": "http://www.kb.cert.org/vuls/id/853246",
        "title": "Brocade BigIron RX switch ACL bypass vulnerability",
        "overview": "Brocade BigIron RX switch devices are susceptible to an access control list (ACL) bypass vulnerability by sending packets with the source port 179.",
        "description": "Brocade BigIron RX switch devices do not properly restricted packets sent with a source port of 179. Port 179 is commonly used for Border Gateway Protocol (BGP) communication. It has been reported that individual packets with a source port of 179 are allowed through, as well as, full SSH and RDP sessions.",
        "impact": "A remote unauthenticated attacker can bypass any ACL rule on a BigIron RX switch device."
      }
    ],
    "CVE-2011-2762": [
      {
        "url": "http://www.kb.cert.org/vuls/id/213486",
        "title": "LifeSize Room appliance authentication bypass and arbitrary code injection vulnerability",
        "overview": "LifeSize Room appliance contains an authentication bypass and arbitrary code injection vulnerability when failing to sanitize input from unauthenticated clients.",
        "description": "According to LifeSize's website \"LifeSize Room combines an immersive, high definition video experience with a rich set of features to deliver a powerful, flexible, and easy-to-use video communication solution.\" The LifeSize Room appliance contains an embedded web interface that allows administrative access to the appliance. This web interface fails to sanitize input from unauthenticated clients leading to an authentication bypass and possibly arbitrary code injection. Using a proxy tool to intercept traffic between the attacker and the LifeSize Room appliance web interface, an unauthenticated attacker makes a request to the gateway.php web page that references the LSRoom_Remoting.authenticate function. The attacker can modify the Action Message Format (AMF) data in the response from the server, changing the value from \"false\" to \"true\" allowing the attacker to bypass the appliance web interface authentication. An additional vulnerability exists when an unauthenticated attacker makes a request to the gateway.php web page that references the LSRoom_Remoting.doCommand function. Using a proxy tool to intercept traffic between the attacker and the LifeSize Room appliance system web interface, the attacker can modify the AMF data in the original parameter \"pref -l /var/system/upgrade/status\" in the vulnerable LSRoom_Remoting.doCommand function to be an arbitrary command that will run with the permission of the webserver.According to the vulnerability reporter LifeSize Room LS_RM1_3.5.3 (11) and 4.7.18 is vulnerable, and possibly other versions.",
        "impact": "A remote, unauthenticated attacker can bypass the authentication of the administrative web interface and possibly inject arbitrary code in the administrative system web interface."
      }
    ],
    "CVE-2011-2763": [
      {
        "url": "http://www.kb.cert.org/vuls/id/213486",
        "title": "LifeSize Room appliance authentication bypass and arbitrary code injection vulnerability",
        "overview": "LifeSize Room appliance contains an authentication bypass and arbitrary code injection vulnerability when failing to sanitize input from unauthenticated clients.",
        "description": "According to LifeSize's website \"LifeSize Room combines an immersive, high definition video experience with a rich set of features to deliver a powerful, flexible, and easy-to-use video communication solution.\" The LifeSize Room appliance contains an embedded web interface that allows administrative access to the appliance. This web interface fails to sanitize input from unauthenticated clients leading to an authentication bypass and possibly arbitrary code injection. Using a proxy tool to intercept traffic between the attacker and the LifeSize Room appliance web interface, an unauthenticated attacker makes a request to the gateway.php web page that references the LSRoom_Remoting.authenticate function. The attacker can modify the Action Message Format (AMF) data in the response from the server, changing the value from \"false\" to \"true\" allowing the attacker to bypass the appliance web interface authentication. An additional vulnerability exists when an unauthenticated attacker makes a request to the gateway.php web page that references the LSRoom_Remoting.doCommand function. Using a proxy tool to intercept traffic between the attacker and the LifeSize Room appliance system web interface, the attacker can modify the AMF data in the original parameter \"pref -l /var/system/upgrade/status\" in the vulnerable LSRoom_Remoting.doCommand function to be an arbitrary command that will run with the permission of the webserver.According to the vulnerability reporter LifeSize Room LS_RM1_3.5.3 (11) and 4.7.18 is vulnerable, and possibly other versions.",
        "impact": "A remote, unauthenticated attacker can bypass the authentication of the administrative web interface and possibly inject arbitrary code in the administrative system web interface."
      }
    ],
    "CVE-2011-2779": [
      {
        "url": "http://www.kb.cert.org/vuls/id/122054",
        "title": "HP ArcSight Connector Appliance XSS vulnerability",
        "overview": "ArcSight Connector Appliance v6.0.0.60023.2, and possibly previous versions, contains a module which is vulnerable to cross site scripting (XSS).",
        "description": "Windows Event Log SmartConnector, a component of ArcSight Connector Appliance v6.0.0.60023.2 does not sanitize all input fields. As a result, cross site scripting (XSS) attacks can be conducted. An exportable report from the Windows Event Log SmartConnector for table parameters contains a drop-down selection field for \"Microsoft OS Version\". In some cases, this exported report is world-writeable with a default name. In the exported file an attacker can inject javascript code that will be run after the file is imported and the table parameters section is accessed for editing again.For example, the following javascript code can be injected into the \"Windows XP\" variable of the exported file:...,\"Windows XP<script> alert('XSS')</script>\",\"en_US\"",
        "impact": "An attacker with access to the ArcSight Connector Appliance can conduct a cross site scripting attack, which could be used to result in information leakage, privilege escalation, and/or denial of service."
      }
    ],
    "CVE-2011-3192": [
      {
        "url": "http://www.kb.cert.org/vuls/id/405811",
        "title": "Apache HTTPD 1.3/2.x Range header DoS vulnerability",
        "overview": "Apache HTTPD server contains a denial-of-service vulnerability in the way multiple overlapping ranges are handled. Both the 'Range' header and the 'Range-Request' header are vulnerable. An attack tool, commonly known as 'Apache Killer', has been released in the wild. The attack tool causes a significant increase in CPU and memory usage on the server.",
        "description": "The Apache HTTPD Security Advisory Update 2 states:\"Background and the 2007 report==============================There are two aspects to this vulnerability. One is new, is Apache specific; and resolved with this server side fix. The other issue is fundamentally a protocol design issue dating back to 2007: http://seclists.org/bugtraq/2007/Jan/83 The contemporary interpretation of the HTTP protocol (currently) requires a server to return multiple (overlapping) ranges; in the order requested. This means that one can request a very large range (e.g. from byte 0- to the end) 100's of times in a single request. Being able to do so is an issue for (probably all) webservers and currently subject of an IETF discussion to change the protocol: http://trac.tools.ietf.org/wg/httpbis/trac/ticket/311This advisory details a problem with how Apache httpd and its so called internal 'bucket brigades' deal with serving such \"valid\" request. The problem is that currently such requests internally explode into 100's of large fetches, all of which are kept in memory in an inefficient way. This is being addressed in two ways. By making things more efficient. And by weeding out or simplifying requests deemed too unwieldy.\"",
        "impact": "CPU and memory usage will spike causing a denial-of-service condition."
      }
    ],
    "CVE-2011-3323": [
      {
        "url": "http://www.kb.cert.org/vuls/id/668534",
        "title": "Multiple Quagga remote component vulnerabilities",
        "overview": "Quagga contains five remote component vulnerabilities due to issues when handling BGP, OSPF, and OSPFv3 packets.",
        "description": "CERT-FI reports:Quagga is an open source routing software that can handle various routing protocols such as RIP, BGP and OSPF. Five vulnerabilities have been found in the BGP, OSPF and OSPFv3 components of Quagga. The vulnerabilities allow an attacker to cause a denial of service or potentially to execute his own code by sending a specially modified packets to an affected server. Routing messages are typically accepted from the routing peers. Exploiting these vulnerabilities may require an established routing session (BGP peering or OSPF/OSPFv3 adjacency) to the router.The vulnerability CVE-2011-3327 is related to the extended communities handling in BGP messages. Receiving a malformed BGP update can result in a buffer overflow and disruption of IPv4 routing.The vulnerability CVE-2011-3326 results from the handling of LSA (Link State Advertisement) states in the OSPF service. Receiving a modified Link State Update message with malicious state information can result in denial of service in IPv4 routing.The vulnerability CVE-2011-3325 is a denial of service vulnerability related to Hello message handling by the OSPF service. As Hello messages are used to initiate adjacencies, exploiting the vulnerability may be feasible from the same broadcast domain without an established adjacency. A malformed packet may result in denial of service in IPv4 routing.The vulnerabilities CVE-2011-3324 and CVE-2011-3323 are related to the IPv6 routing protocol (OSPFv3) implemented in ospf6d daemon. Receiving modified Database Description and Link State Update messages, respectively, can result in denial of service in IPv6 routing.",
        "impact": "An attacker could exploit these vulnerabilities to cause a denial-of-service crash or may execute arbitrary code on the affected server with the permissions of the Quagga software."
      }
    ],
    "CVE-2011-3324": [
      {
        "url": "http://www.kb.cert.org/vuls/id/668534",
        "title": "Multiple Quagga remote component vulnerabilities",
        "overview": "Quagga contains five remote component vulnerabilities due to issues when handling BGP, OSPF, and OSPFv3 packets.",
        "description": "CERT-FI reports:Quagga is an open source routing software that can handle various routing protocols such as RIP, BGP and OSPF. Five vulnerabilities have been found in the BGP, OSPF and OSPFv3 components of Quagga. The vulnerabilities allow an attacker to cause a denial of service or potentially to execute his own code by sending a specially modified packets to an affected server. Routing messages are typically accepted from the routing peers. Exploiting these vulnerabilities may require an established routing session (BGP peering or OSPF/OSPFv3 adjacency) to the router.The vulnerability CVE-2011-3327 is related to the extended communities handling in BGP messages. Receiving a malformed BGP update can result in a buffer overflow and disruption of IPv4 routing.The vulnerability CVE-2011-3326 results from the handling of LSA (Link State Advertisement) states in the OSPF service. Receiving a modified Link State Update message with malicious state information can result in denial of service in IPv4 routing.The vulnerability CVE-2011-3325 is a denial of service vulnerability related to Hello message handling by the OSPF service. As Hello messages are used to initiate adjacencies, exploiting the vulnerability may be feasible from the same broadcast domain without an established adjacency. A malformed packet may result in denial of service in IPv4 routing.The vulnerabilities CVE-2011-3324 and CVE-2011-3323 are related to the IPv6 routing protocol (OSPFv3) implemented in ospf6d daemon. Receiving modified Database Description and Link State Update messages, respectively, can result in denial of service in IPv6 routing.",
        "impact": "An attacker could exploit these vulnerabilities to cause a denial-of-service crash or may execute arbitrary code on the affected server with the permissions of the Quagga software."
      }
    ],
    "CVE-2011-3325": [
      {
        "url": "http://www.kb.cert.org/vuls/id/668534",
        "title": "Multiple Quagga remote component vulnerabilities",
        "overview": "Quagga contains five remote component vulnerabilities due to issues when handling BGP, OSPF, and OSPFv3 packets.",
        "description": "CERT-FI reports:Quagga is an open source routing software that can handle various routing protocols such as RIP, BGP and OSPF. Five vulnerabilities have been found in the BGP, OSPF and OSPFv3 components of Quagga. The vulnerabilities allow an attacker to cause a denial of service or potentially to execute his own code by sending a specially modified packets to an affected server. Routing messages are typically accepted from the routing peers. Exploiting these vulnerabilities may require an established routing session (BGP peering or OSPF/OSPFv3 adjacency) to the router.The vulnerability CVE-2011-3327 is related to the extended communities handling in BGP messages. Receiving a malformed BGP update can result in a buffer overflow and disruption of IPv4 routing.The vulnerability CVE-2011-3326 results from the handling of LSA (Link State Advertisement) states in the OSPF service. Receiving a modified Link State Update message with malicious state information can result in denial of service in IPv4 routing.The vulnerability CVE-2011-3325 is a denial of service vulnerability related to Hello message handling by the OSPF service. As Hello messages are used to initiate adjacencies, exploiting the vulnerability may be feasible from the same broadcast domain without an established adjacency. A malformed packet may result in denial of service in IPv4 routing.The vulnerabilities CVE-2011-3324 and CVE-2011-3323 are related to the IPv6 routing protocol (OSPFv3) implemented in ospf6d daemon. Receiving modified Database Description and Link State Update messages, respectively, can result in denial of service in IPv6 routing.",
        "impact": "An attacker could exploit these vulnerabilities to cause a denial-of-service crash or may execute arbitrary code on the affected server with the permissions of the Quagga software."
      }
    ],
    "CVE-2011-3326": [
      {
        "url": "http://www.kb.cert.org/vuls/id/668534",
        "title": "Multiple Quagga remote component vulnerabilities",
        "overview": "Quagga contains five remote component vulnerabilities due to issues when handling BGP, OSPF, and OSPFv3 packets.",
        "description": "CERT-FI reports:Quagga is an open source routing software that can handle various routing protocols such as RIP, BGP and OSPF. Five vulnerabilities have been found in the BGP, OSPF and OSPFv3 components of Quagga. The vulnerabilities allow an attacker to cause a denial of service or potentially to execute his own code by sending a specially modified packets to an affected server. Routing messages are typically accepted from the routing peers. Exploiting these vulnerabilities may require an established routing session (BGP peering or OSPF/OSPFv3 adjacency) to the router.The vulnerability CVE-2011-3327 is related to the extended communities handling in BGP messages. Receiving a malformed BGP update can result in a buffer overflow and disruption of IPv4 routing.The vulnerability CVE-2011-3326 results from the handling of LSA (Link State Advertisement) states in the OSPF service. Receiving a modified Link State Update message with malicious state information can result in denial of service in IPv4 routing.The vulnerability CVE-2011-3325 is a denial of service vulnerability related to Hello message handling by the OSPF service. As Hello messages are used to initiate adjacencies, exploiting the vulnerability may be feasible from the same broadcast domain without an established adjacency. A malformed packet may result in denial of service in IPv4 routing.The vulnerabilities CVE-2011-3324 and CVE-2011-3323 are related to the IPv6 routing protocol (OSPFv3) implemented in ospf6d daemon. Receiving modified Database Description and Link State Update messages, respectively, can result in denial of service in IPv6 routing.",
        "impact": "An attacker could exploit these vulnerabilities to cause a denial-of-service crash or may execute arbitrary code on the affected server with the permissions of the Quagga software."
      }
    ],
    "CVE-2011-3327": [
      {
        "url": "http://www.kb.cert.org/vuls/id/668534",
        "title": "Multiple Quagga remote component vulnerabilities",
        "overview": "Quagga contains five remote component vulnerabilities due to issues when handling BGP, OSPF, and OSPFv3 packets.",
        "description": "CERT-FI reports:Quagga is an open source routing software that can handle various routing protocols such as RIP, BGP and OSPF. Five vulnerabilities have been found in the BGP, OSPF and OSPFv3 components of Quagga. The vulnerabilities allow an attacker to cause a denial of service or potentially to execute his own code by sending a specially modified packets to an affected server. Routing messages are typically accepted from the routing peers. Exploiting these vulnerabilities may require an established routing session (BGP peering or OSPF/OSPFv3 adjacency) to the router.The vulnerability CVE-2011-3327 is related to the extended communities handling in BGP messages. Receiving a malformed BGP update can result in a buffer overflow and disruption of IPv4 routing.The vulnerability CVE-2011-3326 results from the handling of LSA (Link State Advertisement) states in the OSPF service. Receiving a modified Link State Update message with malicious state information can result in denial of service in IPv4 routing.The vulnerability CVE-2011-3325 is a denial of service vulnerability related to Hello message handling by the OSPF service. As Hello messages are used to initiate adjacencies, exploiting the vulnerability may be feasible from the same broadcast domain without an established adjacency. A malformed packet may result in denial of service in IPv4 routing.The vulnerabilities CVE-2011-3324 and CVE-2011-3323 are related to the IPv6 routing protocol (OSPFv3) implemented in ospf6d daemon. Receiving modified Database Description and Link State Update messages, respectively, can result in denial of service in IPv6 routing.",
        "impact": "An attacker could exploit these vulnerabilities to cause a denial-of-service crash or may execute arbitrary code on the affected server with the permissions of the Quagga software."
      }
    ],
    "CVE-2011-3332": [
      {
        "url": "http://www.kb.cert.org/vuls/id/225833",
        "title": "Iceni products PDF parser stack buffer overflow",
        "overview": "Iceni Argus and Infix contain a stack buffer overflow in the handling of flate-compressed PDF content, which can allow a remote, unauthenticated attacker to execute arbitrary code on a vulnerable system.",
        "description": "Iceni Argus is a PDF conversion library. Argus 6.20 and earlier fail to properly handle malformed flate-compressed content in PDF documents, resulting in a stack buffer overflow. Other Argus applications that share the same codebase with Argus may also be affected. We have confirmed that Iceni Infix 5.04 is affected by this vulnerability.",
        "impact": "By causing the Iceni PDF library to parse a specially-crafted PDF document, a remote, unauthenticated attacker may be able to execute arbitrary code with the privileges of the application using the library."
      }
    ],
    "CVE-2011-3337": [
      {
        "url": "http://www.kb.cert.org/vuls/id/448051",
        "title": "eEye Retina audit script could execute untrusted programs as root",
        "overview": "eEye Retina audit scripts have the capability to run remote shell scripts in order to determine vulnerable applications. One audit script in particular (audit ID 2499) uses find(1) and execute (-exec) when assessing a vulnerability within Gauntlet Firewall. An attacker who can write an executable file in the portion of the file system searched with the find command may be able to exploit this vulnerability to execute arbitrary code with the same privileges provided to Retina to perform a vulnerability scan.",
        "description": "The eEye Retina Network Security Scanner software executes various audits against target systems to conduct security vulnerability assessment testing. eEye provides audit scripts to help perform security reviews of various operating systems and applications. One audit script for Solaris, HP-UX, and IRIX systems (audit ID 2499) checks the program version by searching the /usr/local portion of the file system and executing a file with options to display version information. The script executes a program based on file name. If an attacker can place an executable file with an appropriate name in /usr/local, that file will be executed by the audit script.Reported vulnerable audit script:Audit ID (2499) tests for the version of Gauntlet Firewall software installed under /usr/local on Solaris, HP-UX, and IRIX target machines with the following line of UNIX shell script: find /usr/local -name gauntlet -exec {} -v \\eEye recommends using unprivileged accounts when scanning hosts with the Retina product. However, the option does exist for user of Retina to provide a root credential to perform scans. In addition eEye provides documentation with warnings on how to run scans with sudo.",
        "impact": "An attacker who is able to write an executable file under the /usr/local file system (most likely, but not necessarily a local user) can execute arbitrary code with the same privileges provided to Retina to perform the vulnerability scan."
      }
    ],
    "CVE-2011-3389": [
      {
        "url": "http://www.kb.cert.org/vuls/id/864643",
        "title": "SSL 3.0 and TLS 1.0 allow chosen plaintext attack in CBC modes",
        "overview": "A vulnerability in the specification of the SSL 3.0 and TLS 1.0 protocols could allow an attacker to decrypt encrypted traffic.",
        "description": "The Secure Sockets Layer (SSL) and Transport Layer Security (TLS) protocols are commonly used to provide authentication, encryption, integrity, and non-repudiation services to network application protocols such as HTTP, IMAP, POP3, LDAP, SMTP, and others. Several different versions of the SSL and TLS protocols have been standardized and are in widespread use. These protocols support the use of both block-based and stream-based ciphers.A vulnerability in the way the SSL 3.0 and TLS 1.0 protocols select the initialization vector (IV) when operating in cipher-block chaining (CBC) modes allows an attacker to perform a chosen-plaintext attack on encrypted traffic. This vulnerability has been addressed in the specification for the TLS 1.1 and TLS 1.2 protocols.While this vulnerability exists in the underlying specification of the affected protocols, a practical attack called BEAST has been demonstrated in the context of a web browser and the use of the HTTPS protocol. Because of the software functionality available to an attacker in this environment, it represents the most likely attack vector and the most significant risk for affected users. An effective BEAST attack appears to require a cross-domain vulnerability that allows the attacker to issue specially crafted HTTPS requests. A blog post by Thái Duong discusses \"...a way to bypass the same-origin policy (SOP)...\" using a Java applet.",
        "impact": "An attacker with the ability to pose as a man-in-the-middle and to generate specially-crafted plaintext input could decrypt the contents of an SSL- or TLS-encrypted session. This could allow the attacker to recover potentially sensitive information (e.g., HTTP authentication cookies)."
      }
    ],
    "CVE-2011-3410": [
      {
        "url": "http://www.kb.cert.org/vuls/id/361441",
        "title": "Microsoft Office Publisher contains multiple exploitable vulnerabilities",
        "overview": "Microsoft Office Publisher fails to properly validate Publisher documents, which may allow a remote, unauthenticated attacker to execute arbitrary code on a vulnerable system.",
        "description": "Microsoft Publisher is a desktop publishing application that is provided with some versions of Microsoft Office. Microsoft Publisher fails to properly handle malformed publisher (.pub) documents, which can result in an exploitable situation. The vulnerabilities include: Out-of-bounds array indexing, invalid pointer use, and memory corruption.",
        "impact": "By convincing a user to open a specially crafted Publisher document, a remote, unauthenticated attacker could execute arbitrary code with the privileges of the user running Publisher."
      }
    ],
    "CVE-2011-3411": [
      {
        "url": "http://www.kb.cert.org/vuls/id/361441",
        "title": "Microsoft Office Publisher contains multiple exploitable vulnerabilities",
        "overview": "Microsoft Office Publisher fails to properly validate Publisher documents, which may allow a remote, unauthenticated attacker to execute arbitrary code on a vulnerable system.",
        "description": "Microsoft Publisher is a desktop publishing application that is provided with some versions of Microsoft Office. Microsoft Publisher fails to properly handle malformed publisher (.pub) documents, which can result in an exploitable situation. The vulnerabilities include: Out-of-bounds array indexing, invalid pointer use, and memory corruption.",
        "impact": "By convincing a user to open a specially crafted Publisher document, a remote, unauthenticated attacker could execute arbitrary code with the privileges of the user running Publisher."
      }
    ],
    "CVE-2011-3412": [
      {
        "url": "http://www.kb.cert.org/vuls/id/361441",
        "title": "Microsoft Office Publisher contains multiple exploitable vulnerabilities",
        "overview": "Microsoft Office Publisher fails to properly validate Publisher documents, which may allow a remote, unauthenticated attacker to execute arbitrary code on a vulnerable system.",
        "description": "Microsoft Publisher is a desktop publishing application that is provided with some versions of Microsoft Office. Microsoft Publisher fails to properly handle malformed publisher (.pub) documents, which can result in an exploitable situation. The vulnerabilities include: Out-of-bounds array indexing, invalid pointer use, and memory corruption.",
        "impact": "By convincing a user to open a specially crafted Publisher document, a remote, unauthenticated attacker could execute arbitrary code with the privileges of the user running Publisher."
      }
    ],
    "CVE-2011-3414": [
      {
        "url": "http://www.kb.cert.org/vuls/id/903934",
        "title": "Hash table implementations vulnerable to algorithmic complexity attacks",
        "overview": "Some programming language implementations do not sufficiently randomize their hash functions or provide means to limit key collision attacks, which can be leveraged by an unauthenticated attacker to cause a denial-of-service (DoS) condition.",
        "description": "Many applications, including common web framework implementations, use hash tables to map key values to associated entries. If the hash table contains entries for different keys that map to the same hash value, a hash collision occurs and additional processing is required to determine which entry is appropriate for the key. If an attacker can generate many requests containing colliding key values, an application performing the hash table lookup may enter a denial of service condition.Hash collision denial-of-service attacks were first detailed in 2003, but recent research details how these attacks apply to modern language hash table implementations.",
        "impact": "An application can be forced into a denial-of-service condition. In the case of some web application servers, specially-crafted POST form data may result in a denial-of-service."
      }
    ],
    "CVE-2011-3831": [
      {
        "url": "http://www.kb.cert.org/vuls/id/576355",
        "title": "Support Incident Tracker multiple vulnerabilities",
        "overview": "Support Incident Tracker (or SiT!) version 3.65, and possibly earlier versions, contain multiple vulnerabilities including; malicious file uploads, SQL injection, cross-site scripting, and cross-site request forgery.",
        "description": "According to the SiT! website:\"Support Incident Tracker (or SiT!) is a Free Software/Open Source (GPL) web based application which uses PHP and MySQL for tracking technical support calls/emails (also commonly known as a 'Help Desk' or 'Support Ticket System').\"SiT! is susceptible to multiple attacks, including; malicious file uploads, SQL injection, cross-site scripting, and cross-site request forgery.CWE-434: Unrestricted Upload of File with Dangerous TypeThe incident_attachments.php script does not filter the attachment's extension properly. An attacker may upload any file to the web server and have it run with the privileges of the web service. This vulnerability could be used to upload a PHP shell which may be used as a backdoor. The upload file path is structured in the following way: /attachments-{hash}/{incident ID}/{file ID}-{file name}.{extension}. An attacker would need user access to the website, as well as, brute forcing the attachments folder path. An attacker has two options to retrieve the folder path. The attacker could brute force the default attachments folder name because of a weak generation algorithm or the attacker could use the move_uploaded_file.php script to generate an error message that will include the folder path.The ftp_upload_file.php script is also vulnerable. An attacker may be able to upload any file to the web server and have it run with the privileges of the web service if they can guess the folder path.CWE-89: Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection')The incident_attachments.php script is vulnerable to SQL injection. The attachment file name is not properly sanitized. An attacker may exploit this flaw to execute queries against the database.CWE-79: Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting')The incident_attachments.php script is vulnerable to XSS. An attacker may be able to upload a filename that includes arbitrary script which will be run on the incident attachments web page.The link_add.php script is vulnerable to XSS. An attacker may be able to inject arbitrary script into the link creation page.The translate.php script is vulnerable to XSS. An attacker may inject arbitrary script into a saved translation web page which is then execute with the permissions of the web service.CWE-352: Cross-Site Request Forgery (CSRF)The reporter states that most of the SiT! scripts are vulnerable to CSRF attacks. For example, an attacker may be able to trick a logged in user to visit the following URL to delete a user account: /user_delete.php?userid=6. It has been reported that all web pages except config.php, edit_user_permissions.php, forgotpwd.php, user_add.php and user_profile_edit.php are vulnerable.",
        "impact": "An attacker may be able to inject arbitrary script, execute commands as a logged in user, or upload malicious files to the web server."
      }
    ],
    "CVE-2011-3976": [
      {
        "url": "http://www.kb.cert.org/vuls/id/440219",
        "title": "AmmSoft ScriptFTP 3.3 client remote buffer overflow vulnerability",
        "overview": "AmmSoft's ScriptFTP client is susceptible to a remote buffer overflow vulnerability that is triggered when processing a sufficiently long filename during a FTP LIST command.",
        "description": "AmmSoft's ScriptFTP client can be exploited to execute arbitrary code when processing GETLIST or GETFILE FTP commands. More details can be found at the reporter's blog: Digital Echidna",
        "impact": "An attacker can setup a malicious FTP server that will exploit the vulnerability to cause a denial-of-service crash or may execute arbitrary code on the client's computer with the permissions of the ScriptFTP client user."
      }
    ],
    "CVE-2011-4040": [
      {
        "url": "http://www.kb.cert.org/vuls/id/819630",
        "title": "NJStar Communicator MiniSmtp packet processing buffer overflow vulnerability",
        "overview": "NJStar Communicator MiniSmtp server contains a buffer overflow vulnerability when processing malicious packets.",
        "description": "According to the NJStar's website, \"NJStar Communicator enables Chinese, Japanese and Korean (CJK) language input, display, print and conversions on your English or other western Windows.\" NJStar Communicator contains a MiniSmtp server which listens on tcp/25. This MiniSmtp server contains a vulnerability caused by a boundary error when processing malicious packets. Note this server is not enabled by default.NJStar Communicator MiniSmtp version 3.0.11818 is reported to be affected. Other versions may also be affected. Exploit code has been released publicly.",
        "impact": "An attacker with network access to the NJStar Communicator MiniSmtp server could access the system with administrative privileges and potentially compromise the underlying host."
      }
    ],
    "CVE-2011-4046": [
      {
        "url": "http://www.kb.cert.org/vuls/id/135606",
        "title": "Dell KACE K2000 Appliance contains backdoor administrator account",
        "overview": "The Dell KACE K2000 System Deployment Appliance contains a hidden administrator account that could allow a remote attacker to take control of an affected device.",
        "description": "The Dell KACE K2000 Deployment Appliance is an integrated systems provisioning product for large-scale operating systems deployment. Some versions of the product contain a backdoor administrator account with a fixed password, accessible via the administrative web interface of the device. Furthermore, the backdoor account is not visible from, and cannot be removed via the appliance's administrative web interface.",
        "impact": "A remote attacker could login to an affected device with administrative privileges. Secondary impacts include: the ability to make configuration changes, modification of existing deployment/recovery images, access to sensitive information, and the ability to mount further attacks (e.g., execute arbitrary commands with elevated privileges)."
      }
    ],
    "CVE-2011-4047": [
      {
        "url": "http://www.kb.cert.org/vuls/id/589089",
        "title": "Dell KACE K2000 Appliance database administration account allows arbitrary command execution",
        "overview": "The Dell KACE K2000 System Deployment Appliance contains a vulnerability that could allow a remote attacker to execute arbitrary commands on an affected device.",
        "description": "The Dell KACE K2000 Deployment Appliance is an integrated systems provisioning product for large-scale operating systems deployment. The database configuration supplied with some versions of the K2000 appliance includes an administrative account with a known username and discernible password. A remote attacker with the ability to connect to the database component may be able to inject commands into a specific database table that will then be executed with administrative privileges by the Task Processor component of the appliance.Note that systems are only vulnerable if remote access to the database has been enabled. By default, remote access to the included database server is not enabled, however, an attacker may be able to leverage a separate vulnerability (e.g., VU#135606) to enable this access.",
        "impact": "An attacker with access to the database component may be able to execute arbitrary programs with root privileges on an affected device."
      }
    ],
    "CVE-2011-4054": [
      {
        "url": "http://www.kb.cert.org/vuls/id/MAPG-8MCH2B",
        "title": "CA Siteminder login.fcc form xss vulnerability",
        "overview": "CA Siteminder R6 SP6 CR7, R12 SP3 CR8 and possibly previous versions, are vulnerable to a reflective cross site scripting (XSS) vulnerability.",
        "description": "According to CA's website: \"CA SiteMinder provides a centralized security management foundation that enables the secure use of the web to deliver applications and cloud services to customers, partners, and employees.\" CA Siteminder software fails to sanitize POST requests sent to the login.fcc form. As a result, stored and reflective cross site scripting (XSS) attacks can be conducted. An attacker can inject javascript code that will be run each time the specified webpage is accessed by inserting javascript code in the affected parameter. According to the reporter the login.fcc webpage and postpreservationdata parameter is affected by a reflective XSS vulnerability, postpreservationdata=fail&target=\"><script>alert(1)</script><\"",
        "impact": "An attacker with access to the CA Siteminder can conduct a cross site scripting attack, which could be used to result in information leakage, privilege escalation, and/or denial of service."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/713012",
        "title": "CA Siteminder login.fcc form xss vulnerability",
        "overview": "CA Siteminder R6 SP6 CR7, R12 SP3 CR8 and possibly previous versions, are vulnerable to a reflective cross site scripting (XSS) vulnerability.",
        "description": "According to CA's website: \"CA SiteMinder provides a centralized security management foundation that enables the secure use of the web to deliver applications and cloud services to customers, partners, and employees.\" CA Siteminder software fails to sanitize POST requests sent to the login.fcc form. As a result, stored and reflective cross site scripting (XSS) attacks can be conducted. An attacker can inject javascript code that will be run each time the specified webpage is accessed by inserting javascript code in the affected parameter. According to the reporter the login.fcc webpage and postpreservationdata parameter is affected by a reflective XSS vulnerability, postpreservationdata=fail&target=\"><script>alert(1)</script><\"",
        "impact": "An attacker with access to the CA Siteminder can conduct a cross site scripting attack, which could be used to result in information leakage, privilege escalation, and/or denial of service."
      }
    ],
    "CVE-2011-4057": [
      {
        "url": "http://www.kb.cert.org/vuls/id/659515",
        "title": "Wibu-Systems CodeMeter remote denial of service vulnerability",
        "overview": "Wibu-Systems CodeMeter contains a remote denial of service vulnerability when receiving specially crafted packets.",
        "description": "Wibu-Systems CodeMeter v4.30c and v4.10b contain a remote denial of service vulnerability when receiving specially crafted packets. Wibu-Systems CodeMeter listens on TCP/22350 for incoming connections. An attacker can send a specially crafted packet causing CodeMeter.exe to crash.",
        "impact": "A remote, unauthenticated attacker could cause the Wibu-Systems CodeMeter application to crash creating a denial-of-service condition."
      },
      {
        "url": "http://www.kb.cert.org/vuls/id/MAPG-8MYNFL",
        "title": "Wibu-Systems CodeMeter remote denial of service vulnerability",
        "overview": "Wibu-Systems CodeMeter contains a remote denial of service vulnerability when receiving specially crafted packets.",
        "description": "Wibu-Systems CodeMeter v4.30c and v4.10b contain a remote denial of service vulnerability when receiving specially crafted packets. Wibu-Systems CodeMeter listens on TCP/22350 for incoming connections. An attacker can send a specially crafted packet causing CodeMeter.exe to crash.",
        "impact": "A remote, unauthenticated attacker could cause the Wibu-Systems CodeMeter application to crash creating a denial-of-service condition."
      }
    ],
    "CVE-2011-4108": [
      {
        "url": "http://www.kb.cert.org/vuls/id/737740",
        "title": "Fiery Network Controllers for Xerox DocuColor 242/252/260 Printer/Copier use a vulnerable version of OpenSSL",
        "overview": "Fiery Network Controllers for Xerox DocuColor 242/252/260 Printer/Copier use a vulnerable version of OpenSSL (0.9.8o).",
        "description": "Fiery Network Controllers for Xerox DocuColor 242/252/260 Printer/Copier uses OpenSSL for SSL/TLS encryption. The version of OpenSSL that comes with the Fiery Network Controllers for Xerox DocuColor 242/252/260 Printer/Copier is 0.9.8o that is out of date and known to be vulnerable.",
        "impact": "A remote attacker may be able to cause a denial of service or possibly run arbitrary code."
      }
    ],
    "CVE-2011-4109": [
      {
        "url": "http://www.kb.cert.org/vuls/id/737740",
        "title": "Fiery Network Controllers for Xerox DocuColor 242/252/260 Printer/Copier use a vulnerable version of OpenSSL",
        "overview": "Fiery Network Controllers for Xerox DocuColor 242/252/260 Printer/Copier use a vulnerable version of OpenSSL (0.9.8o).",
        "description": "Fiery Network Controllers for Xerox DocuColor 242/252/260 Printer/Copier uses OpenSSL for SSL/TLS encryption. The version of OpenSSL that comes with the Fiery Network Controllers for Xerox DocuColor 242/252/260 Printer/Copier is 0.9.8o that is out of date and known to be vulnerable.",
        "impact": "A remote attacker may be able to cause a denial of service or possibly run arbitrary code."
      }
    ],
    "CVE-2011-4151": [
      {
        "url": "http://www.kb.cert.org/vuls/id/659251",
        "title": "Multiple MIT KRB5 KDC daemon vulnerabilities",
        "overview": "MIT's KRB5 KDC version 1.8 and 1.9 contain multiple vulnerabilities.",
        "description": "The MIT krb5 Security Advisory 2011-006 states:CVE-2011-1527: In releases krb5-1.9 and later, the KDC can crash due to a null pointer dereference if configured to use the LDAP back end. A trigger condition is publicly known but not known to be widely circulated.CVE-2011-1528: In releases krb5-1.8 and later, the KDC can crash due to an assertion failure. No exploit is known to exist, but there is public evidence that the unidentified trigger condition occurs in the field.CVE-2011-1529: In releases krb5-1.8 and later, the KDC can crash due to a null pointer dereference. No exploit is known to exist.CVE-2011-4151: In releases krb5-1.8 through krb5-1.8.4, the KDC can crash due to an assertion failure if configured to use the Berkeley DB (\"db2\") back end.",
        "impact": "The MIT krb5 Security Advisory 2011-006 states:CVE-2011-1527: An unauthenticated remote attacker can crash a KDC daemon via null pointer dereference if the KDC is configured to use the LDAP back end. (This is not the default configuration.)CVE-2011-1528: An unauthenticated remote attacker can crash a KDC daemon via assertion failure.CVE-2011-1529: An unauthenticated remote attacker can crash a KDC daemon via null pointer dereference.CVE-2011-4151: An unauthenticated remote attacker can crash a KDC daemon via assertion failure if the KDC is configured to use the Berkeley DB (\"db2\") back end."
      }
    ],
    "CVE-2011-4161": [
      {
        "url": "http://www.kb.cert.org/vuls/id/717921",
        "title": "Hewlett-Packard printers and scanner devices allow remote unautheticated firmware updates",
        "overview": "A vulnerability in certain Hewlett-Packard devices could allow a remote attacker to install unauthorized firmware on an affected system.",
        "description": "Certain Hewlett-Packard Printers and Hewlett-Packard Digital Senders products allow the device's firmware to be updated over the network. The firmware update process can be accomplished via port 9100/tcp and does not require authentication. As a result, a remote attacker could perform unauthorized modification of the device's firmware.Hewlett-Packard notes that the remote firmware update feature is enabled by default on affected systems. The list of affected devices can be found in HP Security Bulletin HPSBPI02728 SSRT100692, and includes many varieties of the HP LaserJet and Color LaserJet products.",
        "impact": "A remote unauthenticated attacker could install malicious firmware on an affected device. This malicious firmware could allow the attacker to take control of the affected device, gain access to sensitive information sent to or from the device, or cause a denial of service (e.g., through malfunction of the device)."
      }
    ],
    "CVE-2011-4214": [
      {
        "url": "http://www.kb.cert.org/vuls/id/800227",
        "title": "OneOrZero AIMS authentication bypass and SQLi vulnerabilities",
        "overview": "OneOrZero Action & Information Management System (AIMS) is vulnerable to an authentication bypass and SQL injection.",
        "description": "According to the vendor's website:\"OneOrZero AIMS is a powerful enterprise ready suite that includes a help desk, knowledge base, time manager and reporting system supported by a highly configurable and extensible Action & Information Management System that allows you to 'build your own system' on the fly.\"AIMS is susceptible to an authentication bypass. An attacker can generate a session cookie for $_COOKIE['oozimsrememberme'] and log in as an administrator without providing a password. AIMS is also susceptible to SQL injection. On line 136 of lib\\ooz_access.php the $cookieName variable that originates from an attacker controllable cookie is passed to a SQL statement without any filtering:$sql = \"SELECT * FROM \" . OOZ_SET_TABLE_PREFIX . \"users WHERE user_name = '\" . $cookieName . \"'\";$userResult = DB::query($sql, DSN, OOZ_SET_SHOW_SQL);",
        "impact": "An unauthenticated remote attacker may be able to bypass authentication or leak database information."
      }
    ],
    "CVE-2011-4215": [
      {
        "url": "http://www.kb.cert.org/vuls/id/800227",
        "title": "OneOrZero AIMS authentication bypass and SQLi vulnerabilities",
        "overview": "OneOrZero Action & Information Management System (AIMS) is vulnerable to an authentication bypass and SQL injection.",
        "description": "According to the vendor's website:\"OneOrZero AIMS is a powerful enterprise ready suite that includes a help desk, knowledge base, time manager and reporting system supported by a highly configurable and extensible Action & Information Management System that allows you to 'build your own system' on the fly.\"AIMS is susceptible to an authentication bypass. An attacker can generate a session cookie for $_COOKIE['oozimsrememberme'] and log in as an administrator without providing a password. AIMS is also susceptible to SQL injection. On line 136 of lib\\ooz_access.php the $cookieName variable that originates from an attacker controllable cookie is passed to a SQL statement without any filtering:$sql = \"SELECT * FROM \" . OOZ_SET_TABLE_PREFIX . \"users WHERE user_name = '\" . $cookieName . \"'\";$userResult = DB::query($sql, DSN, OOZ_SET_SHOW_SQL);",
        "impact": "An unauthenticated remote attacker may be able to bypass authentication or leak database information."
      }
    ],
    "CVE-2011-4216": [
      {
        "url": "http://www.kb.cert.org/vuls/id/275036",
        "title": "Investintech.com SlimPDF Reader contains multiple vulnerabilities",
        "overview": "Investintech.com's SlimPDF viewer contains multiple vulnerabilities which may result in a denial of service and possibly arbitrary code execution.",
        "description": "Investintech.com's SlimPDF viewer contains multiple vulnerabilities, which include; user mode write access violations, read access violations on block data moves, write addresses being controlled by data from faulting instructions, data from faulting addresses control branch selection, and tainted data is passed to function calls. These vulnerabilities may be exploitable to leverage arbitrary code execution with the privileges of the user running the vulnerable application. If vulnerable code is shared among other Investintech.com products they may also be affected. It has been reported that the following applications are susceptible to a denial of service crash, which may possibly lead to arbitrary code execution: Able2Doc, Able2Doc Professional, Able2Extract, Absolute PDF Server, and Able2Extract Server.",
        "impact": "By convincing a user to open an untrusted specially-crafted .PDF file, a remote, unauthenticated attacker may be able to execute arbitrary code with the privileges of the vulnerable application."
      }
    ],
    "CVE-2011-4217": [
      {
        "url": "http://www.kb.cert.org/vuls/id/275036",
        "title": "Investintech.com SlimPDF Reader contains multiple vulnerabilities",
        "overview": "Investintech.com's SlimPDF viewer contains multiple vulnerabilities which may result in a denial of service and possibly arbitrary code execution.",
        "description": "Investintech.com's SlimPDF viewer contains multiple vulnerabilities, which include; user mode write access violations, read access violations on block data moves, write addresses being controlled by data from faulting instructions, data from faulting addresses control branch selection, and tainted data is passed to function calls. These vulnerabilities may be exploitable to leverage arbitrary code execution with the privileges of the user running the vulnerable application. If vulnerable code is shared among other Investintech.com products they may also be affected. It has been reported that the following applications are susceptible to a denial of service crash, which may possibly lead to arbitrary code execution: Able2Doc, Able2Doc Professional, Able2Extract, Absolute PDF Server, and Able2Extract Server.",
        "impact": "By convincing a user to open an untrusted specially-crafted .PDF file, a remote, unauthenticated attacker may be able to execute arbitrary code with the privileges of the vulnerable application."
      }
    ],
    "CVE-2011-4218": [
      {
        "url": "http://www.kb.cert.org/vuls/id/275036",
        "title": "Investintech.com SlimPDF Reader contains multiple vulnerabilities",
        "overview": "Investintech.com's SlimPDF viewer contains multiple vulnerabilities which may result in a denial of service and possibly arbitrary code execution.",
        "description": "Investintech.com's SlimPDF viewer contains multiple vulnerabilities, which include; user mode write access violations, read access violations on block data moves, write addresses being controlled by data from faulting instructions, data from faulting addresses control branch selection, and tainted data is passed to function calls. These vulnerabilities may be exploitable to leverage arbitrary code execution with the privileges of the user running the vulnerable application. If vulnerable code is shared among other Investintech.com products they may also be affected. It has been reported that the following applications are susceptible to a denial of service crash, which may possibly lead to arbitrary code execution: Able2Doc, Able2Doc Professional, Able2Extract, Absolute PDF Server, and Able2Extract Server.",
        "impact": "By convincing a user to open an untrusted specially-crafted .PDF file, a remote, unauthenticated attacker may be able to execute arbitrary code with the privileges of the vulnerable application."
      }
    ],
    "CVE-2011-4219": [
      {
        "url": "http://www.kb.cert.org/vuls/id/275036",
        "title": "Investintech.com SlimPDF Reader contains multiple vulnerabilities",
        "overview": "Investintech.com's SlimPDF viewer contains multiple vulnerabilities which may result in a denial of service and possibly arbitrary code execution.",
        "description": "Investintech.com's SlimPDF viewer contains multiple vulnerabilities, which include; user mode write access violations, read access violations on block data moves, write addresses being controlled by data from faulting instructions, data from faulting addresses control branch selection, and tainted data is passed to function calls. These vulnerabilities may be exploitable to leverage arbitrary code execution with the privileges of the user running the vulnerable application. If vulnerable code is shared among other Investintech.com products they may also be affected. It has been reported that the following applications are susceptible to a denial of service crash, which may possibly lead to arbitrary code execution: Able2Doc, Able2Doc Professional, Able2Extract, Absolute PDF Server, and Able2Extract Server.",
        "impact": "By convincing a user to open an untrusted specially-crafted .PDF file, a remote, unauthenticated attacker may be able to execute arbitrary code with the privileges of the vulnerable application."
      }
    ],
    "CVE-2011-4220": [
      {
        "url": "http://www.kb.cert.org/vuls/id/275036",
        "title": "Investintech.com SlimPDF Reader contains multiple vulnerabilities",
        "overview": "Investintech.com's SlimPDF viewer contains multiple vulnerabilities which may result in a denial of service and possibly arbitrary code execution.",
        "description": "Investintech.com's SlimPDF viewer contains multiple vulnerabilities, which include; user mode write access violations, read access violations on block data moves, write addresses being controlled by data from faulting instructions, data from faulting addresses control branch selection, and tainted data is passed to function calls. These vulnerabilities may be exploitable to leverage arbitrary code execution with the privileges of the user running the vulnerable application. If vulnerable code is shared among other Investintech.com products they may also be affected. It has been reported that the following applications are susceptible to a denial of service crash, which may possibly lead to arbitrary code execution: Able2Doc, Able2Doc Professional, Able2Extract, Absolute PDF Server, and Able2Extract Server.",
        "impact": "By convincing a user to open an untrusted specially-crafted .PDF file, a remote, unauthenticated attacker may be able to execute arbitrary code with the privileges of the vulnerable application."
      }
    ],
    "CVE-2011-4273": [
      {
        "url": "http://www.kb.cert.org/vuls/id/384427",
        "title": "GoAhead Webserver multiple stored XSS vulnerabilities",
        "overview": "GoAhead Webserver 2.18 and possibly previous or newer versions, are vulnerable to multiple stored and reflective cross site scripting (XSS) vulnerabilities.",
        "description": "GoAhead Webserver software fails to sanitize POST requests sent to the multiple functions. As a result, stored and reflective cross site scripting (XSS) attacks can be conducted. An attacker can inject javascript code that will be run each time the specified webpage is accessed by inserting javascript code in the affected parameter. According to the reporter the following webpages and parameters are affected by stored and reflective XSS vulnerabilities:Stored XSS in group parameter of addgroup.asp.POST /goform/AddGroup HTTP/1.1group=<script>alert(1337)</script>&privilege=4&method=1&enabled=on&ok=OKResults: Reflected XSS displayed in addgroup.asp, stored XSS in: adduser.asp, addlimit.asp, delgroup.asp.Stored XSS in url parameter of addlimit.aspPOST /goform/AddAccessLimit HTTP/1.1url=<script>alert(1337)</script>&group=test&method=3&ok=OKResults: Stored when user requests dellimit.asp.Stored XSS in adduser.asp, User ID parameter.Note: for this to work, there must be at least one valid group created in addgroup.asp. In this example, you can swap out the group=<script>alert(1337) for whichever group name you added. password= and passconf= can also be modified to whichever password you want the new user to have.POST /goform/AddUser HTTP/1.1user=%3Cscript%3Ealert%281337%29%3C%2Fscript%3E&group=%3Cscript%3Ealert%281337%29%3C%2Fscript%3E&enabled=on&password=test&passconf=test&ok=OKResult: Reflected in reply, stored in: deluser.asp,dspuser.asp.",
        "impact": "An attacker with access to the GoAhead Webserver can conduct a cross site scripting attack, which could be used to result in information leakage, privilege escalation, and/or denial of service."
      }
    ],
    "CVE-2011-4277": [
      {
        "url": "http://www.kb.cert.org/vuls/id/901251",
        "title": "ProjectForum XSS vulnerability",
        "overview": "ProjectForum 7.0.1.3038 and possibly previous versions, are vulnerable to cross site scripting (XSS).",
        "description": "CourseForum's ProjectForum software fails to sanitize all input fields. As a result, cross site scripting (XSS) attacks can be conducted. By default, a non-credentialed user can create a new webpage on a ProjectForum wiki. Each ProjectForum wiki page contains a \"more\" object which allows a listing of objects associated with the ProjectForum wiki webpage. An attacker can inject javascript code that will be run each time the ProjectForum wiki webpage is accessed by renaming one of the ProjectForum wiki associated objects and inserting javascript code as the name.For example, the following javascript code can be injected into the listing of objects variable:<IMG \"><SCRIPT>alert(\"Vulnerable\")</SCRIPT>\">",
        "impact": "An attacker with access to the ProjectForum wiki can conduct a cross site scripting attack, which could be used to result in information leakage, privilege escalation, and/or denial of service."
      }
    ],
    "CVE-2011-4436": [
      {
        "url": "http://www.kb.cert.org/vuls/id/193529",
        "title": "Dell KACE K2000 Appliance contains multiple reflected cross-site scripting vulnerabilities",
        "overview": "The administrative web interface for the Dell KACE K2000 System Deployment Appliance contains multiple cross-site scripting vulnerabilities.",
        "description": "The Dell KACE K2000 Deployment Appliance is an integrated systems provisioning product for large-scale operating systems deployment. Several components that support the administrative web interface supplied with the system are vulnerable to reflected (i.e., non-persistent) script injection.A malicious link supplied by the attacker (e.g., in email or another web page) can cause the vulnerable web server to reflect injected code back to the user's browser, where it is executed in the context of the affected site. The vulnerable components require the victim user to be authenticated to the affected system in order for the attacker's script to be executed.",
        "impact": "A remote attacker may be able to access the cookies, session tokens, or other sensitive information of a user authenticated to the affected system."
      }
    ],
    "CVE-2011-4461": [
      {
        "url": "http://www.kb.cert.org/vuls/id/903934",
        "title": "Hash table implementations vulnerable to algorithmic complexity attacks",
        "overview": "Some programming language implementations do not sufficiently randomize their hash functions or provide means to limit key collision attacks, which can be leveraged by an unauthenticated attacker to cause a denial-of-service (DoS) condition.",
        "description": "Many applications, including common web framework implementations, use hash tables to map key values to associated entries. If the hash table contains entries for different keys that map to the same hash value, a hash collision occurs and additional processing is required to determine which entry is appropriate for the key. If an attacker can generate many requests containing colliding key values, an application performing the hash table lookup may enter a denial of service condition.Hash collision denial-of-service attacks were first detailed in 2003, but recent research details how these attacks apply to modern language hash table implementations.",
        "impact": "An application can be forced into a denial-of-service condition. In the case of some web application servers, specially-crafted POST form data may result in a denial-of-service."
      }
    ],
    "CVE-2011-4462": [
      {
        "url": "http://www.kb.cert.org/vuls/id/903934",
        "title": "Hash table implementations vulnerable to algorithmic complexity attacks",
        "overview": "Some programming language implementations do not sufficiently randomize their hash functions or provide means to limit key collision attacks, which can be leveraged by an unauthenticated attacker to cause a denial-of-service (DoS) condition.",
        "description": "Many applications, including common web framework implementations, use hash tables to map key values to associated entries. If the hash table contains entries for different keys that map to the same hash value, a hash collision occurs and additional processing is required to determine which entry is appropriate for the key. If an attacker can generate many requests containing colliding key values, an application performing the hash table lookup may enter a denial of service condition.Hash collision denial-of-service attacks were first detailed in 2003, but recent research details how these attacks apply to modern language hash table implementations.",
        "impact": "An application can be forced into a denial-of-service condition. In the case of some web application servers, specially-crafted POST form data may result in a denial-of-service."
      }
    ],
    "CVE-2011-4496": [
      {
        "url": "http://www.kb.cert.org/vuls/id/998403",
        "title": "Aviosoft DTV Player buffer overflow vulnerability",
        "overview": "Aviosoft DTV Player contains a buffer overflow in the handling of playlist (.plf) files, which can allow a remote, unauthenticated attacker to execute arbitrary code on a vulnerable system.",
        "description": "Aviosoft DTV Player is a multiple format video player application. Aviosoft DTV Player 1.0.1.2 and possibly earlier versions fail to properly handle malformed user-supplied data within a playlist (.plf) file before copying it into an insufficiently sized buffer, resulting in a buffer overflow.",
        "impact": "By causing the Aviosoft DTV Player to parse a specially-crafted playlist (.plf) file, a remote, unauthenticated attacker may be able to execute arbitrary code with the privileges of the application using the application."
      }
    ],
    "CVE-2011-4497": [
      {
        "url": "http://www.kb.cert.org/vuls/id/200814",
        "title": "ASUS RT-N56U remote password disclosure vulnerability",
        "overview": "ASUS's Wireless-N Gigabit Router RT-N56U is vulnerable to remote administrator password disclosure.",
        "description": "ASUS's Wireless-N Gigabit Router RT-N56U contains a vulnerability which may allow a remote unauthenticated attacker to recover the device's administrator password. An attacker with network access to the device can navigate to the web page http://RouterIPAddress/QIS_wizard.htm?flag=detect. The attacker will be presented with a web page containing the device's configuration without entering any login credentials. This web page will display the device's administrator password. The default configuration for this device is to only allow clients connected to the Local Area Network (LAN) to access the system web interface.This vulnerability has been reported in ASUS's Wireless-N Gigabit Router RT-N56U firmware version 1.0.1.4.",
        "impact": "An unauthenticated attacker that is connected to the router's LAN may be able to retrieve the device's administrator password allowing them to directly access the device's configuration web page."
      }
    ],
    "CVE-2011-4498": [
      {
        "url": "http://www.kb.cert.org/vuls/id/584363",
        "title": "Zenprise Device Manager CSRF vulnerability",
        "overview": "The Zenprise Device Manager software is susceptible to a cross-site request forgery (CSRF) vulnerability that may result in the compromise of the fleet of mobile devices managed by the product.",
        "description": "Zenprise Device Manager is a mobile device management (MDM) software package that can be used to manage an enterprise's mobile device fleet. The Zenprise Device manager web interface is vulnerable to cross-site request forgery (CSRF) attacks. A successful CSRF attack against an admin user will allow a remote attacker to run commands as the admin user on any device managed by Zenprise Device Manager.",
        "impact": "By tricking a logged in admin user to visit a specially crafted URL, a remote attacker may be able to access any managed device as the admin. The attacker can then perform any action an admin can, including remotely wiping the device."
      }
    ],
    "CVE-2011-4502": [
      {
        "url": "http://www.kb.cert.org/vuls/id/357851",
        "title": "UPnP requests accepted over router WAN interfaces",
        "overview": "Some Internet router devices incorrectly accept UPnP requests over the WAN interface.",
        "description": "Universal Plug and Play (UPnP) is a networking protocol mostly used for personal computing devices to discover and communicate with each other and the Internet. Some UPnP enabled router devices incorrectly accept UPnP requests over the WAN interface. \"AddPortMapping\" and \"DeletePortMapping\" actions are accepted on these devices. These requests can be used to connect to internal hosts behind a NAT firewall and also proxy connections through the device and back out to the Internet. Additional details can be found in Daniel Garcia's whitepaper, \"Universal plug and play (UPnP) mapping attacks\". [PDF] A list of devices reported to be vulnerable can be found on the UPnP hacks website.",
        "impact": "A remote unauthenticated attacker may be able to scan internal hosts or proxy Internet traffic through the device."
      }
    ],
    "CVE-2011-4507": [
      {
        "url": "http://www.kb.cert.org/vuls/id/924307",
        "title": "D-Link DIR-685 Xtreme N storage router WPA/WPA2 encryption failure",
        "overview": "The D-Link DIR-685 Xtreme N storage router is reported to fail open to an unencrypted wireless connection during heavy network load.",
        "description": "The D-Link DIR-685 Xtreme N storage router when configured with WPA/WPA2 and an AES cipher with a pre-shared key (PSK) will fail to an open unencrypted wireless connection during heavy network load, such as, the transfer of several gigabytes of data. The router's wireless connection will remain in an open unencrypted state until the device is rebooted.",
        "impact": "An attacker within physical range of the wireless router may be able to connect to the router's network without having to authenticate and then sniff traffic and also use the victim's Internet connection to launch other attacks."
      }
    ],
    "CVE-2011-4516": [
      {
        "url": "http://www.kb.cert.org/vuls/id/887409",
        "title": "JasPer memory corruption vulnerabilities",
        "overview": "Some versions of JasPer contain multiple vulnerabilities that may allow a remote, unauthenticated attacker to execute arbitrary code.",
        "description": "JasPer fails to properly decode marker segments and other sections in malformed JPEG2000 files. Malformed inputs can cause heap buffer overflows which in turn may result in execution of attacker-controlled code.CVE-2011-4516: src/libjasper/jpc/jpc_cs.c: jpc_cox_getcompparmsjpc_cox_getcomparms is called as part of the decoding of a coding style default (COD) marker segment. The function populates a parameter struct (jpc_msparms_t) that is contained in a marker segment struct (jpc_ms_t). jpc_cox_getcompparms contains a loop that copies data from the input file to the jpc_msparms_t struct. The loop terminates on a value (numrlvls) derived from the input file:for (i = 0; i < compparms->numrlvls; ++i) { if (jpc_getuint8(in, &tmp)) { jpc_cox_destroycompparms(compparms); return -1; } compparms->rlvls[i].parwidthval = tmp & 0xf; compparms->rlvls[i].parheightval = (tmp >> 4) & 0xf;}numrlvls is read from the input file. The attacker can control numrlvls to overflow the jpc_msparms_t struct and copy attacker-controlled data from the input file into a struct of callback functions (jpc_msops_s) that appears in jpc_ms_t (src/libjasper/jpc/jpc_cs.h) just after jpc_msparms_t:typedef struct { /* The type of marker segment. */ uint_fast16_t id; /* The length of the marker segment. */ uint_fast16_t len; /* The starting offset within the stream. */ uint_fast32_t off; /* The parameters of the marker segment. */ jpc_msparms_t parms; /* The marker segment operations. */ struct jpc_msops_s *ops;} jpc_ms_t;Any subsequent failures in decoding the marker segment will result in the destroyparms member of the callback struct being invoked as part of cleanup. If the attacker has overwritten this callback via the loop above, attacker-controlled values can be loaded into the program counter.CVE-2011-4517: src/libjasper/jpc/jpc_cs.c: jpc_crg_getparmsjpc_crg_getparms is called as part of the decoding of a component registration (CRG) marker segment. This function populates a heap buffer with data derived from the input file (in).The function contains an allocation size/type error. The heap buffer size is calculated using sizeof(uint_fast16_t) but the rest of the function assumes sizeof(jpc_crgcomp_t).jpc_crgcomp_t *comp;...if (!(crg->comps = jas_malloc(cstate->numcomps * sizeof(uint_fast16_t)))) { return -1;}...for (compno = 0, comp = crg->comps; compno < cstate->numcomps;++compno, ++comp) { if (jpc_getuint16(in, &comp->hoff) || jpc_getuint16(in, &comp->voff)) { jpc_crg_destroyparms(ms); return -1; }}The attacker can overwrite the bytes after crg->comp in memory with arbitrary data. This is a heap buffer overflow, which is generally considered exploitable.There are additional security implications here as well, however. The loop above is controlled by cstate->numcomps (cstate as one member: numcomps). cstate is allocated in a calling function, and is often allocated just before crg->comp. On some platforms the heap chunk allocated for cstate is located just after the heap chunk allocated for crg->comp, separated by only 4 bytes of heap accounting info. The accounting info + cstate (8 bytes after crg->comp) can be overwritten with bytes from the input file via the loop above. In these cases, the attacker can place a large number in cstate->numcomps to make the loop above iterate past the expected bound of crg->comps and copy an arbitrary number of bytes from the input file into heap (a heap buffer overflow). This enables the attacker to perform well-known heap exploitations, as well as allowing the attacker to overwrite other active heap allocations such as the callback pointers referenced in the previous bug description.",
        "impact": "By tricking a user into opening or previewing an image file in an application that decodes images with the JasPer library, an attacker can execute arbitrary code or cause a denial-of-service crash."
      }
    ],
    "CVE-2011-4517": [
      {
        "url": "http://www.kb.cert.org/vuls/id/887409",
        "title": "JasPer memory corruption vulnerabilities",
        "overview": "Some versions of JasPer contain multiple vulnerabilities that may allow a remote, unauthenticated attacker to execute arbitrary code.",
        "description": "JasPer fails to properly decode marker segments and other sections in malformed JPEG2000 files. Malformed inputs can cause heap buffer overflows which in turn may result in execution of attacker-controlled code.CVE-2011-4516: src/libjasper/jpc/jpc_cs.c: jpc_cox_getcompparmsjpc_cox_getcomparms is called as part of the decoding of a coding style default (COD) marker segment. The function populates a parameter struct (jpc_msparms_t) that is contained in a marker segment struct (jpc_ms_t). jpc_cox_getcompparms contains a loop that copies data from the input file to the jpc_msparms_t struct. The loop terminates on a value (numrlvls) derived from the input file:for (i = 0; i < compparms->numrlvls; ++i) { if (jpc_getuint8(in, &tmp)) { jpc_cox_destroycompparms(compparms); return -1; } compparms->rlvls[i].parwidthval = tmp & 0xf; compparms->rlvls[i].parheightval = (tmp >> 4) & 0xf;}numrlvls is read from the input file. The attacker can control numrlvls to overflow the jpc_msparms_t struct and copy attacker-controlled data from the input file into a struct of callback functions (jpc_msops_s) that appears in jpc_ms_t (src/libjasper/jpc/jpc_cs.h) just after jpc_msparms_t:typedef struct { /* The type of marker segment. */ uint_fast16_t id; /* The length of the marker segment. */ uint_fast16_t len; /* The starting offset within the stream. */ uint_fast32_t off; /* The parameters of the marker segment. */ jpc_msparms_t parms; /* The marker segment operations. */ struct jpc_msops_s *ops;} jpc_ms_t;Any subsequent failures in decoding the marker segment will result in the destroyparms member of the callback struct being invoked as part of cleanup. If the attacker has overwritten this callback via the loop above, attacker-controlled values can be loaded into the program counter.CVE-2011-4517: src/libjasper/jpc/jpc_cs.c: jpc_crg_getparmsjpc_crg_getparms is called as part of the decoding of a component registration (CRG) marker segment. This function populates a heap buffer with data derived from the input file (in).The function contains an allocation size/type error. The heap buffer size is calculated using sizeof(uint_fast16_t) but the rest of the function assumes sizeof(jpc_crgcomp_t).jpc_crgcomp_t *comp;...if (!(crg->comps = jas_malloc(cstate->numcomps * sizeof(uint_fast16_t)))) { return -1;}...for (compno = 0, comp = crg->comps; compno < cstate->numcomps;++compno, ++comp) { if (jpc_getuint16(in, &comp->hoff) || jpc_getuint16(in, &comp->voff)) { jpc_crg_destroyparms(ms); return -1; }}The attacker can overwrite the bytes after crg->comp in memory with arbitrary data. This is a heap buffer overflow, which is generally considered exploitable.There are additional security implications here as well, however. The loop above is controlled by cstate->numcomps (cstate as one member: numcomps). cstate is allocated in a calling function, and is often allocated just before crg->comp. On some platforms the heap chunk allocated for cstate is located just after the heap chunk allocated for crg->comp, separated by only 4 bytes of heap accounting info. The accounting info + cstate (8 bytes after crg->comp) can be overwritten with bytes from the input file via the loop above. In these cases, the attacker can place a large number in cstate->numcomps to make the loop above iterate past the expected bound of crg->comps and copy an arbitrary number of bytes from the input file into heap (a heap buffer overflow). This enables the attacker to perform well-known heap exploitations, as well as allowing the attacker to overwrite other active heap allocations such as the callback pointers referenced in the previous bug description.",
        "impact": "By tricking a user into opening or previewing an image file in an application that decodes images with the JasPer library, an attacker can execute arbitrary code or cause a denial-of-service crash."
      }
    ],
    "CVE-2011-4528": [
      {
        "url": "http://www.kb.cert.org/vuls/id/209659",
        "title": "Unbound multiple denial-of-service vulnerabilities",
        "overview": "A specially crafted DNS query containing signed duplicate resource records or a malformed NSEC3 signed resource record may cause Unbound to crash.",
        "description": "NLnetLabs advisory states:== Description 1: crash on signed duplicate Resource RecordsThere are authoritative servers that erroneously send duplicated redirection Resource Records. Unbound has had a workaround that deals with this problem since version 1.0.1 whereby it ignores the duplicate answers. At the time, likely, no DNSSEC signed versions of such zones existed and only recently such misbehaving authority servers also started serving signed duplicate RRs causing improper memory allocation in a portion of the workaround code.Referencing this improper allocated data causes a crash which can look like 'uninitialised lock', segmentation faults or free() errors as it tries to free memory that was never allocated.== Description 2: crash on missing NSEC3 Resource Records.If an authority server sends a reply for an NSEC3-signed zone, and Unbound is configured to validate that zone, then a malformed response can trigger an assertion failure: when an authority server sends a response that contains RR types that trigger special processing and where part of the non-existence proof is missing then an assertion failure is triggered in unbound. This response case was observed in the wild on authority servers that host zones at different points in the hierarchy at the same time.The code crashes at assertion failure validator/val_nsec3.c:1214: nsec3_do_prove_nodata: assertion ce.nc_rrset failed Or, if assertions are not compiled it, it crashes soon after as it attempts to access an expected NSEC3 RR.Additional details can be found in the full NLnetLabs Unbound advisory.",
        "impact": "A remote, unauthenticated attacker could cause the Unbound daemon to crash creating a denial-of-service condition."
      }
    ],
    "CVE-2011-4576": [
      {
        "url": "http://www.kb.cert.org/vuls/id/737740",
        "title": "Fiery Network Controllers for Xerox DocuColor 242/252/260 Printer/Copier use a vulnerable version of OpenSSL",
        "overview": "Fiery Network Controllers for Xerox DocuColor 242/252/260 Printer/Copier use a vulnerable version of OpenSSL (0.9.8o).",
        "description": "Fiery Network Controllers for Xerox DocuColor 242/252/260 Printer/Copier uses OpenSSL for SSL/TLS encryption. The version of OpenSSL that comes with the Fiery Network Controllers for Xerox DocuColor 242/252/260 Printer/Copier is 0.9.8o that is out of date and known to be vulnerable.",
        "impact": "A remote attacker may be able to cause a denial of service or possibly run arbitrary code."
      }
    ],
    "CVE-2011-4577": [
      {
        "url": "http://www.kb.cert.org/vuls/id/737740",
        "title": "Fiery Network Controllers for Xerox DocuColor 242/252/260 Printer/Copier use a vulnerable version of OpenSSL",
        "overview": "Fiery Network Controllers for Xerox DocuColor 242/252/260 Printer/Copier use a vulnerable version of OpenSSL (0.9.8o).",
        "description": "Fiery Network Controllers for Xerox DocuColor 242/252/260 Printer/Copier uses OpenSSL for SSL/TLS encryption. The version of OpenSSL that comes with the Fiery Network Controllers for Xerox DocuColor 242/252/260 Printer/Copier is 0.9.8o that is out of date and known to be vulnerable.",
        "impact": "A remote attacker may be able to cause a denial of service or possibly run arbitrary code."
      }
    ],
    "CVE-2011-4619": [
      {
        "url": "http://www.kb.cert.org/vuls/id/737740",
        "title": "Fiery Network Controllers for Xerox DocuColor 242/252/260 Printer/Copier use a vulnerable version of OpenSSL",
        "overview": "Fiery Network Controllers for Xerox DocuColor 242/252/260 Printer/Copier use a vulnerable version of OpenSSL (0.9.8o).",
        "description": "Fiery Network Controllers for Xerox DocuColor 242/252/260 Printer/Copier uses OpenSSL for SSL/TLS encryption. The version of OpenSSL that comes with the Fiery Network Controllers for Xerox DocuColor 242/252/260 Printer/Copier is 0.9.8o that is out of date and known to be vulnerable.",
        "impact": "A remote attacker may be able to cause a denial of service or possibly run arbitrary code."
      }
    ],
    "CVE-2011-4735": [
      {
        "url": "http://www.kb.cert.org/vuls/id/541814"
      }
    ],
    "CVE-2011-4815": [
      {
        "url": "http://www.kb.cert.org/vuls/id/903934",
        "title": "Hash table implementations vulnerable to algorithmic complexity attacks",
        "overview": "Some programming language implementations do not sufficiently randomize their hash functions or provide means to limit key collision attacks, which can be leveraged by an unauthenticated attacker to cause a denial-of-service (DoS) condition.",
        "description": "Many applications, including common web framework implementations, use hash tables to map key values to associated entries. If the hash table contains entries for different keys that map to the same hash value, a hash collision occurs and additional processing is required to determine which entry is appropriate for the key. If an attacker can generate many requests containing colliding key values, an application performing the hash table lookup may enter a denial of service condition.Hash collision denial-of-service attacks were first detailed in 2003, but recent research details how these attacks apply to modern language hash table implementations.",
        "impact": "An application can be forced into a denial-of-service condition. In the case of some web application servers, specially-crafted POST form data may result in a denial-of-service."
      }
    ],
    "CVE-2011-4835": [
      {
        "url": "http://www.kb.cert.org/vuls/id/796883",
        "title": "HomeSeer HS2 web interface multiple vulnerabilities",
        "overview": "HomeSeer HS2 home automation software web interface contains multiple vulnerabilities.",
        "description": "According to HomeSeer's website, \"HomeSeer HS2 is an advanced home automation and remote access software package that is designed to integrate the major systems of any home\". The HomeSeer HS2 home automation software webserver contains multiple vulnerabilities. HomeSeer HS2 2.5.0.20, and possibly prior versions, includes a web interface which contains a directory traversal vulnerability which could allow an attacker to access files outside of the web directory. In addition the HomeSeer HS2 web interface is vulnerable to a stored and reflective cross site scripting (XSS) vulnerability. An attacker can request a web page such as http://ipaddress/example<script>alert(document.cookie)</script>, causing the JavaScript to be stored in the log viewer page. The next time an administrator or user within the web application views the logfile (http://ipaddress/elog), the JavaScript will be executed in their browser session. The HomeSeer HS2 web interface is also vulnerable to cross-site request forgery (CSRF) attacks with within the /ctrl URL. A successful CSRF attack against an admin user will allow a remote attacker to run commands as the admin user, including remotely launching known executable files on the system.",
        "impact": "An attacker with access to the HomeSeer HS2 web interface can conduct a cross site scripting attack, which could be used to result in information leakage, privilege escalation, and/or denial of service. In addition an attacker with network access to the HomeSeer HS2 web server may also be able to run system commands, inject arbitrary data, or download arbitrary files."
      }
    ],
    "CVE-2011-4836": [
      {
        "url": "http://www.kb.cert.org/vuls/id/796883",
        "title": "HomeSeer HS2 web interface multiple vulnerabilities",
        "overview": "HomeSeer HS2 home automation software web interface contains multiple vulnerabilities.",
        "description": "According to HomeSeer's website, \"HomeSeer HS2 is an advanced home automation and remote access software package that is designed to integrate the major systems of any home\". The HomeSeer HS2 home automation software webserver contains multiple vulnerabilities. HomeSeer HS2 2.5.0.20, and possibly prior versions, includes a web interface which contains a directory traversal vulnerability which could allow an attacker to access files outside of the web directory. In addition the HomeSeer HS2 web interface is vulnerable to a stored and reflective cross site scripting (XSS) vulnerability. An attacker can request a web page such as http://ipaddress/example<script>alert(document.cookie)</script>, causing the JavaScript to be stored in the log viewer page. The next time an administrator or user within the web application views the logfile (http://ipaddress/elog), the JavaScript will be executed in their browser session. The HomeSeer HS2 web interface is also vulnerable to cross-site request forgery (CSRF) attacks with within the /ctrl URL. A successful CSRF attack against an admin user will allow a remote attacker to run commands as the admin user, including remotely launching known executable files on the system.",
        "impact": "An attacker with access to the HomeSeer HS2 web interface can conduct a cross site scripting attack, which could be used to result in information leakage, privilege escalation, and/or denial of service. In addition an attacker with network access to the HomeSeer HS2 web server may also be able to run system commands, inject arbitrary data, or download arbitrary files."
      }
    ],
    "CVE-2011-4837": [
      {
        "url": "http://www.kb.cert.org/vuls/id/796883",
        "title": "HomeSeer HS2 web interface multiple vulnerabilities",
        "overview": "HomeSeer HS2 home automation software web interface contains multiple vulnerabilities.",
        "description": "According to HomeSeer's website, \"HomeSeer HS2 is an advanced home automation and remote access software package that is designed to integrate the major systems of any home\". The HomeSeer HS2 home automation software webserver contains multiple vulnerabilities. HomeSeer HS2 2.5.0.20, and possibly prior versions, includes a web interface which contains a directory traversal vulnerability which could allow an attacker to access files outside of the web directory. In addition the HomeSeer HS2 web interface is vulnerable to a stored and reflective cross site scripting (XSS) vulnerability. An attacker can request a web page such as http://ipaddress/example<script>alert(document.cookie)</script>, causing the JavaScript to be stored in the log viewer page. The next time an administrator or user within the web application views the logfile (http://ipaddress/elog), the JavaScript will be executed in their browser session. The HomeSeer HS2 web interface is also vulnerable to cross-site request forgery (CSRF) attacks with within the /ctrl URL. A successful CSRF attack against an admin user will allow a remote attacker to run commands as the admin user, including remotely launching known executable files on the system.",
        "impact": "An attacker with access to the HomeSeer HS2 web interface can conduct a cross site scripting attack, which could be used to result in information leakage, privilege escalation, and/or denial of service. In addition an attacker with network access to the HomeSeer HS2 web server may also be able to run system commands, inject arbitrary data, or download arbitrary files."
      }
    ],
    "CVE-2011-4858": [
      {
        "url": "http://www.kb.cert.org/vuls/id/903934",
        "title": "Hash table implementations vulnerable to algorithmic complexity attacks",
        "overview": "Some programming language implementations do not sufficiently randomize their hash functions or provide means to limit key collision attacks, which can be leveraged by an unauthenticated attacker to cause a denial-of-service (DoS) condition.",
        "description": "Many applications, including common web framework implementations, use hash tables to map key values to associated entries. If the hash table contains entries for different keys that map to the same hash value, a hash collision occurs and additional processing is required to determine which entry is appropriate for the key. If an attacker can generate many requests containing colliding key values, an application performing the hash table lookup may enter a denial of service condition.Hash collision denial-of-service attacks were first detailed in 2003, but recent research details how these attacks apply to modern language hash table implementations.",
        "impact": "An application can be forced into a denial-of-service condition. In the case of some web application servers, specially-crafted POST form data may result in a denial-of-service."
      }
    ],
    "CVE-2011-4869": [
      {
        "url": "http://www.kb.cert.org/vuls/id/209659",
        "title": "Unbound multiple denial-of-service vulnerabilities",
        "overview": "A specially crafted DNS query containing signed duplicate resource records or a malformed NSEC3 signed resource record may cause Unbound to crash.",
        "description": "NLnetLabs advisory states:== Description 1: crash on signed duplicate Resource RecordsThere are authoritative servers that erroneously send duplicated redirection Resource Records. Unbound has had a workaround that deals with this problem since version 1.0.1 whereby it ignores the duplicate answers. At the time, likely, no DNSSEC signed versions of such zones existed and only recently such misbehaving authority servers also started serving signed duplicate RRs causing improper memory allocation in a portion of the workaround code.Referencing this improper allocated data causes a crash which can look like 'uninitialised lock', segmentation faults or free() errors as it tries to free memory that was never allocated.== Description 2: crash on missing NSEC3 Resource Records.If an authority server sends a reply for an NSEC3-signed zone, and Unbound is configured to validate that zone, then a malformed response can trigger an assertion failure: when an authority server sends a response that contains RR types that trigger special processing and where part of the non-existence proof is missing then an assertion failure is triggered in unbound. This response case was observed in the wild on authority servers that host zones at different points in the hierarchy at the same time.The code crashes at assertion failure validator/val_nsec3.c:1214: nsec3_do_prove_nodata: assertion ce.nc_rrset failed Or, if assertions are not compiled it, it crashes soon after as it attempts to access an expected NSEC3 RR.Additional details can be found in the full NLnetLabs Unbound advisory.",
        "impact": "A remote, unauthenticated attacker could cause the Unbound daemon to crash creating a denial-of-service condition."
      }
    ],
    "CVE-2011-4872": [
      {
        "url": "http://www.kb.cert.org/vuls/id/763355",
        "title": "802.1X password exploit on many HTC Android devices",
        "overview": "A user's 802.1X WiFi credentials and SSID information may be exposed to any application with basic WiFi permissions on certain HTC builds of Android.",
        "description": "Any Android application on an affected HTC build with the android.permission.ACCESS_WIFI_STATE permission can use the .toString() member of the WifiConfiguration class to view all 802.1X credentials and SSID information. If the same application also has the android.permission.INTERNET permission then that application can harvest the credentials and exfiltrate them to a server on the Internet. The following devices have been reported as affected:Desire HD (both \"ace\" and \"spade\" board revisions) - Versions FRG83D, GRI40Glacier - Version FRG83Droid Incredible - Version FRF91Thunderbolt 4G - Version FRG83DSensation Z710e - Version GRI40Sensation 4G - Version GRI40Desire S - Version GRI40EVO 3D - Version GRI40EVO 4G - Version GRI40The following devices have been reported as not affected:myTouch3gNexus OneAdditional details can be found in Bret Jordan's blog post.",
        "impact": "An attacker may be able to view and exfiltrate WiFi SSID information and credentials."
      }
    ],
    "CVE-2011-4885": [
      {
        "url": "http://www.kb.cert.org/vuls/id/903934",
        "title": "Hash table implementations vulnerable to algorithmic complexity attacks",
        "overview": "Some programming language implementations do not sufficiently randomize their hash functions or provide means to limit key collision attacks, which can be leveraged by an unauthenticated attacker to cause a denial-of-service (DoS) condition.",
        "description": "Many applications, including common web framework implementations, use hash tables to map key values to associated entries. If the hash table contains entries for different keys that map to the same hash value, a hash collision occurs and additional processing is required to determine which entry is appropriate for the key. If an attacker can generate many requests containing colliding key values, an application performing the hash table lookup may enter a denial of service condition.Hash collision denial-of-service attacks were first detailed in 2003, but recent research details how these attacks apply to modern language hash table implementations.",
        "impact": "An application can be forced into a denial-of-service condition. In the case of some web application servers, specially-crafted POST form data may result in a denial-of-service."
      }
    ],
    "CVE-2011-5034": [
      {
        "url": "http://www.kb.cert.org/vuls/id/903934",
        "title": "Hash table implementations vulnerable to algorithmic complexity attacks",
        "overview": "Some programming language implementations do not sufficiently randomize their hash functions or provide means to limit key collision attacks, which can be leveraged by an unauthenticated attacker to cause a denial-of-service (DoS) condition.",
        "description": "Many applications, including common web framework implementations, use hash tables to map key values to associated entries. If the hash table contains entries for different keys that map to the same hash value, a hash collision occurs and additional processing is required to determine which entry is appropriate for the key. If an attacker can generate many requests containing colliding key values, an application performing the hash table lookup may enter a denial of service condition.Hash collision denial-of-service attacks were first detailed in 2003, but recent research details how these attacks apply to modern language hash table implementations.",
        "impact": "An application can be forced into a denial-of-service condition. In the case of some web application servers, specially-crafted POST form data may result in a denial-of-service."
      }
    ],
    "CVE-2011-5035": [
      {
        "url": "http://www.kb.cert.org/vuls/id/903934",
        "title": "Hash table implementations vulnerable to algorithmic complexity attacks",
        "overview": "Some programming language implementations do not sufficiently randomize their hash functions or provide means to limit key collision attacks, which can be leveraged by an unauthenticated attacker to cause a denial-of-service (DoS) condition.",
        "description": "Many applications, including common web framework implementations, use hash tables to map key values to associated entries. If the hash table contains entries for different keys that map to the same hash value, a hash collision occurs and additional processing is required to determine which entry is appropriate for the key. If an attacker can generate many requests containing colliding key values, an application performing the hash table lookup may enter a denial of service condition.Hash collision denial-of-service attacks were first detailed in 2003, but recent research details how these attacks apply to modern language hash table implementations.",
        "impact": "An application can be forced into a denial-of-service condition. In the case of some web application servers, specially-crafted POST form data may result in a denial-of-service."
      }
    ],
    "CVE-2011-5036": [
      {
        "url": "http://www.kb.cert.org/vuls/id/903934",
        "title": "Hash table implementations vulnerable to algorithmic complexity attacks",
        "overview": "Some programming language implementations do not sufficiently randomize their hash functions or provide means to limit key collision attacks, which can be leveraged by an unauthenticated attacker to cause a denial-of-service (DoS) condition.",
        "description": "Many applications, including common web framework implementations, use hash tables to map key values to associated entries. If the hash table contains entries for different keys that map to the same hash value, a hash collision occurs and additional processing is required to determine which entry is appropriate for the key. If an attacker can generate many requests containing colliding key values, an application performing the hash table lookup may enter a denial of service condition.Hash collision denial-of-service attacks were first detailed in 2003, but recent research details how these attacks apply to modern language hash table implementations.",
        "impact": "An application can be forced into a denial-of-service condition. In the case of some web application servers, specially-crafted POST form data may result in a denial-of-service."
      }
    ],
    "CVE-2011-5037": [
      {
        "url": "http://www.kb.cert.org/vuls/id/903934",
        "title": "Hash table implementations vulnerable to algorithmic complexity attacks",
        "overview": "Some programming language implementations do not sufficiently randomize their hash functions or provide means to limit key collision attacks, which can be leveraged by an unauthenticated attacker to cause a denial-of-service (DoS) condition.",
        "description": "Many applications, including common web framework implementations, use hash tables to map key values to associated entries. If the hash table contains entries for different keys that map to the same hash value, a hash collision occurs and additional processing is required to determine which entry is appropriate for the key. If an attacker can generate many requests containing colliding key values, an application performing the hash table lookup may enter a denial of service condition.Hash collision denial-of-service attacks were first detailed in 2003, but recent research details how these attacks apply to modern language hash table implementations.",
        "impact": "An application can be forced into a denial-of-service condition. In the case of some web application servers, specially-crafted POST form data may result in a denial-of-service."
      }
    ],
    "CVE-2011-5053": [
      {
        "url": "http://www.kb.cert.org/vuls/id/723755",
        "title": "WiFi Protected Setup (WPS) PIN brute force vulnerability",
        "overview": "The WiFi Protected Setup (WPS) PIN is susceptible to a brute force attack. A design flaw that exists in the WPS specification for the PIN authentication significantly reduces the time required to brute force the entire PIN because it allows an attacker to know when the first half of the 8 digit PIN is correct. The lack of a proper lock out policy after a certain number of failed attempts to guess the PIN on many wireless routers makes this brute force attack that much more feasible.",
        "description": "WiFi Protected Setup (WPS) is a computing standard created by the WiFi Alliance to ease the setup and securing of a wireless home network. WPS contains an authentication method called \"external registrar\" that only requires the router's PIN. By design this method is susceptible to brute force attacks against the PIN. When the PIN authentication fails the access point will send an EAP-NACK message back to the client. The EAP-NACK messages are sent in a way that an attacker is able to determine if the first half of the PIN is correct. Also, the last digit of the PIN is known because it is a checksum for the PIN. This design greatly reduces the number of attempts needed to brute force the PIN. The number of attempts goes from 10^8 to 10^4 + 10^3 which is 11,000 attempts in total.It has been reported that many wireless routers do not implement any kind of lock out policy for brute force attempts. This greatly reduces the time required to perform a successful brute force attack. It has also been reported that some wireless routers resulted in a denial-of-service condition because of the brute force attempt and required a reboot.",
        "impact": "An attacker within range of the wireless access point may be able to brute force the WPS PIN and retrieve the password for the wireless network, change the configuration of the access point, or cause a denial of service."
      }
    ],
    "CVE-2011-5067": [
      {
        "url": "http://www.kb.cert.org/vuls/id/576355",
        "title": "Support Incident Tracker multiple vulnerabilities",
        "overview": "Support Incident Tracker (or SiT!) version 3.65, and possibly earlier versions, contain multiple vulnerabilities including; malicious file uploads, SQL injection, cross-site scripting, and cross-site request forgery.",
        "description": "According to the SiT! website:\"Support Incident Tracker (or SiT!) is a Free Software/Open Source (GPL) web based application which uses PHP and MySQL for tracking technical support calls/emails (also commonly known as a 'Help Desk' or 'Support Ticket System').\"SiT! is susceptible to multiple attacks, including; malicious file uploads, SQL injection, cross-site scripting, and cross-site request forgery.CWE-434: Unrestricted Upload of File with Dangerous TypeThe incident_attachments.php script does not filter the attachment's extension properly. An attacker may upload any file to the web server and have it run with the privileges of the web service. This vulnerability could be used to upload a PHP shell which may be used as a backdoor. The upload file path is structured in the following way: /attachments-{hash}/{incident ID}/{file ID}-{file name}.{extension}. An attacker would need user access to the website, as well as, brute forcing the attachments folder path. An attacker has two options to retrieve the folder path. The attacker could brute force the default attachments folder name because of a weak generation algorithm or the attacker could use the move_uploaded_file.php script to generate an error message that will include the folder path.The ftp_upload_file.php script is also vulnerable. An attacker may be able to upload any file to the web server and have it run with the privileges of the web service if they can guess the folder path.CWE-89: Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection')The incident_attachments.php script is vulnerable to SQL injection. The attachment file name is not properly sanitized. An attacker may exploit this flaw to execute queries against the database.CWE-79: Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting')The incident_attachments.php script is vulnerable to XSS. An attacker may be able to upload a filename that includes arbitrary script which will be run on the incident attachments web page.The link_add.php script is vulnerable to XSS. An attacker may be able to inject arbitrary script into the link creation page.The translate.php script is vulnerable to XSS. An attacker may inject arbitrary script into a saved translation web page which is then execute with the permissions of the web service.CWE-352: Cross-Site Request Forgery (CSRF)The reporter states that most of the SiT! scripts are vulnerable to CSRF attacks. For example, an attacker may be able to trick a logged in user to visit the following URL to delete a user account: /user_delete.php?userid=6. It has been reported that all web pages except config.php, edit_user_permissions.php, forgotpwd.php, user_add.php and user_profile_edit.php are vulnerable.",
        "impact": "An attacker may be able to inject arbitrary script, execute commands as a logged in user, or upload malicious files to the web server."
      }
    ],
    "CVE-2011-5068": [
      {
        "url": "http://www.kb.cert.org/vuls/id/576355",
        "title": "Support Incident Tracker multiple vulnerabilities",
        "overview": "Support Incident Tracker (or SiT!) version 3.65, and possibly earlier versions, contain multiple vulnerabilities including; malicious file uploads, SQL injection, cross-site scripting, and cross-site request forgery.",
        "description": "According to the SiT! website:\"Support Incident Tracker (or SiT!) is a Free Software/Open Source (GPL) web based application which uses PHP and MySQL for tracking technical support calls/emails (also commonly known as a 'Help Desk' or 'Support Ticket System').\"SiT! is susceptible to multiple attacks, including; malicious file uploads, SQL injection, cross-site scripting, and cross-site request forgery.CWE-434: Unrestricted Upload of File with Dangerous TypeThe incident_attachments.php script does not filter the attachment's extension properly. An attacker may upload any file to the web server and have it run with the privileges of the web service. This vulnerability could be used to upload a PHP shell which may be used as a backdoor. The upload file path is structured in the following way: /attachments-{hash}/{incident ID}/{file ID}-{file name}.{extension}. An attacker would need user access to the website, as well as, brute forcing the attachments folder path. An attacker has two options to retrieve the folder path. The attacker could brute force the default attachments folder name because of a weak generation algorithm or the attacker could use the move_uploaded_file.php script to generate an error message that will include the folder path.The ftp_upload_file.php script is also vulnerable. An attacker may be able to upload any file to the web server and have it run with the privileges of the web service if they can guess the folder path.CWE-89: Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection')The incident_attachments.php script is vulnerable to SQL injection. The attachment file name is not properly sanitized. An attacker may exploit this flaw to execute queries against the database.CWE-79: Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting')The incident_attachments.php script is vulnerable to XSS. An attacker may be able to upload a filename that includes arbitrary script which will be run on the incident attachments web page.The link_add.php script is vulnerable to XSS. An attacker may be able to inject arbitrary script into the link creation page.The translate.php script is vulnerable to XSS. An attacker may inject arbitrary script into a saved translation web page which is then execute with the permissions of the web service.CWE-352: Cross-Site Request Forgery (CSRF)The reporter states that most of the SiT! scripts are vulnerable to CSRF attacks. For example, an attacker may be able to trick a logged in user to visit the following URL to delete a user account: /user_delete.php?userid=6. It has been reported that all web pages except config.php, edit_user_permissions.php, forgotpwd.php, user_add.php and user_profile_edit.php are vulnerable.",
        "impact": "An attacker may be able to inject arbitrary script, execute commands as a logged in user, or upload malicious files to the web server."
      }
    ],
    "CVE-2011-5070": [
      {
        "url": "http://www.kb.cert.org/vuls/id/576355",
        "title": "Support Incident Tracker multiple vulnerabilities",
        "overview": "Support Incident Tracker (or SiT!) version 3.65, and possibly earlier versions, contain multiple vulnerabilities including; malicious file uploads, SQL injection, cross-site scripting, and cross-site request forgery.",
        "description": "According to the SiT! website:\"Support Incident Tracker (or SiT!) is a Free Software/Open Source (GPL) web based application which uses PHP and MySQL for tracking technical support calls/emails (also commonly known as a 'Help Desk' or 'Support Ticket System').\"SiT! is susceptible to multiple attacks, including; malicious file uploads, SQL injection, cross-site scripting, and cross-site request forgery.CWE-434: Unrestricted Upload of File with Dangerous TypeThe incident_attachments.php script does not filter the attachment's extension properly. An attacker may upload any file to the web server and have it run with the privileges of the web service. This vulnerability could be used to upload a PHP shell which may be used as a backdoor. The upload file path is structured in the following way: /attachments-{hash}/{incident ID}/{file ID}-{file name}.{extension}. An attacker would need user access to the website, as well as, brute forcing the attachments folder path. An attacker has two options to retrieve the folder path. The attacker could brute force the default attachments folder name because of a weak generation algorithm or the attacker could use the move_uploaded_file.php script to generate an error message that will include the folder path.The ftp_upload_file.php script is also vulnerable. An attacker may be able to upload any file to the web server and have it run with the privileges of the web service if they can guess the folder path.CWE-89: Improper Neutralization of Special Elements used in an SQL Command ('SQL Injection')The incident_attachments.php script is vulnerable to SQL injection. The attachment file name is not properly sanitized. An attacker may exploit this flaw to execute queries against the database.CWE-79: Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting')The incident_attachments.php script is vulnerable to XSS. An attacker may be able to upload a filename that includes arbitrary script which will be run on the incident attachments web page.The link_add.php script is vulnerable to XSS. An attacker may be able to inject arbitrary script into the link creation page.The translate.php script is vulnerable to XSS. An attacker may inject arbitrary script into a saved translation web page which is then execute with the permissions of the web service.CWE-352: Cross-Site Request Forgery (CSRF)The reporter states that most of the SiT! scripts are vulnerable to CSRF attacks. For example, an attacker may be able to trick a logged in user to visit the following URL to delete a user account: /user_delete.php?userid=6. It has been reported that all web pages except config.php, edit_user_permissions.php, forgotpwd.php, user_add.php and user_profile_edit.php are vulnerable.",
        "impact": "An attacker may be able to inject arbitrary script, execute commands as a logged in user, or upload malicious files to the web server."
      }
    ],
    "CVE-2011-5171": [
      {
        "url": "http://www.kb.cert.org/vuls/id/158003",
        "title": "Power2Go buffer overflow vulnerability",
        "overview": "Power2Go 8 contains a buffer overflow in the handling of project (.p2g) files, which can allow a remote, unauthenticated attacker to execute arbitrary code on a vulnerable system.",
        "description": "According to CyberLink's website, \"Power2Go 8 features all the tools you need to easily copy all your media to any disc. Now you can mount disc images as virtual drives, rip, copy and edit your music and experience the ultimate in convenience with drag and drop burning.\" Power2Go 8, and possibly prior versions, fails to perform adequate boundary checks on user-supplied input when parsing malformed project (.p2g) files causing a stack-based buffer overflow leading to possible remote code execution.The reporter has also stated that the WaveEditor component of Power2Go 8 contains the same vulnerability when parsing WaveEditor project files (.wve).",
        "impact": "By causing the Power2Go 8 application to parse a specially-crafted project (.p2g) file, a remote, unauthenticated attacker may be able to execute arbitrary code with the privileges of the user using the application."
      }
    ]
  }
}