{
  "year": 2007,
  "total": 349,
  "reference": "exchange.xforce.ibmcloud.com",
  "reports": {
    "CVE-2007-0005": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32880",
        "title": "Linux kernel Omnikey CardMan 4040 drivers buffer overflow",
        "body": "Linux kernel is vulnerable to a buffer overflow, caused by improper bounds checking by the cm4040_read() and cm4040_write() Omnikey CardMan 4040 functions. By sending a large amount of data, a local attacker could overflow a buffer and execute arbitrary code on the system with root privileges or cause the server to crash.Upgrade to the latest version of Linux kernel (2.6.21-rc3 or later), available from The Linux Kernel Archives Web site. See References.For Red Hat Linux (kernel):Refer to RHSA-2007:0099 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (kernel):Refer to MDKSA-2007:078 for patch, upgrade, or suggested workaround information. See References.For Debian Linux (kernel):Refer to DSA-1286-1 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux (linux-source):Refer to USN-489-1 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-0008": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32666",
        "title": "Mozilla Network Security Services (NSS) Master Secret buffer overflow",
        "body": "Multiple products using the Mozilla Network Security Services (NSS) library are vulnerable to a heap-based buffer overflow, caused by improper bounds checking by the SSLv2 service. By sending a specially-crafted SSLv2 certificate with a small public key for the Master Secret, a remote attacker could overflow a buffer and execute arbitrary code on the system.Refer to MFSA 2007-06 for upgrade or suggested workaround information. See References.For Red Hat Linux (Thunderbird):Refer to RHSA-2007:0078-2 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (Firefox):Refer to RHSA-2007:0079-2 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (Firefox RHEL server and client):Refer to RHSA-2007:0097-5 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (SeaMonkey):Refer to RHSA-2007:0077-4 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-431-1 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-428-2 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux:Refer to Gentoo Linux Security Announcement GLSA 200703-18 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux:Refer to GLSA 200703-22 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (Thunderbird):Refer to MDKSA-2007:052 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (Firefox):Refer to MDKSA-2007:050 for patch, upgrade, or suggested workaround information. See References.For Solaris (NSS):Refer to Sun Alert ID: 102856 for patch, upgrade, or suggested workaround information. See References.For Solaris (Sun Java System Application Server, Web Server, and Web Proxy Server):Refer to Sun Alert ID: 102945 for patch, upgrade, or suggested workaround information. See References.For SUSE Linux (Firefox):Refer to SUSE-SA:2007:019 for patch, upgrade, or suggested workaround information. See References.For SUSE Linux (Mozilla):Refer to SUSE-SA:2007:022 for patch, upgrade, or suggested workaround information. See References.For Debian Linux (mozilla-firefox):Refer to DSA-1336-1 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-0009": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32663",
        "title": "Mozilla Network Security Services (NSS) Client Master Key buffer overflow",
        "body": "Multiple products using the Mozilla Network Security Services (NSS) library are vulnerable to a stack-based buffer overflow, caused by improper bounds checking by the SSLv2 service. By sending a specially-crafted SSLv2 certificate with a small Client Master Key, a remote attacker could overflow a buffer and execute arbitrary code on the system.Refer to MFSA 2007-06 for upgrade or suggested workaround information. See References.For Red Hat Linux (Thunderbird):Refer to RHSA-2007:0078-2 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (Firefox):Refer to RHSA-2007:0079-2 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (Firefox RHEL server and client):Refer to RHSA-2007:0097-5 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (SeaMonkey):Refer to RHSA-2007:0077-4 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-431-1 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-428-2 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux:Refer to Gentoo Linux Security Announcement GLSA 200703-18 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux:Refer to GLSA 200703-22 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (Thunderbird):Refer to MDKSA-2007:052 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (Firefox):Refer to MDKSA-2007:050 for patch, upgrade, or suggested workaround information. See References.For Solaris (NSS):Refer to Sun Alert ID: 102856 for patch, upgrade, or suggested workaround information. See References.For Solaris (Sun Java System Application Server, Web Server, and Web Proxy Server):Refer to Sun Alert ID: 102945 for patch, upgrade, or suggested workaround information. See References.For SUSE Linux (Firefox):Refer to SUSE-SA:2007:019 for patch, upgrade, or suggested workaround information. See References.For SUSE Linux (Mozilla):Refer to SUSE-SA:2007:022 for patch, upgrade, or suggested workaround information. See References.For Debian Linux (mozilla-firefox):Refer to DSA-1336-1 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-0011": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/35510",
        "title": "Citrix Access Gateway Advanced Edition unspecified information disclosure",
        "body": "Citrix Access Gateway Advanced Edition could allow a remote attacker to obtain sensitive information. An attacker could exploit this vulnerability using unspecified parameters to obtain sensitive information and possibly hijack a victim's session.Refer to CTX113814 for patch, upgrade, or suggested workaround information. See References."
      }
    ],
    "CVE-2007-0012": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/39549",
        "title": "Sun Java JRE jpiexp32.dll denial of service",
        "body": "Sun Java JRE is vulnerable to a denial of service, caused by a null pointer exception in jpiexp32.dll. By persuading a victim to visit a Web site with a specially-crafted Java applet containing an undefined name attribute in the object tag data parameter, an attacker could crash the application.Upgrade to the latest version of Sun JRE (5.0 update 14 or later), available from the Sun Microsystems Web site. See References."
      }
    ],
    "CVE-2007-0018": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31707",
        "title": "Multiple vendor NCTAudioFile2 ActiveX control buffer overflow",
        "body": "Multiple vendor products that use the NCTAudioFile2 ActiveX control are vulnerable to a stack-based buffer overflow, caused by improper bounds checking by the SetFormatLikeSample() method. By persuading a victim to visit a malicious Web page that passes an overly long string to the SetFormatLikeSample() method, a remote attacker could overflow a buffer and execute arbitrary code on the system or cause the victim's browser to crash.Upgrade to the latest version of Sienzo Digital Music Mentor (2.6.0.4 or later), available from the Sienzo Digital Music Mentor Web site. See References.For other distributions:Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2007-0038": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33301",
        "title": "Microsoft Windows animated cursor (ANI) buffer overflow",
        "body": "Microsoft Windows is vulnerable to a stack-based buffer overflow, caused by improper bounds checking of animated cursor (ANI) files by the USER32.DLL file. By persuading a victim to open a specially-crafted animated cursor (ANI) file, a remote attacker could overflow a buffer to corrupt system memory and execute arbitrary code on the system with the privileges of the victim. An attacker could exploit this vulnerability by hosting the malicious file on a Web site or sending it to a victim as an email attachment.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS07-017. See References."
      }
    ],
    "CVE-2007-0039": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33888",
        "title": "Microsoft Exchange iCal MODPROPS denial of service",
        "body": "Microsoft Exchange is vulnerable to a denial of service attack, caused by an error in the CDOEX functionality. A remote attacker could send an email containing a specially-crafted iCal file to cause the email service to stop responding.Apply the appropriate patch for your system, as listed in the latest Microsoft Security Bulletin. See References.— OR —Use Microsoft Automatic Update if it is supported by your operating system. The original bulletin issued by Microsoft has been superseded."
      }
    ],
    "CVE-2007-0041": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34637",
        "title": "Microsoft .NET Framework PE Loader service buffer overflow",
        "body": "The Microsoft .NET Framework is vulnerable to a buffer overflow in the PE Loader service. By persuading a victim to visit a specially-crafted Web site or execute a malicious .NET application locally, a remote attacker could overflow a buffer and execute arbitrary code on the system with the privileges of the victim.Apply the appropriate patch for your system, as listed in the latest Microsoft Security Bulletin. See References.— OR —Use Microsoft Automatic Update if it is supported by your operating system. The original bulletin issued by Microsoft has been superseded."
      }
    ],
    "CVE-2007-0043": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34639",
        "title": "Microsoft .NET Framework JIT Compiler service buffer overflow",
        "body": "The Microsoft .NET Framework is vulnerable to a buffer overflow in the JIT Compiler service. By persuading a victim to visit a specially-crafted Web site or execute a malicious .NET application locally, a remote attacker could overflow a buffer and execute arbitrary code on the system with the privileges of the victim.Apply the appropriate patch for your system, as listed in the latest Microsoft Security Bulletin. See References.— OR —Use Microsoft Automatic Update if it is supported by your operating system. The original bulletin issued by Microsoft has been superseded."
      }
    ],
    "CVE-2007-0044": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31266",
        "title": "Adobe Acrobat Reader Plugin PDF cross-site request forgery",
        "body": "The Adobe Acrobat Reader Plugin is vulnerable to a cross-site request forgery, caused by improper validation of input passed to PDF documents. A remote attacker could exploit this vulnerability using the FDF, XML, or XFDF parameter in a specially-crafted URL to perform cross-site scripting attacks, Web cache poisoning, and other malicious activities, if the attacker could persuade the victim to click the URL. In certain Adobe versions and browser settings, this vulnerability could allow remote code execution.Upgrade to the latest version of the Adobe Acrobat Reader Plugin (8.0.0 or later), available from the Adobe Acrobat Reader Plugin Web site. See References.For SUSE Linux (Acrobat Reader):Refer to SUSE-SA:2007:011 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-0045": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31271",
        "title": "Adobe Acrobat Reader Plugin PDF file cross-site scripting and code execution",
        "body": "The Adobe Acrobat Reader Plugin is vulnerable to cross-site scripting, caused by improper validation of input passed to PDF documents. A remote attacker could exploit this vulnerability using the FDF, XML, or XFDF parameter in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal or corrupt the victim's cookie-based authentication credentials or possibly obtain other sensitive information. Note: This vulnerability only affects users running the Firefox browser. In Adobe versions prior to 6, this vulnerability could allow remote code execution.Upgrade to the latest version of the Adobe Acrobat Reader Plugin (8.0.0 or later), available from the Adobe Acrobat Reader Plugin Web site. See References.For Sun Solaris:Refer to Sun Alert ID: 102847 for patch, upgrade, or suggested workaround information. See References.For SUSE Linux (Acrobat Reader):Refer to SUSE-SA:2007:011 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (Acrobat Reader):Refer to RHSA-2007:0017 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (Acrobat Reader):Refer to RHSA-2007:0021 for patch, upgrade, or suggested workaround information. See References.For Debian Linux (mozilla-firefox):Refer to DSA-1336-1 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-0061": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33101",
        "title": "Multiple VMware products DHCP server malformed packet code execution",
        "body": "VMware Player, Workstation, Server, and ACE could allow a remote attacker to execute arbitrary code on the system, caused by improper handling of malformed packets by the built-in Dynamic Host Configuration Protocol (DHCP) server. An attacker could exploit this vulnerability by sending a malformed packet to the DHCP server to corrupt stack memory and execute arbitrary code on the system.For VMware Workstation 6.0.0:Upgrade to the latest version of VMware Workstation (6.0.1 Build 55017 or later), available from the VMware Web site. See References.For VMware Workstation 5.5.4:Upgrade to the latest version of VMware Workstation (5.5.5 Build 56455 or later), available from the VMware Web site. See References.For VMware Player 2.0.0:Upgrade to the latest version of VMware Player (2.0.1 Build 55017 or later), available from the VMware Web site. See References.For VMware Player 1.0.4:Upgrade to the latest version of VMware Player (1.0.5 Build 56455 or later), available from the VMware Web site. See References.For VMware Server 1.0.3:Upgrade to the latest version of VMware Server (1.0.4 Build 56528 or later), available from the VMware Web site. See References.For VMware ACE 2.0.0:Upgrade to the latest version of VMware ACE (2.0.1 Build 55017 or later), available from the VMware Web site. See References.For VMware ACE 1.0.3:Upgrade to the latest version of VMware ACE (1.0.4 Build 54075 or later), available from the VMware Web site. See References.For other distributions:Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2007-0062": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33102",
        "title": "Multiple VMware products VMware DHCP server integer overflow",
        "body": "VMware Player, Workstation, Server, and ACE are vulnerable to a stack-based buffer overflow in the built-in Dynamic Host Configuration Protocol (DHCP) server caused by an integer overflow. By sending a malformed DHCP packet, a remote attacker could overflow a buffer and execute arbitrary code on the system with elevated privileges.For VMware Workstation 6.0.0:Upgrade to the latest version of VMware Workstation (6.0.1 Build 55017 or later), available from the VMware Web site. See References.For VMware Workstation 5.5.4:Upgrade to the latest version of VMware Workstation (5.5.5 Build 56455 or later), available from the VMware Web site. See References.For VMware Player 2.0.0:Upgrade to the latest version of VMware Player (2.0.1 Build 55017 or later), available from the VMware Web site. See References.For VMware Player 1.0.4:Upgrade to the latest version of VMware Player (1.0.5 Build 56455 or later), available from the VMware Web site. See References.For VMware Server 1.0.3:Upgrade to the latest version of VMware Server (1.0.4 Build 56528 or later), available from the VMware Web site. See References.For VMware ACE 2.0.0:Upgrade to the latest version of VMware ACE (2.0.1 Build 55017 or later), available from the VMware Web site. See References.For VMware ACE 1.0.3:Upgrade to the latest version of VMware ACE (1.0.4 Build 54075 or later), available from the VMware Web site. See References.For other distributions:Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2007-0071": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/37277",
        "title": "Adobe Flash Player invalid pointer integer overflow",
        "body": "Adobe Flash Player is vulnerable to a buffer overflow, caused by an integer overflow vulnerability in the processing of multimedia files containing a specific tag. By persuading a victim to open a malicious multimedia file, a remote attacker could overflow a buffer and execute arbitrary code on the system.Refer to APSB08-11 for patch, upgrade or suggested workaround information.Update Adobe Flash Player to 9.0.124.0. See References.For Mac OS X:Apply Security Update 2008-003, available from the Apple Web site. See References.For other distributions:Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2007-0072": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/38760",
        "title": "Trend Micro ServerProtect heap buffer overflow 2",
        "body": "Trend Micro ServerProtect is vulnerable to a heap-based buffer overflow. A remote attacker could exploit this vulnerability to overflow a buffer and execute arbitrary code on the system with SYSTEM privileges.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-0073": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/39050",
        "title": "Trend Micro ServerProtect heap buffer overflow 3",
        "body": "Trend Micro ServerProtect is vulnerable to a heap-based buffer overflow. A remote attacker could exploit this vulnerability to overflow a buffer and execute arbitrary code on the system with SYSTEM privileges.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-0074": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/39051",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-0080": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31248",
        "title": "FreeRADIUS SMB_Connect_Server() buffer overflow",
        "body": "FreeRADIUS is vulnerable to a buffer overflow, caused by improper bounds checking by the SMB_Connect_Server() function of the SMB_Handle_Type class. A user with local administrative privileges can update the configuration file to overflow a buffer when the server starts. This can only be exploited by users who have write access to the server configuration files.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-0102": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31364",
        "title": "Multiple Vendor PDF catalog dictionary and Pages attribute code execution",
        "body": "The Adobe PDF specification in Adobe Acrobat Reader, Apple Mac OS X Preview, Apple CoreGraphics and Xpdf could allow a remote attacker to execute arbitrary code or cause a denial of service, caused by a design flaw. An attacker could create a specially-crafted catalog dictionary or Pages attribute in a PDF document to corrupt memory and possibly execute arbitrary code or cause a denial of service, if the attacker could persuade the victim to open the malicious PDF file.Refer to KDE Security Advisory 20070115-1 for patch or upgrade information. See References.For Poppler:Apply patch, upgrade or suggested workaround, available from the CVS Repository. See References.For Ubuntu Linux:Refer to USN-410-1 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (tetex):Refer to Mandriva Security Advisory MDKSA-2007:022 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (xpdf):Refer to Mandriva Security Advisory MDKSA-2007:021 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (poppler):Refer to Mandriva Security Advisory MDKSA-2007:020 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (pdftohtml):Refer to Mandriva Security Advisory MDKSA-2007:019 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (koffice):Refer to Mandriva Security Advisory MDKSA-2007:018 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-410-2 for patch, upgrade, or workaround information. See References.For Apple CoreGraphics:Upgrade to the latest version of Mac OS X (10.4.9 or later) or apply Apple Security Update 2007-003. See References.or other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-0103": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31364",
        "title": "Multiple Vendor PDF catalog dictionary and Pages attribute code execution",
        "body": "The Adobe PDF specification in Adobe Acrobat Reader, Apple Mac OS X Preview, Apple CoreGraphics and Xpdf could allow a remote attacker to execute arbitrary code or cause a denial of service, caused by a design flaw. An attacker could create a specially-crafted catalog dictionary or Pages attribute in a PDF document to corrupt memory and possibly execute arbitrary code or cause a denial of service, if the attacker could persuade the victim to open the malicious PDF file.Refer to KDE Security Advisory 20070115-1 for patch or upgrade information. See References.For Poppler:Apply patch, upgrade or suggested workaround, available from the CVS Repository. See References.For Ubuntu Linux:Refer to USN-410-1 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (tetex):Refer to Mandriva Security Advisory MDKSA-2007:022 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (xpdf):Refer to Mandriva Security Advisory MDKSA-2007:021 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (poppler):Refer to Mandriva Security Advisory MDKSA-2007:020 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (pdftohtml):Refer to Mandriva Security Advisory MDKSA-2007:019 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (koffice):Refer to Mandriva Security Advisory MDKSA-2007:018 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-410-2 for patch, upgrade, or workaround information. See References.For Apple CoreGraphics:Upgrade to the latest version of Mac OS X (10.4.9 or later) or apply Apple Security Update 2007-003. See References.or other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-0104": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31364",
        "title": "Multiple Vendor PDF catalog dictionary and Pages attribute code execution",
        "body": "The Adobe PDF specification in Adobe Acrobat Reader, Apple Mac OS X Preview, Apple CoreGraphics and Xpdf could allow a remote attacker to execute arbitrary code or cause a denial of service, caused by a design flaw. An attacker could create a specially-crafted catalog dictionary or Pages attribute in a PDF document to corrupt memory and possibly execute arbitrary code or cause a denial of service, if the attacker could persuade the victim to open the malicious PDF file.Refer to KDE Security Advisory 20070115-1 for patch or upgrade information. See References.For Poppler:Apply patch, upgrade or suggested workaround, available from the CVS Repository. See References.For Ubuntu Linux:Refer to USN-410-1 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (tetex):Refer to Mandriva Security Advisory MDKSA-2007:022 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (xpdf):Refer to Mandriva Security Advisory MDKSA-2007:021 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (poppler):Refer to Mandriva Security Advisory MDKSA-2007:020 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (pdftohtml):Refer to Mandriva Security Advisory MDKSA-2007:019 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (koffice):Refer to Mandriva Security Advisory MDKSA-2007:018 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-410-2 for patch, upgrade, or workaround information. See References.For Apple CoreGraphics:Upgrade to the latest version of Mac OS X (10.4.9 or later) or apply Apple Security Update 2007-003. See References.or other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-0126": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31305",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-0134": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31301",
        "title": "iG Shop cart.php and page.php code execution",
        "body": "iG Shop could allow a remote attacker to execute arbitrary code on the system, caused by a vulnerability in the cart.php and page.php scripts. A remote attacker could use the action parameter in an eval call to execute arbitrary PHP code on the system.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-0136": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31311",
        "title": "Drupal core unspecified cross-site scripting",
        "body": "Drupal is vulnerable to cross-site scripting, caused by improper validation of user-supplied input. A remote attacker could exploit this vulnerability using unspecified parameters in a specially-crafted URL to execute script in an administrator's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Upgrade to the latest version of Drupal (4.6.11, 4.7.5, or later), available from the Ethereal Web site. See References.For OpenPKG:Refer to OpenPKG Security Advisory OpenPKG-SA-2007.003 for patch, upgrade, or suggested workaround information. See References."
      }
    ],
    "CVE-2007-0160": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31330",
        "title": "CenterICQ username and realname buffer overflow",
        "body": "CenterICQ when used with LiveJournal is vulnerable to a buffer overflow, caused by improper bounds checking by the PERIOD_FRIENDS function. By sending a specially crafted HTTP request containing overly long username and realname values, a remote, authenticated attacker could overflow a buffer and execute arbitrary code on the system or cause the application to crash.Apply the appropriate patch for your system. See References."
      }
    ],
    "CVE-2007-0169": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31443",
        "title": "Computer Associates (CA) BrightStor ARCserve Backup Message Engine RPC buffer overflow",
        "body": "Multiple Computer Associates (CA) BrightStor ARCserve backup products are vulnerable to a buffer overflow, caused by improper bounds checking by the handler functions for RPC opnum 0x2F and 0x75 in the Message Engine service. By sending specially-crafted packets to the RPC interface on a vulnerable system, a remote attacker could overflow a buffer and execute arbitrary code with SYSTEM privileges.Apply the appropriate fix for your system (QO84983, QO84984, QI82917, QO84986, or QO84985), available from the CA SupportConnect Web site. See References."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31433",
        "title": "Computer Associates (CA) BrightStor ARCserve Backup Tape Engine RPC buffer overflow",
        "body": "Multiple Computer Associates (CA) BrightStor ARCserve backup products are vulnerable to a buffer overflow, caused by improper bounds checking by the handler function for RPC opnum 0xCF in the Tape Engine service. By sending specially-crafted packets to the RPC interface on a vulnerable system, a remote attacker could overflow a buffer and execute arbitrary code on the system with SYSTEM privileges.Apply the appropriate fix for your system (QO84983, QO84984, QI82917, QO84986, or QO84985), available from the CA SupportConnect Web site. See References."
      }
    ],
    "CVE-2007-0175": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31368",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-0196": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31360",
        "title": "MOTIONBORG Web Real Estate admin_check_user.asp SQL injection",
        "body": "MOTIONBORG Web Real Estate is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the admin_check_user.asp script using multiple parameters, which could allow the attacker to view, add, modify or delete information in the back-end database.Registered customers should contact MOTIONBORG Support for upgrade or patch information. See References."
      }
    ],
    "CVE-2007-0197": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31410",
        "title": "Apple Mac OS X Finder denial of service",
        "body": "Apple Mac OS X is vulnerable to a denial of service, caused by a memory corruption vulnerability in Finder when processing malformed DMG images with an overly long volume name. A remote attacker could exploit this vulnerability to cause a victim's application to crash, if the attacker could convince the victim to open a malicious DMG image file.Refer to Apple Security Update 2007-002 for update information. See Referneces."
      }
    ],
    "CVE-2007-0205": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31397",
        "title": "@lex Guestbook livre_include.php file include",
        "body": "@lex Guestbook could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the livre_include.php script using the lang parameter to specify a malicious file from the local system, which could allow the attacker to obtain sensitive information or execute arbitrary code on the vulnerable Web server. Note: In order to exploit this vulnerability to execute arbitrary code, the attacker would first be required to upload a malicious file or inject arbitrary commands into an existing file.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-0213": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33889",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-0218": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32106",
        "title": "Microsoft Internet Explorer COM object code execution",
        "body": "Microsoft Internet Explorer could allow a remote attacker to execute arbitrary code on the system, caused by a vulnerability regarding the instantiation of certain COM objects as ActiveX controls. By persuading a victim to visit a specially-crafted Web page, a remote attacker could exploit this vulnerability to corrupt memory and execute arbitrary code on the system with the privileges of the victim.Apply the appropriate patch for your system, as listed in the latest Microsoft Security Bulletin. See References.— OR —Use Microsoft Automatic Update if it is supported by your operating system. The original bulletin issued by Microsoft has been superseded."
      }
    ],
    "CVE-2007-0220": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33887",
        "title": "Microsoft Exchange UTF character set cross-site scripting",
        "body": "Microsoft Exchange is vulnerable to cross-site scripting, caused by an improperly marked UTF character set label in Outlook Web Access. A remote attacker could exploit this vulnerability by sending a specially-crafted email with a UTF encoded attachment which would be executed in a victim's Web browser within the security context of the hosting Web site, once the email is viewed. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Apply the appropriate patch for your system, as listed in the latest Microsoft Security Bulletin. See References.— OR —Use Microsoft Automatic Update if it is supported by your operating system. The original bulletin issued by Microsoft has been superseded."
      }
    ],
    "CVE-2007-0221": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33890",
        "title": "Microsoft Exchange IMAP command denial of service",
        "body": "Microsoft Exchange is vulnerable to a denial of service attack, caused by an invalid memory request in the IMAP service. A remote attacker could send a specially-crafted IMAP command to an Exchange Server configured as an IMAP server to cause the email service to stop responding.Apply the appropriate patch for your system, as listed in the latest Microsoft Security Bulletin. See References.— OR —Use Microsoft Automatic Update if it is supported by your operating system. The original bulletin issued by Microsoft has been superseded."
      }
    ],
    "CVE-2007-0229": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31409",
        "title": "Apple Mac OS X ffs_mountfs() buffer overflow",
        "body": "Apple Mac OS X is vulnerable to a heap-based buffer overflow, caused by an integer overflow in the ffs_mountfs() function. By persuading a victim to open a specially-crafted UFS DMG image, an attacker could overflow a buffer and execute arbitrary code on the system or cause the system to crash. Note: The vulnerability is remotely exploitable if the \"open safe files\" option is enabled when using Safari.Upgrade to the latest version of Mac OS X (10.4.9 or later) or apply Apple Security Update 2007-003. See References."
      }
    ],
    "CVE-2007-0230": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31408",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-0235": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31522",
        "title": "libgtop2 glibtop_get_proc_map_s() buffer overflow",
        "body": "The libgtop2 library is vulnerable to a stack-based buffer overflow, caused by improper bounds checking by the glibtop_get_proc_map_s() function. By creating a specially-crafted process with an overly long path name, a local attacker could overflow a buffer and execute arbitrary code on the system with elevated privileges or cause the system to crash, if the attacker could convince a privileged user to run an application using the affected library.Upgrade to the latest version of libgtop2 (2.14.6 or later), available from the GNOME Bugzilla Web site. See References.For Mandriva Linux:Refer to Mandriva Linux Security Advisory MDKSA-2007:023 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-407-1 for patch, upgrade, or suggested workaround information. See References.For Debian GNU/Linux:Refer to DSA-1255-1 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-0238": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33112",
        "title": "OpenOffice.org StarCalc buffer overflow",
        "body": "OpenOffice.org is vulnerable to a stack-based buffer overflow, caused by improper bounds checking by the StarCalc parser. By creating a specially-crafted OpenOffice file, a remote attacker could overflow a buffer and execute arbitrary code on the system or cause the application to crash, if the attacker could persuade the victim to open the malicious file.For Debian GNU/Linux:Refer to DSA-1270 for patch, upgrade, or suggested workaround information. See References.For Sun StarOffice:Refer to Sun Alert ID: 102794 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux:Refer to RHSA-2007:0069 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (openoffice.org):Refer to RHSA-2007:0033-4 for patch, upgrade, or suggested workaround information. See References.For SUSE Linux (OpenOffice_org):Refer to SUSE-SA:2007:023 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-444-1 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux:Refer to MDKSA-2007:073 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (OpenOffice.org):Refer to GLSA 200704-12 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-0243": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31537",
        "title": "Sun Java Runtime Environment GIF image buffer overflow",
        "body": "The Sun Java Runtime Environment (JRE) is vulnerable to a heap-based buffer overflow, caused by improper bounds checking. By creating a specially-crafted Java applet containing a GIF image with an image block width set to zero, a remote attacker could overflow a buffer and execute arbitrary code on the system, if the attacker could persuade the victim to open a malicious Java applet.Refer to Sun Alert ID: 102760 for patch, upgrade, or suggested workaround information. See References.For Hitachi:Refer to HS07-018 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux:Refer to Gentoo Linux Security Announcement GLSA 200702-07 and GLSA 200702-08 for patch, upgrade, or suggested workaround information. See References.For Turbolinux:Refer to TLSA-2007-8 for patch, upgrade, or suggested workaround information. See References.For BEA JRockit:Refer to BEA07-172.00 for patch, upgrade, or suggested workaround information. See References.For other distributions:Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2007-0245": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34843",
        "title": "OpenOffice.org RTF files buffer overflow",
        "body": "OpenOffice.org is vulnerable to a heap-based buffer overflow, caused by improper bounds checking when parsing RTF files. By persuading a victim to open a specially-crafted RTF file, a remote attacker could overflow a buffer and execute arbitrary code on the vulnerable system.Upgrade to the latest version of OpenOffice.org (2.2.1 or later), available from the OpenOffice.org Web site. See References.For Debian GNU/Linux (openoffice.org):Refer to DSA-1307 for patch, upgrade, or suggested workaround information. See References.For Solaris (StarOffice/StarSuite):Refer to Sun Alert ID: 102917 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (OpenOffice.org):Refer to MDKSA-2007:144 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-482-1 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-0247": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31523",
        "title": "Squid ftpListingFinish() and ftpHtmlifyListEntry() denial of service",
        "body": "Squid is vulnerable to a denial of service, caused by multiple errors in the ftpListingFinish() and ftpHtmlifyListEntry() functions. A remote attacker could exploit this vulnerability to cause the proxy to crash by requesting a specially-crafted FTP URL.Upgrade to the latest version of Squid (2.6.STABLE7 or later), available from the Squid Web site. See References.For Turbolinux (Squid):Refer to TLSA-2007-17 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-414-1 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux:Refer to Gentoo Linux Security Announcement GLSA 200701-22 for patch, upgrade, or suggested workaround information. See References.For SUSE Linux (squid):Refer to SUSE-SA:2007:012 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-0270": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31541",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-0272": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31541",
        "title": "Oracle Critical Patch Update - January 2007",
        "body": "Oracle Critical Patch Update - January 2007 contains fixes for multiple security vulnerabilities affecting various Oracle products and components. These vulnerabilities include multiple SQL injection issues and multiple unspecified issues, the most serious of which could be used to gain complete control over an affected system.Refer to Oracle Critical Patch Update - January 2007 for patch, upgrade, or suggested workaround information. See References."
      }
    ],
    "CVE-2007-0275": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31541",
        "title": "Oracle Critical Patch Update - January 2007",
        "body": "Oracle Critical Patch Update - January 2007 contains fixes for multiple security vulnerabilities affecting various Oracle products and components. These vulnerabilities include multiple SQL injection issues and multiple unspecified issues, the most serious of which could be used to gain complete control over an affected system.Refer to Oracle Critical Patch Update - January 2007 for patch, upgrade, or suggested workaround information. See References."
      }
    ],
    "CVE-2007-0315": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31500",
        "title": "FileZilla Options.cpp and QueueCtrl.cpp buffer overflow",
        "body": "FileZilla is vulnerable to multiple buffer overflows in the Options.cpp and QueueCtrl.cpp modules. A remote attacker could exploit these vulnerabilities using unspecified attack vectors to execute arbitrary code on the system or cause the affected application to crash.Upgrade to the latest version of FileZilla (2.2.30a or later), available from the SourceForge.net Web site. See References."
      }
    ],
    "CVE-2007-0320": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32645",
        "title": "Macrovision InstallFromTheWeb ActiveX buffer overflow",
        "body": "The Macrovision (formerly InstallShield) InstallFromTheWeb ActiveX control (iftw.dll) and plug-in for Netscape (npiftw32.dll) are vulnerable to multiple unspecified buffer overflows. By persuading a victim to visit a specially-crafted Web page or open a specially-crafted HTML email, a remote attacker could overflow a buffer and cause the victim's browser to crash or execute arbitrary code on the system with the privileges of the victim.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-0322": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/36462",
        "title": "QuickBooks Online Edition ActiveX control buffer overflow",
        "body": "The QuickBooks Online Edition ActiveX control is vulnerable to multiple stack-based buffer overflows. By persuading a victim to open a specially-crafted Web page, a remote attacker could overflow a buffer and execute arbitrary code on the system with the victim's privileges or cause the browser to crash.Upgrade to the latest version of the QuickBooks Online Edition ActiveX control (10 or later), available from the QuickBooks Online Edition Web site. See References."
      }
    ],
    "CVE-2007-0326": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/36643",
        "title": "PhotoChannel Networks Photo Upload Plugin ActiveX control buffer overflow",
        "body": "The PhotoChannel Networks Photo Upload Plugin ActiveX control is vulnerable to a stack-based buffer overflow. By persuading a victim to visit a specially-crafted Web page, a remote attacker could overflow a buffer and execute arbitrary code on the system with the victim's privileges or cause the browser to crash.Upgrade to the latest version of the Photo Upload Plugin ActiveX control (2.0.0.10 or later), available from the PhotoChannel Web site. See References."
      }
    ],
    "CVE-2007-0348": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33186",
        "title": "Interactual Player and CinePlayer IASystemInfo.dll ActiveX control buffer overflow",
        "body": "Interactual Player and CinePlayer are vulnerable to a stack-based buffer overflow, caused by improper bounds checking by the IASystemInfo.dll ActiveX control. By creating a specially-crafted Web page containing a malicious ApplicationType property, a remote attacker could overflow a buffer and execute arbitrary code on the system, if the attacker could persuade the victim to view the malicious Web page.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-0350": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31533",
        "title": "SmE FileMailer login form SQL injection",
        "body": "SmE FileMailer is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the index.php or the dl.php script using the ps, us, f or code parameters, which could allow the attacker to view, add, modify or delete information in the back-end database.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-0355": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31562",
        "title": "Apple Mac OS X slpd registration request buffer overflow",
        "body": "Apple Mac OS X is vulnerable to a buffer overflow, caused by improper bounds checking by the service location protocol daemon (slpd). By sending a specially-crafted registration request containing an overly long attr-list field, a local attacker could overflow a buffer and execute arbitrary code on the system with root privileges or cause the system to crash.Apply Apple Security Update 2008-001 or upgrade to the latest version of Mac OS X (10.5.2 or later), available from the Apple Web site. See References."
      }
    ],
    "CVE-2007-0364": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31538",
        "title": "INDEXU multiple scripts cross-site scripting",
        "body": "INDEXU is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by multiple scripts. A remote attacker could exploit this vulnerability using various parameters in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Upgrade to the latest version of sNews (1.5.31 or later), available from the OpenSourceSMS Web site. See References."
      }
    ],
    "CVE-2007-0435": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31621",
        "title": "T-Com Speedport login authentication bypass",
        "body": "The T-Com Speedport broadband router could allow a remote attacker from within the local network to bypass authentication. T-Com Speedport uses a hard-coded administrative cookie value to verify passwords. An attacker could exploit this vulnerability using a specially-crafted cookie to bypass authentication and gain unauthorized access to the administrative interface of an affected device.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-0449": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31704",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-0450": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32988",
        "title": "Apache Tomcat proxy module directory traversal",
        "body": "Apache Tomcat when used with Apache HTTP Server could allow a remote attacker to traverse directories on the system. An attacker could send a specially-crafted URL request to the mod_proxy, mod_rewrite, or mod_jk proxy modules containing \"dot dot\" sequences (/../) appended with \"/\", \"\\\", or \"%5C\" characters to view arbitrary files on the system and possibly gain access to the Tomcat Manager Application.Upgrade to the latest version of Apache Tomcat (6.0.10, 5.5.23, or later), available from the Apache Tomcat Web site. See References.For Gentoo Linux:Refer to GLSA 200705-03 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux:Refer to RHSA-2007:0327 for patch, upgrade, or suggested workaround information. See References.For Mac OS:Apply Apple Security Update 2007-007, available from the Apple Web site. See References.For SUSE Linux:Refer to SUSE-SR:2007:015 for patch, upgrade, or suggested workaround information. See References.For other distributions:Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2007-0451": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32536",
        "title": "SpamAssassin URL denial of service",
        "body": "SpamAssassin is vulnerable to a denial of service, caused by the improper handling of messages. By persuading a victim to open a specially-crafted email containing an overly long URL, a remote attacker could consume all available memory resources, resulting in a denial of service.Upgrade to the latest version of SpamAssassin (3.1.8 or later) available from the SpamAssassin: Downloads Web page. See References.For Red Hat Linux (spamassassin):Refer to RHSA-2007:0074-2 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (spamassassin):Refer to GLSA 200703-02 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (spamassassin):Refer to MDKSA-2007:049 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (spamassassin):Refer to RHSA-2007:0075-2 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-0464": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31837",
        "title": "Apple Mac OS X CFNetwork framework denial of service",
        "body": "Apple Mac OS X is vulnerable to a denial of service, caused by a NULL pointer dereference in the CFNetwork's CFNetConnectionWillEnqueueRequests() function. A remote attacker could send a specially-crafted response to cause a denial of service, if the attacker could persuade the victim to connect to a malicious server.Apply Apple Security Update 2007-008 or upgrade to the latest version of Mac OS X (10.4.11 or later), available from the Apple Web site. See References."
      }
    ],
    "CVE-2007-0471": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31646",
        "title": "Check Point Connectra sre/params.php security bypass",
        "body": "Check Point Connectra could allow a remote attacker to bypass security restrictions, caused by improper validation of cookies by the sre/params.php script. By sending a specially-crafted HTTP POST request, a remote attacker could bypass security restrictions and gain unauthorized access to a protected network. Check Point VPN-1 is also affected.Apply the patch for Check Point Connectra R62, available from Check Point Web site. See References."
      }
    ],
    "CVE-2007-0478": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31846",
        "title": "Apple Safari HTML comment cross-site scripting",
        "body": "Apple Safari could allow a remote attacker to bypass cross-site scripting protection and perform cross-site scripting attacks on vulnerable Web applications. Safari fails to properly parse HTML tags within HTML comments. A remote attacker could exploit this vulnerability to execute malicious script within a victim's Web browser within the security context of the targeted site by embedding malicious script within HTML tags in a specially-crafted URL. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.For Mac OS:Apply Apple Security Update 2007-007, available from the Apple Web site. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-0501": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31637",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-0519": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31661",
        "title": "XMB U2U Instant Messenger memcp.php cross-site scripting",
        "body": "The XMB U2U Instant Messenger is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the memcp.php script. An authenticated remote attacker could exploit this vulnerability using instant messenger field to inject malicious script into a Web page which would be executed in a victim's Web browser within the security context of the hosting Web site, once the page is viewed. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Upgrade to the latest version of XMB Forum (1.9.10 or later), available from the XMB Forum Web site. See References."
      }
    ],
    "CVE-2007-0520": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31660",
        "title": "Unique Ads banner.php SQL injection",
        "body": "Unique Ads is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the banner.php script using the bid parameter, which could allow the attacker to view, add, modify or delete information in the back-end database.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-0527": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31692",
        "title": "Website Baker class.login.php SQL injection",
        "body": "Website Baker is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the class.login.php script using the REMEMBER_KEY parameter, which could allow the attacker to view, add, modify or delete information in the back-end database.Apply the appropriate patch for your system, available for registered users from the Website Baker Web Site. See references."
      }
    ],
    "CVE-2007-0582": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31939",
        "title": "chernobiLe Portal default.asp SQL injection",
        "body": "chernobiLe Portal is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the default.asp script using the username or password fields, which could allow the attacker to view, add, modify or delete information in the back-end database.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-0642": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31927",
        "title": "Raymond BERTHOU script collection (RBL) tForum user_confirm.asp SQL injection",
        "body": "Raymond BERTHOU script collection (RBL) tForum is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the user_confirm.asp scripting using the id or pass parameter, which could allow the attacker to view, add, modify or delete information in the back-end database.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-0670": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32184",
        "title": "IBM AIX RDIST buffer overflow",
        "body": "IBM AIX is vulnerable to a buffer overflow, caused by improper bounds checking by the RDIST command in bos.rte.libc. By sending a specially-crafted RDIST command, a local attacker could overflow a buffer and execute arbitrary code on the system with unspecified setuid privileges.Apply the patch for your system, as listed in IBM APAR IY94301. See References."
      }
    ],
    "CVE-2007-0683": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32057",
        "title": "Omegaboard functions.php file include",
        "body": "Omegaboard could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the functions.php script using the phpbb_root_path parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-0695": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/31902",
        "title": "FLIP (Free LAN-Party Inter/Intranet Portal) escape_sqlData and implode_sql SQL injection",
        "body": "FLIP (Free LAN-Party Inter/Intranet Portal) is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the escape_sqlData or implode_sql function using unspecified parameters, which could allow the attacker to view, add, modify or delete information in the back-end database.Upgrade to the latest version of FLIP (1.0rc3 or later), available from the SourceForge.net: Files Web site. See References."
      }
    ],
    "CVE-2007-0699": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32121",
        "title": "Portail Web Php includes.php file include",
        "body": "Portail Web Php could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the includes.php script using the site_path parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-0700": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32115",
        "title": "Portail Web Php index.php file include",
        "body": "Portail Web Php could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the index.php script using the page parameter to specify a malicious file from the local system, which could allow the attacker to obtain sensitive information or execute arbitrary code on the vulnerable Web server. Note: In order to exploit this vulnerability to execute arbitrary code, the attacker would first be required to upload a malicious file or inject arbitrary commands into an existing file.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-0711": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32814",
        "title": "Apple QuickTime 3GP video file integer overflow",
        "body": "Apple QuickTime is vulnerable to an integer overflow, caused by improper handling of malformed 3GP video files. By creating a malicious 3GP video file and persuading a victim to open the file, a remote attacker could cause the victim's QuickTime application to crash or possibly execute arbitrary code on the victim's system with the privileges of the user. An attacker could exploit this vulnerability by sending the malicious file as an email attachment or hosting it on a Web site.Apply the Apple QuickTime 7.1.5 Update, available from the Apple Web site. See References."
      }
    ],
    "CVE-2007-0712": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32816",
        "title": "Apple QuickTime MIDI files buffer overflow",
        "body": "Apple QuickTime is vulnerable to a heap-based buffer overflow, caused by improper handling of malformed MIDI files. By persuading a victim to open a specially-crafted MIDI file, a remote attacker could overflow a buffer and cause the victim's QuickTime application to crash or possibly execute arbitrary code on the victim's system with the privileges of the user. An attacker could exploit this vulnerability by sending the malicious file as an email attachment or hosting it on a Web site.Apply the Apple QuickTime 7.1.5 Update, available from the Apple Web site. See References."
      }
    ],
    "CVE-2007-0714": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32819",
        "title": "Apple QuickTime UDTA atoms integer overflow",
        "body": "Apple QuickTime is vulnerable to an integer overflow, caused by improper handling of malformed UDTA atoms in movie files. By persuading a victim to open a specially-crafted movie file, a remote attacker could cause the victim's QuickTime application to crash or possibly execute arbitrary code on the victim's system with the privileges of the user. An attacker could exploit this vulnerability by sending the malicious file as an email attachment or hosting it on a Web site.Apply the Apple QuickTime 7.1.5 Update, available from the Apple Web site. See References."
      }
    ],
    "CVE-2007-0718": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32826",
        "title": "Apple QuickTime QTIF file buffer overflow",
        "body": "Apple QuickTime is vulnerable to a heap-based buffer overflow, caused by improper handling of malformed QTIF files. By creating a malicious QTIF file containing a specially-crafted Video Sample Description and persuading a victim to open the file, a remote attacker could corrupt memory and cause the victim's QuickTime application to crash or possibly execute arbitrary code on the victim's system with the privileges of the user. An attacker could exploit this vulnerability by sending the malicious file as an email attachment or hosting it on a Web site.Apply the Apple QuickTime 7.1.5 Update, available from the Apple Web site. See References."
      }
    ],
    "CVE-2007-0734": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33527",
        "title": "Apple Airport Extreme AirPort Disk feature information disclosure",
        "body": "Apple Airport Extreme could allow a remote attacker from within the local network to obtain sensitive information. A design error in the AirPort Disk feature of AirPort Extreme Base Stations with 802.11n improperly validates access requests. An attacker could exploit this vulnerability to view filenames on a password-protected disk without providing a password.Upgrade to the latest version of firmware (7.1 or later), available from the Firmware Update 7.1 for AirPort Extreme Base Station with 802.11n. See References."
      }
    ],
    "CVE-2007-0772": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32578",
        "title": "Linux kernel nfsaclsvc_release_getacl() function denial of service",
        "body": "Linux kernel is vulnerable to a denial of service. The nfsaclsvc_release_getacl() function releases an improper pointer when handling NFSACL 2 \"ACCESS\" requests. An attacker could exploit this vulnerability to crash the system, resulting in a denial of service.Upgrade to the latest version of Linux kernel (2.6.18.7 or later), (2.6.19.4 or later), or (2.6.20.1 or later), available from The Linux Kernel Archives Web site. See References.For Mandriva Linux (kernel):Refer to MDKSA-2007:060 for patch, upgrade, or suggested workaround information. See References.For SUSE Linux (kernel):Refer to SUSE-SA:2007:018 for patch, upgrade, or suggested workaround information. See References.For SUSE Linux (kernel):Refer to SUSE-SA:2007:021 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux (linux-source):Refer to USN-451-1 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (kernel):Refer to MDKSA-2007:078 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-0776": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32698",
        "title": "Mozilla Firefox stroke-width buffer overflow",
        "body": "Mozilla Firefox is vulnerable to a heap-based buffer overflow, caused by improper bounds checking by the _cairo_pen_init function. By creating a specially-crafted SVG file with a large stroke-width attribute in the clipPath element, a remote attacker could overflow a buffer and execute arbitrary code on the system, if the attacker could persuade the victim to view the malicious file.Refer to MFSA 2007-01 for upgrade information. See References.For Gentoo Linux:Refer to GLSA 200703-04 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (SeaMonkey):Refer to Gentoo Linux Security Announcement GLSA 200703-08 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-431-1 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-428-2 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux:Refer to Gentoo Linux Security Announcement GLSA 200703-18 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (Thunderbird):Refer to MDKSA-2007:052 for patch, upgrade, or suggested workaround information. See References.For SUSE Linux (Firefox):Refer to SUSE-SA:2007:019 for patch, upgrade, or suggested workaround information. See References.For SUSE Linux (Mozilla):Refer to SUSE-SA:2007:022 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-0777": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32699",
        "title": "Mozilla Firefox, Thunderbird, and SeaMonkey multiple Javascript engine code execution",
        "body": "Mozilla Firefox, Thunderbird, and SeaMonkey could allow a remote attacker to execute arbitrary code on the system, caused by multiple unspecified errors in the JavaScript engine. A remote attacker could exploit this vulnerability to corrupt memory and cause a denial of service or possibly execute arbitrary code on the system, if the attacker could persuade the victim to view a malicious Web page or JavaScript-enabled email message.Refer to MFSA 2007-01 for upgrade information. See References.For Red Hat Linux (Thunderbird):Refer to RHSA-2007:0078-2 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (Firefox):Refer to RHSA-2007:0079-2 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (Firefox RHEL server and client):Refer to RHSA-2007:0097-5 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (SeaMonkey):Refer to RHSA-2007:0077-4 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (SeaMonkey):Refer to Gentoo Linux Security Announcement GLSA 200703-08 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux:Refer to GLSA 200703-04 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (Thunderbird):Refer to Gentoo Linux Security Announcement GLSA 200703-18 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-431-1 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-428-2 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (Thunderbird):Refer to MDKSA-2007:052 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (Firefox):Refer to MDKSA-2007:050 for patch, upgrade, or suggested workaround information. See References.For SUSE Linux (Firefox):Refer to SUSE-SA:2007:019 for patch, upgrade, or suggested workaround information. See References.For SUSE Linux (Mozilla):Refer to SUSE-SA:2007:022 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-0778": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32671",
        "title": "Mozilla Firefox and SeaMonkey disk cache collision information disclosure",
        "body": "Mozilla Firefox and SeaMonkey could allow a remote attacker to obtain sensitive information, caused by a collision error in the disk cache. An attacker could exploit this vulnerability by creating a specially-crafted Web page or HTML email to obtain sensitive information, if the attacker could persuade the victim to log into a targeted service and visit the malicious Web page or open the malicious HTML email message.Refer to MFSA 2007-03 for upgrade or suggested workaround information. See References.For Red Hat Linux (Thunderbird):Refer to RHSA-2007:0078-2 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (Firefox):Refer to RHSA-2007:0079-2 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (Firefox RHEL server and client):Refer to RHSA-2007:0097-5 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (SeaMonkey):Refer to RHSA-2007:0077-4 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (SeaMonkey):Refer to Gentoo Linux Security Announcement GLSA 200703-08 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux:Refer to GLSA 200703-04 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-428-2 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (Firefox):Refer to MDKSA-2007:050 for patch, upgrade, or suggested workaround information. See References.For SUSE Linux (Firefox):Refer to SUSE-SA:2007:019 for patch, upgrade, or suggested workaround information. See References.For SUSE Linux (Mozilla):Refer to SUSE-SA:2007:022 for patch, upgrade, or suggested workaround information. See References.For Debian Linux (mozilla-firefox):Refer to DSA-1336-1 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-0780": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32667",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-0790": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32214",
        "title": "SmartFTP banner buffer overflow",
        "body": "SmartFTP is vulnerable to a heap-based buffer overflow, caused by improper bounds checking of banner replies. By persuading a user to connect to a malicious FTP server that sends an overly long banner reply, a remote attacker could overflow a buffer and execute arbitrary code on the system.Upgrade to the latest version of SmartFTP (2.5.1005 or later), available from the SmartFTP Web site. See References."
      }
    ],
    "CVE-2007-0830": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32268",
        "title": "VBulletin Admin Control Panel index.php cross-site scripting",
        "body": "VBulletin Admin Control Panel is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the index.php script. An authenticated remote attacker could exploit this vulnerability using the User Group Manager, User Rank Manager, User Title Manager, BB Code Manager, Attachment Manager, Calendar Manager, or the Forums & Moderators function in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.vBulletin customers should contact vBulletin support for upgrade or patch information. See References."
      }
    ],
    "CVE-2007-0842": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32454",
        "title": "Microsoft Visual Studio time functions denial of service",
        "body": "Microsoft Visual Studio is vulnerable to a denial of service caused by an error in the Microsoft Visual C++ standard library time functions. By sending an overly long time_t argument, a remote attacker could exploit this vulnerability to cause an application using the Microsoft Visual C++ standard library time functions to crash.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-0843": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32644",
        "title": "Microsoft Windows ReadDirectoryChangesW information disclosure",
        "body": "Microsoft Windows could allow an authenticated remote attacker to obtain sensitive information, caused by insecure permissions on the ReadDirectoryChangesW function. An attacker could exploit this vulnerability to bypass LIST access permissions and view subdirectories, filenames, and file access times.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-0854": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32400",
        "title": "cPanel and WebHost Manager (WHM) Module scripts2/objcache cross-site scripting",
        "body": "cPanel and WebHost Manager (WHM) Module is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the scripts2/objcache function. A remote attacker could exploit this vulnerability using the objcache parameter to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Upgrade to the latest version of cPanel (10.9.0 build 134 or later), available from the cPanel web site. See References."
      }
    ],
    "CVE-2007-0882": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32434",
        "title": "Sun Solaris telnet authentication bypass",
        "body": "Sun Solaris could allow a remote attacker to bypass authentication, caused by an error in the telnet daemon (in.telnetd). A remote attacker could send a specially-crafted telnet login request to bypass authentication and gain unauthorized access to the system. Note: Remote root login must be enabled to gain root privileges.Refer to Sun Alert ID: 102802 for upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2007-0886": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32342",
        "title": "AXIGEN Mail Server memcpy denial of service",
        "body": "AXIGEN Mail Server is vulnerable to a denial of service, caused by an off-by-one error in memcpy. A remote attacker could exploit this vulnerability using a malformed packet to cause the server to crash, resulting in a denial of service.Upgrade to the latest version of AXIGEN, available to registered users from the AXIGEN Web site. See References."
      }
    ],
    "CVE-2007-0887": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32345",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-0891": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32430",
        "title": "phpMyVisites phpmyvisites.php cross-site scripting",
        "body": "phpMyVisites is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the phpmyvisites.php script. A remote attacker could exploit this vulnerability using the GetCurrentCompletePath() function to inject malicious script into a Web page which would be executed in a victim's Web browser within the security context of the hosting Web site, once the page is viewed. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Upgrade to the latest version of phpMyVisites (2.2 stable or later), available from the phpMyVisites Web site. See References."
      }
    ],
    "CVE-2007-0893": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32433",
        "title": "phpMyVisites pmv_ck_view parameter file include",
        "body": "phpMyVisites could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the phpmyvisites.php script using the pmv_ck_view parameter to specify a malicious file from the local system, which could allow the attacker to obtain sensitive information or execute arbitrary code on the vulnerable Web server. Note: In order to exploit this vulnerability to execute arbitrary code, the attacker would first be required to upload a malicious file or inject arbitrary commands into an existing file.Upgrade to the latest version of phpMyVisites (2.2 stable or later), available from the phpMyVisites Web site. See References."
      }
    ],
    "CVE-2007-0896": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32395",
        "title": "Sage extension for Mozilla Firefox RSS feed cross-site scripting",
        "body": "Sage extension for Mozilla Firefox is vulnerable to cross-site scripting, caused by improper validation of user-supplied input when processing RSS feeds. A remote attacker could exploit this vulnerability to inject malicious script into a Web page which would be executed in a victim's Web browser within the security context of the hosting Web site, once the page is viewed. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Upgrade to the latest version of Sage (1.3.10 or later), available from the Sage Web site. See References."
      }
    ],
    "CVE-2007-0898": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32535",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-0908": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32493",
        "title": "PHP wddx extension information disclosure",
        "body": "PHP could allow a remote attacker to obtain sensitive information, caused by an error in the wddx extension serialization handler. A remote attacker could exploit this vulnerability by sending a specially-crafted request with an overly long key_length value to obtain sensitive information.Upgrade to the latest version of PHP (5.2.1 or later), available from the PHP Web site. See References.For Red Hat Linux:Refer to RHSA-2007:0076-3, RHSA-2007:0081, RHSA-2007:0088, RHSA-2007:0089, or RHSA-2007:0082-5 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-424-2 for patch, upgrade, or suggested workaround information. See References.For OpenPKG:Refer to OpenPKG Security Advisory OpenPKG-SA-2007.010 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (php):Refer to MDKSA-2007:048 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (PHP):Refer to GLSA 200703-21 for patch, upgrade, or suggested workaround information. See References.For SUSE Linux:Refer to SUSE-SA:2007:020 for patch, upgrade, or suggested workaround information. See References.For Turbolinux (php):Refer to TLSA-2007-20 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-0918": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32474",
        "title": "Cisco IOS IPS ATOMIC.TCP denial of service",
        "body": "Cisco IOS is vulnerable to a denial of service, caused by a vulnerability in the Intrusion Prevention System (IPS) feature set. If the ATOMIC.TCP signature engine is enabled, a remote attacker could send specially-crafted packets to cause the device to crash.Refer to cisco-sa-20070213-iosips for upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2007-0932": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32461",
        "title": "Aruba Mobility Controller guest account privilege escalation",
        "body": "Aruba Mobility Controller could allow a remote attacker to gain elevated privileges, caused by a vulnerability regarding the implementation of the default guest account. A remote attacker with knowledge of the guest account name could exploit this vulnerability to gain unauthorized administrative access to the Mobility Controller.Aruba Networks customers are advised to upgrade to the latest patched version of the firmware available from the Aruba Networks Web site. See References."
      }
    ],
    "CVE-2007-0947": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33256",
        "title": "Microsoft Internet Explorer HTML object freed memory code execution variant",
        "body": "Microsoft Internet Explorer could allow a remote attacker to execute arbitrary code on the system, caused by a memory corruption vulnerability that occurs when an HTML object attempts to access memory that has been previously freed. An attacker could exploit this vulnerability by creating a specially-crafted Web page and persuading the victim to visit the page. Note: This is a variant of the vulnerability described by CVE-2007-0947.Apply the appropriate patch for your system, as listed in the latest Microsoft Security Bulletin. See References.— OR —Use Microsoft Automatic Update if it is supported by your operating system. The original bulletin issued by Microsoft has been superseded."
      }
    ],
    "CVE-2007-0957": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33411",
        "title": "MIT Kerberos administration daemon (kadmind) krb5_klog_syslog() buffer overflow",
        "body": "The MIT Kerberos administration daemon (kadmind) is vulnerable to a stack-based buffer overflow, caused by improper bounds checking by the krb5_klog_syslog() function. By sending a specially-crafted string to kadmind, a remote authenticated attacker could overflow a buffer and execute arbitrary code on the system with root privileges or cause the affected application to crash.Refer to MITKRB5-SA-2007-002 for patch or upgrade information. See References.For Apple Mac OS X:Apply Apple Security Update 2007-004, available from the Apple Web site. See References.For Novell KDC:Refer to Novell Security Alert 3618705 for patch or upgrade information. See References.For Red Hat Linux (krb5):Refer to RHSA-2007:0095 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux:Refer to GLSA 200704-02 for patch, upgrade, or suggested workaround information. See References.For Debian GNU/Linux 3.1 (krb5):Refer to DSA-1276-1 for patch, upgrade, or suggested workaround information. See References.For SUSE Linux (krb5):Refer to SUSE-SA:2007:025 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux (krb5):Refer to USN-449-1 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux:Refer to MDKSA-2007:077 for patch, upgrade, or suggested workaround information. See References.For Turbolinux (krb5):Refer to TLSA-2007-24 for patch, upgrade, or suggested workaround information. See References.For Solaris (kadm5):Refer to Sun Alert ID: 102930 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-0981": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32533",
        "title": "Mozilla Firefox location.hostname property security bypass",
        "body": "Mozilla Firefox could allow a remote attacker to bypass the cross-domain security module, caused by an error in the location.hostname DOM property. A remote attacker could exploit this vulnerability using NULL termination characters (\\x00) in a specially-crafted URL to bypass security zone restrictions and modify cookies, if the attacker could persuade the victim to visit the malicious site.Refer to MFSA 2007-07 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (Thunderbird):Refer to RHSA-2007:0078-2 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (Firefox):Refer to RHSA-2007:0079-2 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (Firefox RHEL server and client):Refer to RHSA-2007:0097-5 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (SeaMonkey):Refer to RHSA-2007:0077-4 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (SeaMonkey):Refer to Gentoo Linux Security Announcement GLSA 200703-08 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux:Refer to GLSA 200703-04 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-428-2 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (Firefox):Refer to MDKSA-2007:050 for patch, upgrade, or suggested workaround information. See References.For SUSE Linux (Firefox):Refer to SUSE-SA:2007:019 for patch, upgrade, or suggested workaround information. See References.For SUSE Linux (Mozilla):Refer to SUSE-SA:2007:022 for patch, upgrade, or suggested workaround information. See References.For Debian Linux (mozilla-firefox):Refer to DSA-1336-1 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-0983": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32453",
        "title": "AT Contenator nav.php script file include",
        "body": "AT Contenator could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the nav.php script using the Root_To_Script parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-0984": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32456",
        "title": "Systementor PollMentor pollmentorres.asp SQL injection",
        "body": "Systementor PollMentor is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the pollmentorres.asp script using the id parameter, which could allow the attacker to view, add, modify or delete information in the back-end database.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-0986": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32519",
        "title": "Jupiter Content Manager index.php n parameter file include",
        "body": "Jupiter Content Manager could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the index.php script using the n parameter to specify a malicious file from a remote or the local system, which could allow the attacker to obtain sensitive information or execute arbitrary code on the vulnerable Web server. Note: In order to exploit this vulnerability to execute arbitrary code using a local file, the attacker would first be required to upload a malicious file or inject arbitrary commands into an existing file.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-0988": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32709",
        "title": "PHP zend_hash_init function denial of service",
        "body": "PHP on 64-bit platforms is vulnerable to a denial of service, caused by an unspecified error in the zend_hash_init function. A remote attacker could exploit this vulnerability to unserialize crafted data and cause the application to enter into an infinite loop, resulting in a denial of service.Refer to The PHP Group Web site for upgrade information. See References.For Hewlett-Packard (PHP):Refer to HPSBTU02232 SSRT071429 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux:Refer to RHSA-2007:0076-3, RHSA-2007:0081, RHSA-2007:0088, RHSA-2007:0089, or RHSA-2007:0082-5 for patch, upgrade, or suggested workaround information. See References.For Debian GNU/Linux:Refer to DSA-1264-1 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-424-2 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (php):Refer to MDKSA-2007:048 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (PHP):Refer to GLSA 200703-21 for patch, upgrade, or suggested workaround information. See References.For Turbolinux (php):Refer to TLSA-2007-20 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-0998": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33085",
        "title": "Fedora Core Xen QEMU VNC information disclosure",
        "body": "An unspecified vulnerability in the QEMU VNC code used by Xen in Fedora Core could allow a remote attacker with access to the VNC server to obtain sensitive information. If Xen is used to create a full virtual machine and monitor mode is enabled, an attacker could exploit this vulnerability to read arbitrary files on the system with root privileges.For Fedora Core 5:Refer to FEDORA-2007-344 for upgrade information. See References.For Fedora Core 6:Refer to FEDORA-2007-343 for upgrade information. See References.For Red Hat Linux (xen):Refer to RHSA-2007:0114 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-1001": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33453",
        "title": "PHP GD graphics library integer overflow",
        "body": "PHP is vulnerable to an integer overflow, caused by improper bounds checking by the GD graphics library function. By creating a specially-crafted Wireless Bitmap (WBMP) image, a remote attacker could execute arbitrary code on the system or cause a denial of service, if the attacker could persuade the victim to view the malicious image.For Mac OS:Apply Apple Security Update 2007-007, available from the Apple Web site. See References.For PHP 4:Upgrade to the latest version of PHP (4.4.7 or later), available from the PHP Web site. See References.For PHP 5:Upgrade to the latest version of PHP (5.2.2 or later), available from the PHP Web site. See References.For Mandriva Linux (php):Refer to MDKSA-2007:090 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (php):Refer to MDKSA-2007:089 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (php):Refer to MDKSA-2007:088 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (php):Refer to MDKSA-2007:087 for patch, upgrade, or suggested workaround information. See References.For Turbolinux:Refer to TLSA-2007-29 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (PHP):Refer to GLSA 200705-19 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-1012": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32525",
        "title": "DeskPRO.com faq.php cross-site scripting",
        "body": "DeskPRO.com is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the faq.php script. A remote attacker could exploit this vulnerability using the article parameter in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1026": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32556",
        "title": "XLAtunes album parameter SQL injection",
        "body": "XLAtunes is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the mode script using the album parameter, which could allow the attacker to view, add, modify or delete information in the back-end database.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1031": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32553",
        "title": "SpoonLabs Vivvo Article Management CMS db_conn.php file include",
        "body": "SpoonLabs Vivvo Article Management CMS could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the db_conn.php script using the root parameter to specify a malicious file from the local system, which could allow the attacker to obtain sensitive information or execute arbitrary code on the vulnerable Web server. Note: In order to exploit this vulnerability to execute arbitrary code, the attacker would first be required to upload a malicious file or inject arbitrary commands into an existing file.Refer to Vivvo Patch Update for patch information. See References."
      }
    ],
    "CVE-2007-1034": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/23699",
        "title": "PHP-Nuke Emporium Shopping Cart Module modules.php SQL injection",
        "body": "PHP-Nuke Emporium Shopping Cart Module is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the modules.php script using the category_id parameter, which could allow the attacker to view, add, modify or delete information in the back-end database.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1036": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32596",
        "title": "JBoss Application Server admin interface unauthorized access",
        "body": "JBoss Application Server could allow an attacker to gain unauthorized access to the server. By default, the server is configured to allow access to the administrative interface. A remote attacker could exploit this vulnerability to gain unauthorized access to the console and perform unauthorized administrative actions.No remedy available as of December 2007."
      }
    ],
    "CVE-2007-1037": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32577",
        "title": "News File Grabber NZB file buffer overflow",
        "body": "News File Grabber is vulnerable to a buffer overflow, caused by improper bounds checking of NZB files. By sending a specially-crafted NZB file with an overly long subject field, a remote attacker could overflow a buffer and execute arbitrary code on the system with SYSTEM privileges, if the attacker could persuade the victim to open the malicious NZB file and view articles or message headers.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1041": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32576",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-1042": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32560",
        "title": "Xpression News archives.php and news.php directory traversal",
        "body": "Xpression News could allow a remote attacker to traverse directories on the system. An attacker could send a specially-crafted request to the archives.php and news.php script containing \"dot dot\" sequences (/../) in the xnews_template parameter to view arbitrary files on the system and obtain sensitive information.Apply the patch for this vulnerability (archives.php), available from the Xpression News Web site. See References."
      }
    ],
    "CVE-2007-1044": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32569",
        "title": "PowerSchool JS file extension information disclosure",
        "body": "PowerSchool could allow a remote attacker to obtain sensitive information, caused by insecure permissions on the /admin directory. An attacker could exploit this vulnerability by sending a direct request for a file with a JS file extension to the /admin directory to view the directory's file names and subdirectories and obtain sensitive information.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1045": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32562",
        "title": "mAlbum default admin account",
        "body": "mAlbum could allow an attacker to create an administrative user account and gain administrative privileges. mAlbum contains a default username and password. A remote attacker with knowledge of this vulnerability could login and create arbitrary administrator accounts.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1050": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32581",
        "title": "MyCalendar index.php cross-site scripting",
        "body": "MyCalendar is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the index.php script. A remote attacker could exploit this vulnerability using the keyword, go, username or password parameter in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1055": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32586",
        "title": "MediaWiki index.php cross-site scripting",
        "body": "MediaWiki is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the index.php script. A remote attacker could exploit this vulnerability using the rs parameter in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials. Note: In order to exploit this vulnerability on MediaWiki 1.8.3 - 1.9.2, the attacker would first be required to UTF-7 encode the URL, and browser encoding auto-detection must be enabled. Versions 1.8.2 and prior do not require encoding.Upgrade to the latest version of MediaWiki (1.9.3 or later), available from the MediaWiki Web site. See References."
      }
    ],
    "CVE-2007-1062": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32623",
        "title": "Cisco Unified IP Conference Station URL authentication bypass",
        "body": "Cisco Unified IP Conference Station models 7935 and 7936 could allow a remote attacker to bypass authentication caused by an error in releasing cached administrator credentials. By sending a URL request to the administrative HTTP interface, a remote attacker could bypass authentication and gain administrative access to the device.Refer to cisco-sa-20070221-phone for suggested workaround information. See References."
      }
    ],
    "CVE-2007-1076": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32628",
        "title": "phpTrafficA plotStat.php and banref.php file include",
        "body": "phpTrafficA could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the plotStat.php script using the file parameter or to the banref.php script using the lang parameter to specify a malicious file from the local system, which could allow the attacker to obtain sensitive information or execute arbitrary code on the vulnerable Web server. Note: In order to exploit this vulnerability to execute arbitrary code, the attacker would first be required to upload a malicious file or inject arbitrary commands into an existing file.Upgrade to the latest version of phpTrafficA (1.4.2 or later), available from the phpTrafficA Web site. See References."
      }
    ],
    "CVE-2007-1078": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32635",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-1082": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32606",
        "title": "FTP Explorer PWD command denial of service",
        "body": "FTP Explorer is vulnerable to a denial of service, caused by the improper handling of responses. A remote attacker could send a specially-crafted response containing an overly long PWD command to consume all available CPU resources, resulting in a denial of service.Upgrade to the latest version of FTP Explorer (1.0.1.52 or later) from the FTP Explorer Web site. See References."
      }
    ],
    "CVE-2007-1083": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32639",
        "title": "VeriSign ConfigChk ActiveX Control buffer overflow",
        "body": "The VeriSign ConfigChk ActiveX Control (VSCnfChk.dll), which is used in multiple VeriSign products, is vulnerable to a stack-based buffer overflow, caused by improper bounds checking by the VerCompare() method. By persuading a victim to visit a specially-crafted Web page or open a specially-crafted HTML email that passes an overly long argument to the VerCompare() method, a remote attacker could overflow a buffer and execute arbitrary code on the system with the privileges of the victim.Refer to US-CERT Vulnerability Note VU#308087 for upgrade and workaround information. See References."
      }
    ],
    "CVE-2007-1087": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32651",
        "title": "IBM DB2 BSS segment buffer overflow",
        "body": "IBM DB2 is vulnerable to a heap-based buffer overflow, caused by improper bounds checking by BSS segment buffers. By copying data from an environment variable, a local attacker could overflow a buffer and execute arbitrary code on the system with root privileges.Refer to IBM APAR IY94833 for patch, upgrade, or suggested workaround information. See References."
      }
    ],
    "CVE-2007-1088": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32652",
        "title": "IBM DB2 environmental variable string buffer overflow",
        "body": "IBM DB2 is vulnerable to a stack-based buffer overflow, caused by improper bounds checking of environment variable strings. By specifying an environment variable with an overly long string value, a local attacker could overflow a buffer and execute arbitrary code on the system with root privileges.Refer to IBM APAR IY94833 for patch, upgrade, or suggested workaround information. See References."
      }
    ],
    "CVE-2007-1093": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32683",
        "title": "Hitachi JP1/Cm2 Network Node Manager unspecified denial of service",
        "body": "Hitachi JP1/Cm2 Network Node Manager is vulnerable to a denial of service, caused by an unspecified error. A remote attacker could exploit this vulnerability to cause a denial of service.Refer to HS07-002 for upgrade or suggested workaround information. See References."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32682",
        "title": "Hitachi JP1/Cm2 Network Node Manager unspecified code execution",
        "body": "Hitachi JP1/Cm2 Network Node Manager could allow a remote attacker to execute arbitrary code on the system, caused by an unspecified error. A remote attacker could exploit this vulnerability to execute arbitrary code on the system.Refer to HS07-002 for upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2007-1097": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32757",
        "title": "Wiclear onAttachFiles() function file upload",
        "body": "Wiclear could allow a remote attacker to upload arbitrary files, caused by improper validation by the onAttachFiles() function. A remote attacker could send a specially-crafted request to upload a malicious script, which could allow the attacker to execute arbitrary code with the privileges of the Web server.Upgrade to the latest version of Wiclear (0.11.1 or later), available from the Wiclear Web site. See References."
      }
    ],
    "CVE-2007-1101": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32701",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-1109": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32687",
        "title": "PhpWebGallery register.php and search.php cross-site scripting",
        "body": "PhpWebGallery is vulnerable to cross-site scripting, caused by improper validation of user-supplied input. A remote attacker could exploit this vulnerability in the register.php script using the login or mail_address parameter or the search.php script using various parameters in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1143": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32646",
        "title": "J-Web Pics Navigator dir parameter directory traversal",
        "body": "J-Web Pics Navigator could allow a remote attacker to traverse directories on the system. An attacker could send a specially-crafted URL request to the pn-menu.php or jwpn-photos.php script containing \"dot dot\" sequences (/../) in the dir parameter to view arbitrary files on the system.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1144": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32646",
        "title": "J-Web Pics Navigator dir parameter directory traversal",
        "body": "J-Web Pics Navigator could allow a remote attacker to traverse directories on the system. An attacker could send a specially-crafted URL request to the pn-menu.php or jwpn-photos.php script containing \"dot dot\" sequences (/../) in the dir parameter to view arbitrary files on the system.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1154": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32669",
        "title": "webSPELL login SQL injection",
        "body": "webSPELL is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements when logging in using the ws_auth cookie parameter, which could allow the attacker to bypass user authentication and possibly view, add, modify or delete information in the back-end database.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1155": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32670",
        "title": "webSPELL add squad feature file upload",
        "body": "webSPELL could allow a remote authenticated attacker to upload malicious PHP files. A remote authenticated attacker could send a specially-crafted request using the \"add squad\" feature to upload a malicious PHP file, which could allow the attacker to execute arbitrary code on the vulnerable system.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1157": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32673",
        "title": "JBoss jmx-console cross-site request forgery",
        "body": "JBoss is vulnerable to a cross-site request forgery, caused by improper validation of user-supplied input by the /jmx-console/HtmlAdaptor. A remote attacker could exploit this vulnerability by sending a specially-crafted POST request to perform cross-site scripting attacks, Web cache poisoning, and other malicious activity, if the attacker could persuade the victim to visit a malicious site.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1164": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32612",
        "title": "DBImageGallery donsimg_base_path parameter file include",
        "body": "DBImageGallery could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to multiple scripts using the donsimg_base_path parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server. Note: The following scripts are reported to be vulnerable: admin/attributes.php admin/images.php admin/scan.php includes/attributes.php includes/db_utils.php includes/images.php includes/utils.php includes/values.phpUpgrade to the latest version of DBImageGallery (1.2.3 or later), available from the DBImageGallery Web site. See References."
      }
    ],
    "CVE-2007-1214": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33915",
        "title": "Microsoft Excel autofilter code execution",
        "body": "Microsoft Excel could allow a remote attacker to execute arbitrary code on the system, caused by improper handling of an Excel file containing malformed autofilter that could cause memory corruption. An attacker could exploit this vulnerability by persuading a victim to open a specially-crafted Excel file, either by hosting the document on a Web site or sending it as an email attachment.Apply the appropriate patch for your system, as listed in the latest Microsoft Security Bulletin. See References.— OR —Use Microsoft Automatic Update if it is supported by your operating system. The original bulletin issued by Microsoft has been superseded."
      }
    ],
    "CVE-2007-1218": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32749",
        "title": "tcpdump print-802_11.c printer buffer overflow",
        "body": "tcpdump is vulnerable to an off-by-one buffer overflow, caused by improper bounds checking by the parse_elements() in print-802_11.c. By sending a specially-crafted 802.11 frame, a remote attacker could overflow a buffer and execute arbitrary code on the system or cause the application to crash.Apply the patch for this vulnerability (print-802_11.c), available from the tcpdump CVS Repository. See References.For Ubuntu Linux (tcpdump):Refer to USN-429-1 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (tcpdump):Refer to MDKSA-2007:056 for patch, upgrade, or suggested workaround information. See References.For Debian Linux:Refer to DSA-1272-1 for patch, upgrade, or suggested workaround information. See References.For Turbolinux (Tcpdump):Refer to TLSA-2007-46 for patch, upgrade, or suggested workaround information. See References.For other distributions:Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2007-1227": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32729",
        "title": "McAfee Virex Library file privilege escalation",
        "body": "McAfee Virex could allow a local attacker to gain elevated privileges on the system. The Library/Application/Sypport/Virex/VShieldExecute.txt file was created with insecure permissions. A local authenticated attacker could exploit this vulnerability by creating a symbolic link from the /Library/Application Support/Virex/VShieldExclude.txt file to the /var/cron/tabs/root file to execute arbitrary commands on the system with ROOT privileges.Refer to McAfee ServicePortal Document ID: 518722 for patch, upgrade, or suggested workaround information. See References."
      }
    ],
    "CVE-2007-1229": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32726",
        "title": "Nullsoft SHOUTcast administrative interface cross-site scripting",
        "body": "Nullsoft SHOUTcast is vulnerable to cross-site scripting, caused by improper validation of user-supplied input in the administrative interface. A remote attacker could exploit this vulnerability using a specially-crafted URL to inject malicious script into a Web page which would be executed in an admin's Web browser within the security context of the hosting Web site, once the log file is viewed. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1231": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32692",
        "title": "SQLiteManager main.php cross-site scripting",
        "body": "SQLiteManager is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the main.php script. A remote attacker could exploit this vulnerability using the database, ViewName, view, trigger, function and possibly other form fields to inject malicious script into a Web page which would be executed in a victim's Web browser within the security context of the hosting Web site, once the page is viewed. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1233": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32681",
        "title": "STWC-Counter downloadcounter.php file include",
        "body": "STWC-Counter could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the downloadcounter.php script using the stwc_counter_verzeichniss parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1240": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32842",
        "title": "Docebo CMS index.php cross-site scripting",
        "body": "Docebo CMS is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the index.php script. A remote attacker could exploit this vulnerability using the searchkey, sn, or ri parameters in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1246": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32747",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-1247": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32770",
        "title": "aWebNews path_to_news parameter file include",
        "body": "aWebNews could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the listing.php or visview.php scripts using the path_to_news parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1248": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32772",
        "title": "Built2Go News Manager Blog news.php and rating.php cross-site scripting",
        "body": "Built2Go News Manager Blog is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the news.php script using the cid, uid or the nid parameter and the rating.php script using the nid parameter. A remote attacker could exploit this vulnerability to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Upgrade to the latest version of Built2Go News Manager Blog (1.0.3 or later), available from the Built2Go Web site. See References."
      }
    ],
    "CVE-2007-1250": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32756",
        "title": "ANGEL Learning Management Suite (LMS) default.asp SQL injection",
        "body": "ANGEL Learning Management Suite is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the default.asp script using the id parameter, which could allow the attacker to view, add, modify or delete information in the back-end database.Upgrade to the latest version of ANGEL Learning Management Suite (LMS), available to registered users from the ANGEL Learning Management Suite Web site. See References."
      }
    ],
    "CVE-2007-1253": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32778",
        "title": "Blender .kml or .kmz file command execution",
        "body": "Blender could allow a remote attacker to execute arbitrary commands on the system, caused by improper validation of user-supplied by the kmz_ImportWithMesh.py script. By persuading a user to import a specially-crafted .kml or .kmz file, a remote attacker could inject and execute arbitrary Python commands on the system.Upgrade to the latest version of Blender (2.43 or later), available from the Blender Web site. See References.For Gentoo Linux:Refer to GLSA 200704-19 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-1257": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32750",
        "title": "Cisco Catalyst NAM SNMP packet spoofing unauthorized access",
        "body": "An unspecified vulnerability in Cisco Catalyst 6000, 6500, and 7600 series switches with the Network Analysis Module (NAM) installed could allow a remote attacker to gain unauthorized access to an affected device. An attacker could exploit this vulnerability by spoofing Simple Network Management Protocol (SNMP) packets from the NAM IP address to gain complete control of the vulnerable device.Refer to cisco-sa-20070228-nam for patch, upgrade, or suggested workaround information. See References."
      }
    ],
    "CVE-2007-1261": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32758",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-1276": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32725",
        "title": "Webmin and Usermin chooser.cgi cross-site scripting",
        "body": "Webmin and Usermin are vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the chooser.cgi script. A remote attacker could exploit this vulnerability by creating a specially-crafted Web page containing a malicious filename which would execute JavaScript in a victim's Web browser within the security context of the hosting Web site, once the page is viewed. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.For Webmin:Upgrade to the latest version of Webmin (1.330 or later), available from the Webmin Web site. See References.For Usermin:Upgrade to the latest version of Usermin (1.260 or later), available from the Usermin Web site. See References."
      }
    ],
    "CVE-2007-1277": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32807",
        "title": "WordPress theme.php command execution",
        "body": "WordPress could allow a remote attacker to execute arbitrary commands on the system, caused by improper validation of user-supplied input by the theme.php script. A remote attacker could send a specially-crafted request to the theme.php script using the iz parameter to inject and execute malicious shell commands with the privileges of the Web server.Upgrade to the latest version of WordPress (2.1.2 or later), available from the WordPress Web site. See References."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32804",
        "title": "WordPress feed.php code execution",
        "body": "WordPress could allow a remote attacker to execute arbitrary code on the system caused by improper validation of input by the feed.php script. A remote attacker could send a specially-crafted request using the ix parameter to execute arbitrary PHP code on the system with the privileges of the Web server.Upgrade to the latest version of WordPress (2.1.2 or later), available from the WordPress Web site. See References."
      }
    ],
    "CVE-2007-1302": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/38369",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-1308": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32798",
        "title": "Konqueror KDE JavaScript implementation KJS denial of service",
        "body": "Konqueror is vulnerable to a denial of service, caused by an error in the KDE JavaScript implementation (KJS). A remote attacker could exploit this vulnerability by creating a specially-crafted Web page containing an IFRAME tag with an ftp:// URL to cause a victim's browser to crash, if the attacker could persuade the victim to visit the malicious Web page.For Mandriva Linux (kdelibs):Refer to MDKSA-2007:054 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux (kdelibs):Refer to USN-447-1 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-1327": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32846",
        "title": "SILC Server apps/silcd/command.c denial of service",
        "body": "SILC Server is vulnerable to a denial of service, caused by a NULL pointer dereference in the apps/silcd/command.c file. A remote attacker could exploit this vulnerability by creating or joining a server channel with a specially-crafted hmac algorithm name and no cipher algorithm name to crash the server.Upgrade to the latest version of SILC Server (1.0.3 or later), available from the SILC Server Web site. See References.For Gentoo Linux:Refer to Gentoo Linux Security Announcement GLSA 200703-12 for patch, upgrade, or suggested workaround information. See References."
      }
    ],
    "CVE-2007-1349": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33312",
        "title": "mod_perl path_info parameter denial of service",
        "body": "mod_perl is vulnerable to a denial of service, caused by the improper validation of the path_info parameter by a regular expression in the \"RegistryCooker.pm\" (mod_perl 2.x) and \"PerlRun.pm\" (mod_perl 1.x) functions. By sending requests to the vulnerable server using a specially-crafted URL, a remote attacker could exploit this vulnerability to cause a denial of service.Upgrade to the fixed version of mod_perl, available from the SVN Repository. See References.For OpenPKG:Refer to OpenPKG-SA-2007.011 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (apache-mod_perl):Refer to MDKSA-2007:083 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux:Refer to GLSA 200705-04 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (mod_perl):Refer to RHSA-2007:0395 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux (libapache2-mod-perl2):Refer to USN-488-1 for patch, upgrade, or suggested workaround information. See References.For Avaya (mod_perl):Refer to ASA-2007-293 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-1351": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33417",
        "title": "X.Org X11 BDF font buffer overflow",
        "body": "X.Org X11 is vulnerable to a heap-based buffer overflow, caused by an integer overflow vulnerability in the parsing of BDF fonts. By creating a specially-crafted BDF font file and persuading a victim to open the file, a local attacker could overflow a buffer and execute arbitrary code on the system with ROOT privileges or cause the system to crash.Upgrade to the latest version of X.Org X11 (7.2 or later), or apply the appropriate patch for your system, available from the X.Org Foundation Web site. See References.For Apple Safari:Upgrade to the latest version of Apple Safari (3.0.4 beta or later), available from the Apple Web site. See References.For Red Hat Linux (libXfont):Refer to RHSA-2007:0132 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (X.org):Refer to RHSA-2007:0126 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (XFree86):Refer to RHSA-2007:0125 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-448-1 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (freetype2):Refer to MDKSA-2007:081 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (tightvnc):Refer to MDKSA-2007:080 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (xorg-x11/XFree86):Refer to MDKSA-2007:079 for patch, upgrade, or suggested workaround information. See References.For Sun Solaris:Refer to Sun Alert ID: 102886 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (tightvnc, libxfont):Refer to GLSA 200705-10 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (freetype):Refer to GLSA 200705-02 for patch, upgrade, or suggested workaround information. See References.For Turbolinux (xorg-x11, XFree86):Refer to TLSA-2007-26 for patch, upgrade, or suggested workaround information. See References.For Debian GNU/Linux (xfree86):Refer to DSA-1294-1 for patch, upgrade, or suggested workaround information. See References.For Avaya (freetype):Refer to ASA-2007-193 for patch, upgrade, or suggested workaround information. See References.For dia Win32 Installer:Upgrade to the latest version of dia Win32 Installer (0.96.1-6 or later), as listed in SourceForge.net: Files. See References.For other distributions:Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2007-1362": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34613",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-1413": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/35517",
        "title": "PHP snmpget function buffer overflow",
        "body": "PHP is vulnerable to a buffer overflow, caused by improper bounds checking by the snmpget function. By sending a specially-crafted argument, an attacker could overflow a buffer and execute arbitrary code on the system.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1415": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32890",
        "title": "PMB Services multiple scripts file include",
        "body": "PMB Services could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to multiple scripts to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server. Note: The following scripts and parameters are affected by this vulnerability: includes/resa_func.inc.php using the class_path parameter includes/bull_info.inc.php using the include_path parameter includes/options/options_date_box.php using the include_path parameter includes/options/options_file_box.php using the include_path parameter includes/options/options_list.php using the include_path parameter includes/options/options_query_list.php using the include_path parameter includes/options/options_text.php using the include_path parameter includes/options_empr/options.php using the include_path parameter includes/options_empr/options_comment.php using the include_path parameter includes/options_empr/options_date_box.php using the include_path parameter includes/options_empr/options_list.php using the include_path parameter includes/options_empr/options_query_list.php using the include_path parameter includes/options_empr/options_text.php using the include_path parameter admin/import/iimport_expl.php using the include_path parameter admin/netbase/clean.php using the include_path parameter admin/notices/perso.inc.php using the class_path parameter admin/quotas/main.inc.php using the class_path parameter admin/param/param_func.inc.php using the include_path parameter admin/sauvegarde/lieux.inc.php using the include_path parameter opac_css/rec_panier.php using the base_path parameter opac_css/includes/author_see.inc.php using the base_path parameter autorites.php using the include_path parameter account.php using the include_path parameter cart.php using the include_path parameter edit.php using the include_path parameterUpgrade to the latest version of PMB (3.0.15 or later), available from the PMB Services Web site. See References."
      }
    ],
    "CVE-2007-1468": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33001",
        "title": "IBM Rational ClearQuest defect tracking cross-site scripting",
        "body": "IBM Rational ClearQuest is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the defect tracking form. An authenticated remote attacker with defect logging privileges could exploit this vulnerability using a text (.txt) file to inject malicious script into a Web page which would be executed in a victim's Web browser within the security context of the hosting Web site, once the page is viewed. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Refer to IBM Rational ClearQuest Web site for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2007-1469": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33005",
        "title": "Absolute Image Gallery gallery.asp SQL injection",
        "body": "Absolute Image Gallery is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the gallery.asp script using the categoryid parameter, which could allow the attacker to view, add, modify or delete information in the back-end database.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1472": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33000",
        "title": "Groupit c_basepath parameter file include",
        "body": "Groupit could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the load.inc.php, userprofile.php, password.php, dispatch.php or deliver.php scripts using the c_basepath parameter to specify a malicious file from a remote or the local system, which could allow the attacker to obtain sensitive information or execute arbitrary code on the vulnerable Web server. Note: In order to exploit this vulnerability to execute arbitrary code using a local file, the attacker would first be required to upload a malicious file or inject arbitrary commands into an existing file.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1476": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33003",
        "title": "Symantec Norton Firewall SymTDI driver denial of service",
        "body": "Symantec Norton Firewall and Internet Security are vulnerable to a denial of service, caused by an error in the SymTDI driver. A local attacker could exploit this vulnerability by sending a specially-crafted request to the input buffer to cause the system to crash.Refer to SYM07-024 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2007-1478": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33004",
        "title": "McGallery download.php information disclosure",
        "body": "McGallery could allow a remote attacker to obtain sensitive information caused by a vulnerability with the download.php script. A remote attacker could send a specially-crafted request to the download.php script using the filename parameter to obtain arbitrary files on the system.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1480": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33014",
        "title": "Creative Guestbook createadmin.php authentication bypass",
        "body": "Creative Guestbook could allow a remote attacker to bypass security restrictions, caused by a vulnerability in the authentication process in the createadmin.php script. A remote attacker could exploit this vulnerability to bypass authentication and gain unauthorized administrative access to the application to manipulate data.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1482": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33011",
        "title": "WBBlog e_id parameter cross-site scripting",
        "body": "WBBlog is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the index.php script. A remote attacker could exploit this vulnerability using e_id parameter in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1483": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33008",
        "title": "WebCalendar multiple scripts file include",
        "body": "WebCalendar could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the login.php, get_reminders.php, or get_events.php scripts using the includedir parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.Upgrade to the latest version of WebCalendar (1.0.5 or later), available from the SourceForge Web site. See References."
      }
    ],
    "CVE-2007-1499": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33026",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-1536": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/36283",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-1548": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33095",
        "title": "Web Wiz Forums pop_up_member_search.asp SQL injection",
        "body": "Web Wiz Forums in the MySQL version is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the pop_up_member_search.asp script using the id parameter, which could allow the attacker to view, add, modify or delete information in the back-end database.Upgrade to the latest version of Web Wiz Forums (8.05a or later), available from the Web Wiz Forums Web site. See References."
      }
    ],
    "CVE-2007-1562": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33119",
        "title": "Mozilla Firefox nsFtpState::R_pasv() information disclosure",
        "body": "Mozilla Firefox could allow a remote attacker to obtain sensitive information, caused by an error in the nsFtpState::R_pasv function. An attacker could exploit this vulnerability by creating a specially-crafted Web page on a malicious FTP server to bypass firewall security restrictions, scan ports, obtain sensitive information, and possibly cause the victim's browser to crash, if the attacker could persuade the victim to connect to the malicious FTP server. Note: KDE Konqueror and Opera are also affected by this vulnerability.Upgrade to the latest version of Mozilla Firefox (2.0.0.3 or 1.5.0.11 or later), as listed in MFSA 2007-11. See References.For KDE:Refer to KDE Security Advisory 20070326-1 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux (firefox):Refer to USN-443-1 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux (kdelibs):Refer to USN-447-1 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (kdelibs):Refer to MDKSA-2007:072 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (SeaMonkey):Refer to RHSA-2007:0402 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (Firefox):Refer to RHSA-2007:0400 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-1579": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33216",
        "title": "Atrium MERCUR Messaging SUBSCRIBE command buffer overflow",
        "body": "Atrium MERCUR Messaging is vulnerable to a stack-based buffer overflow, caused by improper bounds checking by the IMAP service. By sending an overly long argument to the SUBSCRIBE command, a remote authenticated attacker could overflow a buffer and execute arbitrary code on the system with elevated privileges or cause the application to crash.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1580": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33091",
        "title": "Ftpdmin LIST command denial of service",
        "body": "Ftpdmin is vulnerable to a denial of service, caused by a buffer overflow that can occur when handling LIST commands. By sending an overly long LIST command, a remote authenticated attacker could overflow a buffer and cause the FTP service to crash.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1581": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33248",
        "title": "PHP hash_update_file code execution",
        "body": "PHP could allow a remote attacker to execute arbitrary code on a system, caused by an error in the resource system's hash_update_file function. An attacker could exploit this vulnerability by sending a specially-crafted PHP string containing a malicious userspace stream handler or error to delete and modify system resources and possibly execute arbitrary code on the system.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1592": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33176",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-1593": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34676",
        "title": "Symantec VERITAS Volume Replicator (VVR) denial of service",
        "body": "The Symantec Veritas Volume Replicator (VVR) is vulnerable to a denial of service. A remote attacker could exploit this vulnerability by sending a specially-crafted request to the administrative service to crash the service.Refer to SYM07-010 for patch, upgrade, or suggested workaround information. See References."
      }
    ],
    "CVE-2007-1643": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33158",
        "title": "LMS userpanel.php and welcome.php file include",
        "body": "LMS could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the userpanel.php script using the CONFIG[directories][userpanel_dir] parameter or the welcome.php script using the _LIB_DIR parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.Upgrade to the latest version of LMS (1.9.7 or later), available from the LMS Web site. See References."
      }
    ],
    "CVE-2007-1659": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/38272",
        "title": "PCRE \\Q\\E regular expressions code execution",
        "body": "The PCRE (Perl Compatible Regular Expressions) library could allow a remote attacker to execute arbitrary code on the system, caused by improper handling of \"\\Q\\E\" sequences containing orphaned \"\\E\" codes. By passing specially-crafted data to an application linked to the vulnerable library, a remote attacker could exploit this vulnerability to execute arbitrary code with the privileges of the application.Upgrade to the latest version of PCRE (7.4 or later), available from the PCRE Web site. See References.For Mac OS X:Apply Security Update 2008-002, available from the Apple Web site. See References.For other distributions:Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2007-1660": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/38273",
        "title": "PCRE unspecified character class denial of service",
        "body": "The PCRE (Perl Compatible Regular Expressions) library is vulnerable to a denial of service, caused by an error in the processing of character classes that could result in improper memory allocation. A remote attacker could exploit this vulnerability using unspecified attack vectors to cause an application linked to the vulnerable library to crash.Upgrade to the latest version of PCRE (7.4 or later), available from the PCRE Web site. See References.For Mac OS X:Apply Security Update 2008-002, available from the Apple Web site. See References.For other distributions:Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2007-1666": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33190",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-1673": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34080",
        "title": "Multiple vendor ZOO archive decompression denial of service",
        "body": "Barracuda Spam Firewall, Panda Software Antivirus, avast! antivirus, Avira AntiVir, zoo, unzoo, WinAce, PicoZip, AMaViS, and multiple unspecified applications that handle ZOO archives are vulnerable to a denial of service, caused by an error in the ZOO compression algorithm implementation. By sending a specially-crafted ZOO archive, a remote attacker could exploit this vulnerability to consume all available system resources or crash the affected system.For Barracuda Spam Firewall:Upgrade to the latest virus definition version of Barracuda Spam Firewall (virusdef 2.0.6399 for 3.4 and after or virusdef 2.0.6399o for prior to 3.4), available from the automatic update.For Panda Software Antivirus:Upgrade to the latest version of Panda Software Antivirus (4/2/2007 or later), available from the automatic update feature.For avast! antivirus:Upgrade to the latest version of Panda Software Antivirus (4.7.981 or later), available from the avast! antivirus Web site. See references.For Avira AntiVir:Upgrade to the latest version of Avira AntiVir (avpack32.dll version 7.3.0.6 or later), available from the automatic update feature.For AMaViS:Refer to ASA-2007-2 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-1688": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/36588",
        "title": "Callisto PhotoParade Player PhPinfo ActiveX control buffer overflow",
        "body": "Callisto PhotoParade Player is vulnerable to a buffer overflow, caused by improper bounds checking by the PhPinfo ActiveX control (PhPCtrl.dll). By persuading a victim to view a specially-crafted Web page or HTML email with a malicious FileVersionOf property, a remote attacker could overflow a buffer and execute arbitrary code on the system with the victim's privileges or cause the browser to crash.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1709": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33236",
        "title": "phpDOC confirm_phpdoc_compiled buffer overflow",
        "body": "The phpDOC extension for PHP is vulnerable to a buffer overflow, caused by improper bounds checking by the confirm_phpdoc_compiled function. By sending a specially-crafted request, an authenticated remote attacker could overflow a buffer and execute arbitrary code on the system with elevated privileges or cause the application to crash.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1723": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33232",
        "title": "CipherTrust IronMail multiple method parameter cross-site scripting",
        "body": "CipherTrust IronMail is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by multiple scripts. A remote attacker could exploit this vulnerability using the method parameter to inject malicious script into a Web page which would be executed in a victim's Web browser within the security context of the hosting Web site, once the page is viewed. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1735": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33286",
        "title": "Corel WordPerfect X3 printer selection (.PRS) filename buffer overflow",
        "body": "Corel WordPerfect X3 is vulnerable to a stack-based buffer overflow, caused by improper bounds checking of the printer selection (.PRS) filename. By creating a specially-crafted WordPerfect document, a remote attacker could overflow a buffer and execute arbitrary code on the system or cause the application to crash, if the attacker could persuade the victim to open the malicious WordPerfect document.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1747": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33908",
        "title": "Microsoft Office drawing object code execution",
        "body": "Microsoft Office could allow a remote attacker to execute arbitrary code on the system, caused by improper handling of a malformed drawing object that could cause memory corruption. An attacker could exploit this vulnerability by persuading a victim to open a specially-crafted Office document, either by hosting the document on a Web site or sending it as an email attachment.Apply the appropriate patch for your system, as listed in the latest Microsoft Security Bulletin. See References.— OR —Use Microsoft Automatic Update if it is supported by your operating system. The original bulletin issued by Microsoft has been superseded."
      }
    ],
    "CVE-2007-1748": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33629",
        "title": "Microsoft Windows DNS Server RPC interface buffer overflow",
        "body": "The Microsoft Windows Domain Name System (DNS) Server is vulnerable to a stack-based buffer overflow in the RPC interface. By sending a specially-crafted Remote Procedure Call (RPC) packet to a vulnerable system, a remote attacker could overflow a buffer and execute arbitrary code on the system with SYSTEM privileges.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS07-029. See References."
      }
    ],
    "CVE-2007-1751": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34626",
        "title": "Microsoft Internet Explorer uninitialized object code execution",
        "body": "Microsoft Internet Explorer could allow a remote attacker to execute arbitrary code on the system, caused by a memory corruption vulnerability that occurs when Internet Explorer attempts to access objects that were not initialized or have been deleted. An attacker could exploit this vulnerability by persuading a victim to visit a specially-crafted Web page.Apply the appropriate patch for your system, as listed in the latest Microsoft Security Bulletin. See References.— OR —Use Microsoft Automatic Update if it is supported by your operating system. The original bulletin issued by Microsoft has been superseded."
      }
    ],
    "CVE-2007-1773": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33277",
        "title": "aBitWhizzy whizzylink.php and whizzypic.php directory traversal",
        "body": "aBitWhizzy could allow a remote attacker to traverse directories on the system. An attacker could send a specially-crafted URL request to the whizzylink.php or whizzypic.php scripts containing \"dot dot\" sequences (/../) in the \"d\" parameter to view arbitrary files on the system.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1774": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33279",
        "title": "aBitWhizzy whizzylink.php and whizzypic.php scripts cross-site scripting",
        "body": "aBitWhizzy is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the whizzylink.php or whizzypic.php scripts. A remote attacker could exploit this vulnerability using the \"d\" parameter in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1776": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33249",
        "title": "D4J eZine component for Joomla! index.php SQL injection",
        "body": "The D4J eZine component for Joomla! is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the index.php script using the article parameter, which could allow the attacker to view, add, modify or delete information in the back-end database.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1790": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33335",
        "title": "Kaqoo Auction install_root parameter file include",
        "body": "Kaqoo Auction could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to multiple scripts using the install_root parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.Upgrade to the latest version of Kaqoo Auction (2007033119 or later), available from the Kaqoo Auction Web site. See References."
      }
    ],
    "CVE-2007-1793": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33352",
        "title": "Symantec Norton Personal Firewall SSDT denial of service",
        "body": "Symantec Norton Personal Firewall is vulnerable to a denial of service, caused by improper permissions on the SPBBCDrv.sys driver's SSDT function handlers. A local attacker could exploit this vulnerability by sending a specially-crafted NtCreateMutant or NtOpenEvent call to cause the system to crash. Note: Other products using the SPBBCDrv.sys driver may also be vulnerable.Refer to SYM08-022 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2007-1797": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33377",
        "title": "ImageMagick ReadXWDImage() function buffer overflow",
        "body": "ImageMagick is vulnerable to a heap-based buffer overflow, caused by multiple integer overflows in the ReadXWDImage() function related to the colors or comment field. By creating a malicious XWD image file and persuading a victim to open the file, a remote attacker could overflow a buffer and execute arbitrary code on the system with the privileges of the victim.Upgrade to the latest version of ImageMagick (6.3.3-5 or later), available from SourceForge.net Files. See References.For Gentoo Linux (ImageMagick):Refer to GLSA 200705-13 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-481-1 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (ImageMagick):Refer to MDKSA-2007:147 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33376",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-1803": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33324",
        "title": "MailDwarf unspecified security bypass",
        "body": "MailDwarf could allow a remote attacker to bypass security restrictions, caused by improper validation of user-supplied input. A remote attacker could exploit this vulnerability to bypass security restrictions and send large amounts of spam messages to arbitrary email addresses.Upgrade to the latest version of MailDwarf (3.10 or later), available from JVN#40511721. See References."
      }
    ],
    "CVE-2007-1819": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33353",
        "title": "HP Mercury Quality Center ActiveX ProgColor buffer overflow",
        "body": "HP Mercury Quality Center is vulnerable to a stack-based buffer overflow in the Spider90.ocx ActiveX control, caused by improper bounds checking of the ProgColor property. By persuading a victim to visit a malicious Web page that sets the ProgColor property to an overly long value, a remote attacker could overflow a buffer and execute arbitrary code on the system with the privileges of the victim.Refer to HPSBGN02199 SSRT071312 for patch, upgrade, or suggested workaround information. See References."
      }
    ],
    "CVE-2007-1843": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33360",
        "title": "MapLab params.php file include",
        "body": "MapLab could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the params.php script using the gszAppPath parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1859": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34054",
        "title": "XScreenSaver getpwuid() function authentication bypass",
        "body": "XScreenSaver could allow a local attacker to bypass authentication, caused by the improper parsing of a call to the getpwuid() function. If the application is using a remote directory service for login during a network outage, a local attacker could exploit this vulnerability to crash the application to unlock the screen and gain unauthorized access to the victim's system.Upgrade to the latest version of XScreenSaver (5.02 or later), available from the XScreenSaver Web site. See References.For Red Hat Linux (xscreensaver):Refer to RHSA-2007:0322-4 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (XScreenSaver):Refer to GLSA 200705-14 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux (xscreensaver):Refer to USN-474-1 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (xscreensaver):Refer to MDKSA-2007:097 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-1860": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34496",
        "title": "Apache Tomcat JK Connector security bypass",
        "body": "The Apache Tomcat JK Connector could allow a remote attacker to bypass security restrictions, caused by a double-decoding error. An attacker could exploit this vulnerability by sending a specially-crafted URL to execute access control rules on the server.Upgrade to the latest version of Apache Tomcat JK Connector (1.2.23 or later), available from the Apache Tomcat Web site. See References.For Debian/GNU Linux:Refer to DSA-1312-1 for patch, upgrade, or suggested workaround information. See References.For Mac OS:Apply Apple Security Update 2007-007, available from the Apple Web site. See References.For Gentoo Linux (Apache mod_jk):Refer to GLSA 200708-15 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-1861": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34014",
        "title": "Linux kernel NETLINK_FIB_LOOKUP denial of service",
        "body": "Linux kernel is vulnerable to a denial of service, caused by an infinite recursion error in the nl_fib_lookup() function when handling NETLINK_FIB_LOOKUP reply messages. A local attacker could exploit this vulnerability to cause a system panic or trigger a stack overflow.Upgrade to the latest stable version of the Linux kernel (2.6.20.8 or later), available from The Linux Kernel Archives. See References.For Debian GNU/Linux (linux-2.6):Refer to DSA-1289-1 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (kernel):Refer to RHSA-2007:0347 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux (linux-source):Refer to USN-489-1 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (kernel):Refer to MDKSA-2007:171 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-1893": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33470",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-1905": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33523",
        "title": "QuizShock auth.php cross-site scripting",
        "body": "QuizShock is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the auth.php script. A remote attacker could exploit this vulnerability using the forward_to parameter in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1920": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33476",
        "title": "SmodBIP index.php SQL injection",
        "body": "SmodBIP is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the index.php script using the zoom parameter, which could allow the attacker to view, add, modify or delete information in the back-end database.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1922": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33480",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-1938": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33507",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-1949": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33499",
        "title": "webblizzard CMS PHPSESSID session hijacking",
        "body": "webblizzard CMS could allow a remote attacker to hijack a valid user's session, caused by a vulnerability in the cookie variable PHPSESSID. By setting the PHPSESSID variable to a fixed value, a remote attacker could hijack a victim's session once the victim logs in to the application using the set PHPSESSID value.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1951": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33500",
        "title": "oboShop PHPSESSID session hijacking",
        "body": "oboShop could allow a remote attacker to hijack a valid user's session, caused by a vulnerability in the cookie variable PHPSESSID. By setting the PHPSESSID variable to a fixed value, a remote attacker could hijack a victim's session once the victim logs in to the application using the set PHPSESSID value.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1952": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33497",
        "title": "onebyone CMS PHPSESSID session hijacking",
        "body": "onebyone CMS could allow a remote attacker to hijack a valid user's session, caused by a vulnerability in the cookie variable PHPSESSID. By setting the PHPSESSID variable to a fixed value, a remote attacker could hijack a victim's session once the victim logs in to the application using the set PHPSESSID value.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1953": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33502",
        "title": "courts online PHPSESSID session hijacking",
        "body": "courts online could allow a remote attacker to hijack a valid user's session, caused by a vulnerability in the cookie variable PHPSESSID. By setting the PHPSESSID variable to a fixed value, a remote attacker could hijack a victim's session once the victim logs in to the application using the set PHPSESSID value.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1962": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33425",
        "title": "XOOPS WF-Snippets module index.php SQL injection",
        "body": "The XOOPS WF-Snippets module is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the index.php script using the c parameter, which could allow the attacker to view, add, modify or delete information in the back-end database.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-1993": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33567",
        "title": "HP-UX Portable File System (PFS) privilege escalation",
        "body": "HP-UX is vulnerable to a buffer overflow, caused by improper bounds checking by the Portable File System (PFS). By sending multiple specially-crafted UDP packets, a remote attacker could overflow a buffer and execute arbitrary code on the system with root privileges.Refer to HPSBUX02203 SSRT071339 for suggested workaround information. See References.NOTE: As of March 1, 2004 the Portable File System (PFS) is no longer updated or supported on HP-UX platforms. HP now provides this functionality in the CDFS file system type combined with the HP-UX standard file system commands."
      }
    ],
    "CVE-2007-1995": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33547",
        "title": "Quagga BGP attributes denial of service",
        "body": "Quagga is vulnerable to a denial of service, caused by improper bounds checking of the BGP attributes by the bgpd daemon. By sending a specially-crafted UPDATE message, a remote attacker could exploit this vulnerability to cause an assertion error, resulting in a denial of service.Refer to Quagga Bugzilla Bug 354 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux:Refer to GLSA 200705-05 for patch, upgrade, or suggested workaround information. See References.For Debian GNU/Linux (quagga):Refer to DSA-1293-1 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux (quagga):Refer to USN-461-1 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (quagga):Refer to RHSA-2007:0389 for patch, upgrade, or suggested workaround information. See References.For Sun Solaris 10 x86 and SPARC:Refer to Sun Alert ID: 236141 for patch, upgrade, or suggested workaround information. See References.For other distributions:Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2007-2000": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33555",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-2005": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33552",
        "title": "Taskhopper mosConfig_absolute_path file include",
        "body": "Taskhopper, component for Joomla and Mambo, could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the contact_type.php, itemstatus_type.php, projectstatus_type.php, request_type.php, responses_type.php, timelog_type.php, and urgency_type.php scripts using the mosConfig_absolute_path parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2010": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33594",
        "title": "Bftpd GET and MGET commands denial of service",
        "body": "Bftpd is vulnerable to a denial of service, caused by a double-free memory corruption vulnerability when transferring files. A remote attacker could send a specially-crafted GET or MGET request to cause the daemon to crash.Upgrade to the latest version of Bftpd (1.8 or later), available from the Bftpd Web site. See References."
      }
    ],
    "CVE-2007-2022": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33595",
        "title": "Adobe Flash Player unspecified information disclosure",
        "body": "Adobe Macromedia Flash Player when used with Opera or Konqueror could allow a remote attacker to obtain sensitive information, caused by an unspecified vulnerability. By persuading a victim to view a specially-crafted Flash Player applet, a remote attacker could exploit this vulnerability to obtain browser keystrokes.Refer to APSB07-12 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (Konqueror):Refer to RHSA-2007:0494-2 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (kdebase):Refer to MDKSA-2007:138 for patch, upgrade, or suggested workaround information. See References.For Turbo Linux (flash-player):Refer to TLSA-2007-36 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (Flash Player):Refer to GLSA 200708-01 for patch, upgrade, or suggested workaround information. See References.For other distributions:Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2007-2029": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34083",
        "title": "Clam AntiVirus PDF handler denial of service",
        "body": "Clam AntiVirus (ClavAV) is vulnerable to a denial of service, caused by a file descriptor leak in the PDF handler. By sending a specially-crafted PDF file, a remote attacker could cause the system to crash.Upgrade to the latest version of Clam AntiVirus (0.90.2 or later), available from SourceForge.net: Files. See References.For Debian Linux (clamav):Refer to DSA-1281-1 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (clamav):Refer to MDKSA-2007:098 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-2037": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33607",
        "title": "Cisco Wireless LAN Controller Ethernet traffic denial of service",
        "body": "Cisco Wireless LAN Controller (WLC) could allow a remote attacker on the local network segment to cause a denial of service. By sending malformed Ethernet traffic, a remote attacker could cause the controller to crash.Refer to cisco-sa-20070412-wlc for upgrade information. See References."
      }
    ],
    "CVE-2007-2039": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33609",
        "title": "Cisco Wireless LAN Controller Network Processing Unit traffic denial of service",
        "body": "Cisco Wireless LAN Controller (WLC) could allow a remote attacker on a local wireless network segment to cause a denial of service. By sending specially-crafted SNAP packets, 802.11 traffic, or packets containing values with unexpected lengths in certain headers, a remote attacker could cause the controller NPUs to lock. NOTE: Devices with WLC functionality provided by software are not affected by this vulnerability.Refer to cisco-sa-20070412-wlc for upgrade information. See References."
      }
    ],
    "CVE-2007-2063": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33699",
        "title": "SSH Tectia Server PID and HFS privilege escalation",
        "body": "The SSH Tectia Server could allow a local attacker to gain elevated privileges caused by improper restriction on the PID and HFS files. A local attacker could exploit this vulnerability to gain elevated privileges.Upgrade to the latest version of SSH Tectia Server (5.4.0 or later), available from the SSH Tectia Server Web site. See References."
      }
    ],
    "CVE-2007-2070": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33670",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-2084": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33679",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-2091": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33695",
        "title": "XOOPS TeamSpeak module tsdisplay4xoops_block2.php file include",
        "body": "XOOPS TeamSpeak module could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the tsdisplay4xoops_block2.php script using the xoops_url parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2138": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33842",
        "title": "PostgreSQL search_path privilege escalation",
        "body": "PostgreSQL could allow a local or remote attacker to gain elevated privileges caused by insecure search_path settings. An attacker could modify the search_path and use specially-crafted temporary objects to obtain privileges of SECURITY DEFINER functions.Refer to PostgreSQL News, 2007-04-23 for upgrade information. See References.For Mandriva Linux (postgresql):Refer to MDKSA-2007:094 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-454-1 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (postgresql):Refer to GLSA 200705-12 for patch, upgrade, or suggested workaround information. See References.For Solaris:Refer to Sun Alert ID: 102894 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux:Refer to RHSA-2007:0336 for patch, upgrade, or suggested workaround information. See References.For Debian GNU/Linux (postgresql-8.1):Refer to DSA-1309-1 for patch, upgrade, or suggested workaround information. See References.For Debian/GNU Linux:Refer to DSA-1311-1 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-2144": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33702",
        "title": "JoomlaPack component for Joomla! CAltInstaller.php file include",
        "body": "The JoomlaPack component for Joomla! could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the CAltInstaller.php script using the mosConfig_absolute_path parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.Upgrade to the latest version of JoomlaPack (1.1 or later), available from the JoomlaPack Web site. See References."
      }
    ],
    "CVE-2007-2172": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33979",
        "title": "Linux kernel dn_fib_props and fib_props functions denial of service",
        "body": "Linux kernel is vulnerable to a denial of service, caused by an out-of-bounds error that can occur when the dn_fib_props and fib_props functions use the RTA_MAX as an array size instead of RTN_MAX. A remote attacker could exploit this vulnerability to cause a denial of service.Upgrade to the latest version of Linux kernel (2.6.21-rc6 or later), available from The Linux Kernel Archives. See References.For Ubuntu Linux (linux-source):Refer to USN-464-1 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (kernel):Refer to RHSA-2007:0347 for patch, upgrade, or suggested workaround information. See References.For Avaya (kernel):Refer to ASA-2007-287 for patch, upgrade, or suggested workaround information. See References.For Debian GNU/Linux (linux-2.6):Refer to DSA-1356-1 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (kernel):Refer to MDKSA-2007:171 for patch, upgrade, or suggested workaround information. See References.For Debian GNU/Linux (linux):Refer to DSA-1363-1 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-2185": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33796",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-2199": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/35092",
        "title": "phpSiteBackup pcltar.lib.php file include",
        "body": "phpSiteBackup could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the pcltar.lib.php script using the g_pcltar_lib_dir parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.No remedy available as of September 1, 2014."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34273",
        "title": "cjgExplorerPro pcltar.lib.php and pcltrace.lib.php file include",
        "body": "cjgExplorerPro could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the pcltar.lib.php and pcltrace.lib.php scripts using the g_pcltar_lib_dir parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.No remedy available as of September 1, 2014."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33837",
        "title": "Joomla! pcltar.php file include",
        "body": "Joomla! could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the pcltar.php script using the g_pcltar_lib_dir parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2206": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33817",
        "title": "Ripe Website Manager index.php cross-site scripting",
        "body": "Ripe Website Manager is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the index.php script. A remote attacker could exploit this vulnerability using the ripeformpost parameter in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Per private correspondence, the vendor states that this vulnerability has been fixed. Please contact the vendor for further information. See References."
      }
    ],
    "CVE-2007-2217": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/36799",
        "title": "Microsoft Windows Kodak image Viewer code execution",
        "body": "Microsoft Windows could allow a remote attacker to execute arbitrary code on the system, caused by improper handling of images by the Windows Kodak image Viewer. By persuading a victim to open a specially-crafted image using the Kodak image Viewer, a remote attacker could corrupt memory and execute arbitrary code on the system with the privileges of the victim. An attacker could exploit this vulnerability by sending the malicious image as an email attachment or embedding the image within a document.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS07-055. See References."
      }
    ],
    "CVE-2007-2222": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34630",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-2230": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33853",
        "title": "Computer Associates (CA) CleverPath Portal search SQL injection",
        "body": "Computer Associates CleverPath Portal used in multiple CA products is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements using the search query, which could allow the attacker to view, add, modify or delete information in the back-end database.Refer to CleverPath Portal Security Notice for patch, upgrade, or suggested workaround information. See References."
      }
    ],
    "CVE-2007-2238": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/49888",
        "title": "Microsoft Intelligent Application Gateway Whale Client Components ActiveX control buffer overflow",
        "body": "The Microsoft Whale Intelligent Application Gateway Whale Client Components ActiveX control (WhlMgr.dll) is vulnerable to a stack-based buffer overflow. By persuading a victim to visit a specially-crafted Web page that passes overly long arguments to the CheckForUpdates() and UpdateComponents() method, a remote attacker could overflow a buffer and execute arbitrary code on the system with the privileges of the victim or cause the victim's browser to crash.Upgrade to the latest version of Microsoft Whale Communications Intelligent Application Gateway 2007 (SP2 or later), available from the Microsoft Web site. See References."
      }
    ],
    "CVE-2007-2243": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33794",
        "title": "OpenSSH ChallengeResponseAuthentication information disclosure",
        "body": "OpenSSH could allow a remote attacker to obtain sensitive information, caused by improper handling of error messages from failed login attempts. If ChallengeResponseAuthentication is enabled, a remote attacker could exploit this vulnerability to enumerate system accounts and obtain sensitive information. Note: This vulnerability could also affect applications using OpenSSH.No remedy available as of December 2016."
      }
    ],
    "CVE-2007-2244": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33838",
        "title": "Adobe Photoshop multiple files buffer overflow",
        "body": "Adobe Photoshop is vulnerable to multiple buffer overflows. By creating a specially-crafted BMP, DIB or RLE file, a remote attacker could overflow a buffer and execute arbitrary code on the system or cause the application to crash, if the attacker could persuade the victim to open the malicious file.Refer to APSB07-13, APSB07-16, and APSB07-17 for patch, upgrade, or suggested workaround information. See References."
      }
    ],
    "CVE-2007-2253": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33937",
        "title": "Exponent CMS multiple .php scripts path disclosure",
        "body": "Exponent CMS could allow a remote attacker to obtain sensitive information. An attacker could send a direct request to the sdk/blanks/formcontrol.php or sdk/blanks/file_modules.php script using an invalid parameter to cause an error message to be returned containing the full installation path. An attacker could use this information to launch further attacks against the affected system.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2262": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33815",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-2263": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/37436",
        "title": "RealNetworks RealPlayer SWF file buffer overflow",
        "body": "RealNetworks RealPlayer and RealOne Player are vulnerable to a heap-based buffer overflow, caused by improper bounds checking of SWF files. By persuading a victim to open a malformed SWF file, a remote attacker could overflow a buffer and execute arbitrary code on the system or cause the application to crash.Refer to the RealNetworks Customer Support - Real Security Updates Web page for upgrade information. See References."
      }
    ],
    "CVE-2007-2264": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/37437",
        "title": "RealNetworks RealPlayer RAM/RA file buffer overflow",
        "body": "RealNetworks RealPlayer and RealOne Player are vulnerable to a heap-based buffer overflow, caused by improper bounds checking of RAM and RA files. By persuading a victim to open a malformed RAM or RA file containing an overly long RA header, a remote attacker could overflow a buffer and execute arbitrary code on the system or cause the application to crash.Refer to the RealNetworks Customer Support - Real Security Updates Web page for upgrade information. See References."
      }
    ],
    "CVE-2007-2274": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34079",
        "title": "Opera BitTorrent denial of service",
        "body": "Opera is vulnerable to a denial of service caused by a vulnerability in the BitTorrent implementation within Opera. By persuading a victim to download a specially-crafted torrent file, a remote attacker could consume all available CPU resources or cause the victim's browser to crash.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2277": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33863",
        "title": "Plogger PHPSESSID session hijacking",
        "body": "Plogger could allow a remote attacker to hijack a valid user's session. User-generated SIDs are accepted. An attacker could exploit this vulnerability by creating a specially-crafted Web page containing a malicious PHPSESSID value to hijack a victim's session and gain the victim's privileges, if the attacker could persuade the victim to visit a malicious Web page and login to the affected application.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2279": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34680",
        "title": "Symantec Storage Foundation Scheduler Service security bypass",
        "body": "Symantec Storage Foundation could allow an authenticated remote attacker from within the local network to bypass security restrictions and possibly execute arbitrary code, caused by an error in the Scheduler Service. An attacker could exploit this vulnerability to bypass the built-in authentication in the management console and possibly manipulate the registry with arbitrary commands, which could be executed during regularly scheduled runs.Refer to SYM07-009 for patch, upgrade, or suggested workaround information. See References."
      }
    ],
    "CVE-2007-2292": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33981",
        "title": "Mozilla Firefox and SeaMonkey Digest Authentication LF response splitting",
        "body": "Mozilla Firefox and SeaMonkey are vulnerable to HTTP response splitting attacks, caused by improper validation of input passed to the Digest Authentication service. A remote attacker could exploit this vulnerability by sending a specially-crafted URL containing an encoded LF value in the username attribute to cause the server to return a split response, once the URL is clicked. This would allow the attacker to perform further attacks, such as Web cache poisoning, cross-site scripting, and possibly obtaining sensitive information.Refer to MFSA 2007-31 for patch, upgrade, or suggested workaround information. See References.For Netscape:Upgrade to the latest version of Netscape (9.0.0.1 or later), available from the Netscape Web site. See References.For Warpzilla Enhanced Gecko:Upgrade to the latest version of Gecko (1.8.1.8 or later), available from SourceForge.net: Files. See References.For other distributions:Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2007-2295": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/35356",
        "title": "Apple QuickTime H.264 code execution",
        "body": "Apple QuickTime could allow a remote attacker to execute arbitrary code on the system, caused by an unspecified memory corruption vulnerability. By persuading a victim to open a specially-crafted H.264 movie file, a remote attacker could corrupt memory and cause the victim's QuickTime application to crash or possibly execute arbitrary code on the victim's system with the privileges of the user. An attacker could exploit this vulnerability by sending the malicious file as an email attachment or hosting it on a Web site.Upgrade to the latest version of Apple QuickTime (7.2 or later), available from the Apple Web site. See References."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34070",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-2296": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34069",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-2319": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33660",
        "title": "AutoStand Category mod_as_category.php file include",
        "body": "AutoStand Category module for Joomla could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the mod_as_category.php script using the mosConfig_absolute_path parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2322": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33974",
        "title": "Nero MediaHome CRLF sequences denial of service",
        "body": "Nero MediaHome is vulnerable to a denial of service, caused by a NULL pointer dereference in the NMMediaServer.exe. By sending a specially-crafted packet containing two CRLF sequences, a remote attacker could exploit this vulnerability to crash the application.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2337": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34077",
        "title": "Exponent CMS multiple scripts cross-site scripting",
        "body": "Exponent CMS is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the weblogmodule module and the magpie_debug.php, magpie_simple.php, amd magpie_slashbox.php scripts. A remote attacker could exploit this vulnerability using various parameters to inject malicious script into a Web page which would be executed in a victim's Web browser within the security context of the hosting Web site, once the page is viewed. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2340": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33904",
        "title": "phpOracleView include_all.inc.php file include",
        "body": "phpOracleView could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the include_all.inc.php script using the page_dir parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2353": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34167",
        "title": "Apache Axis WSDL file path disclosure",
        "body": "Apache Axis could allow a remote attacker to obtain sensitive information. An attacker could send a specially-crafted URL request for a non-existent WSDL file to cause an error message to be returned containing the full installation path. An attacker could use this information to launch further attacks against the affected system.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2356": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33911",
        "title": "GIMP SUNRAS plugin buffer overflow",
        "body": "GIMP is vulnerable to a buffer overflow, caused by improper bounds checking by the set_color_table in the SUNRAS plugin. By creating a specially-crafted .RAS file, a remote attacker could overflow a buffer and execute arbitrary code on the system or cause the application to crash, if the attacker could persuade the victim to open the malicious file.For Gentoo Linux:Refer to GLSA 200705-08 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux (gimp):Refer to USN-467-1 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux:Refer to RHSA-2007:0343 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (gimp):Refer to MDKSA-2007:108 for patch, upgrade, or suggested workaround information. See References.For Turbolinux (gimp):Refer to TLSA-2007-34 for patch, upgrade, or suggested workaround information. See References.For other distributions:Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2007-2365": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33956",
        "title": "Multiple Adobe products .PNG file buffer overflow",
        "body": "Multiple Adobe products including Photoshop CS2/CS3, Photoshop Elements and Corel Paint Shop Pro are vulnerable to a stack-based buffer overflow, caused by improper bounds checking by the PNG.8BI Photoshop Format Plugin. By creating a specially-crafted .PNG file, a remote attacker could overflow a buffer and execute arbitrary code on the system or cause the application to crash, if the attacker could persuade the victim to open the malicious file.Refer to APSB07-13, APSB07-16, and APSB07-17 for patch, upgrade, or suggested workaround information. See References."
      }
    ],
    "CVE-2007-2391": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34847",
        "title": "Apple Safari setTimeout cross-domain security bypass",
        "body": "Apple Safari could allow a remote attacker to bypass cross-domain security restrictions. By persuading a victim to visit a specially-crafted Web page containing a windows.setTimeout JavaScript function, an attacker could exploit this vulnerability to spoof Web content or conduct phishing attacks.Apply APPLE-SA-2007-06-14, available from the Apple Web site. See References."
      }
    ],
    "CVE-2007-2401": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/35017",
        "title": "Apple Mac OS X XMLHttpRequest HTTP header injection",
        "body": "Apple Mac OS X is vulnerable to header injection, caused by improper validation of user-supplied input by headers passed to the XMLHttpRequest. By persuading a victim to visit a specially-crafted Web page, a remote attacker could exploit this vulnerability to inject arbitrary HTTP requests, which will allow the attacker to conduct various attacks against the vulnerable system, including cross-site scripting, cache poisoning or session hijacking.Apply Apple Security Update 2007-006, available from the Apple Web site. See References.For iPhone:Refer to APPLE Article ID: 306173 for patch, upgrade, or suggested workaround information. See References."
      }
    ],
    "CVE-2007-2402": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/35361",
        "title": "Apple QuickTime Java applet information disclosure",
        "body": "Apple QuickTime could allow a remote attacker to obtain sensitive information, caused by a design error in the QuickTime for Java. By persuading a victim to visit a specially-crafted Web site, a remote attacker could exploit this vulnerability to capture the user's screen content and obtain sensitive information.Upgrade to the latest version of Apple QuickTime (7.2 or later), available from the Apple Web site. See References."
      }
    ],
    "CVE-2007-2408": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/35714",
        "title": "Apple Safari Java applet security bypass",
        "body": "Apple Safari could allow a remote attacker to bypass security restrictions, caused by a vulnerability within the handling of the \"Enable Java\" preference. By persuading a victim to visit a specially-crafted Web page, a remote attacker could exploit this vulnerability to load and run the applet, even when Java is disabled.Upgrade to the latest version of Apple Safari (3.0.3 beta or later), available from the Apple Safari Web site. See References.For Mac OS:Apply Apple Security Update 2007-007, available from the Apple Web site. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-2415": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33967",
        "title": "Pi3Web HTTP Server HTTP request denial of service",
        "body": "Pi3Web HTTP Server is vulnerable to a denial of service when handling HTTP requests. By sending an overly long specially-crafted HTTP request composed of multiple \"\\A\" characters, a remote attacker could exploit this vulnerability to cause a denial of service.Upgrade to the latest version of Pi3Web (PL2 or later), available from the Pi3 Web page. See References."
      }
    ],
    "CVE-2007-2418": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34059",
        "title": "Trillian Pro Rendezvous XMPP HTML buffer overflow",
        "body": "Trillian Pro is vulnerable to a heap-based buffer overflow, caused by improper bounds checking by the Rendezvous / Extensible Messaging and Presence Protocol (XMPP) module when decoding HTML. By sending a specially-crafted message, a remote attacker could overflow a buffer and execute arbitrary code on the system.Upgrade to the latest version of Trillian (3.1.5.1 or later), available from the Trillian Web site. See References."
      }
    ],
    "CVE-2007-2428": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34443",
        "title": "Ahhp-Portal page.php file include",
        "body": "Ahhp-Portal could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the page.php script using the fp or the sc parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2435": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33984",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-2446": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34316",
        "title": "Samba lsa_io_trans_names buffer overflow",
        "body": "Samba is vulnerable to a heap-based buffer overflow, caused by improper bounds checking by the lsa_io_trans_names function. By sending a specially-crafted RPC request to the LSA RPC interface, a remote attacker could overflow a buffer and execute arbitrary code on the system.Apply the patch for this vulnerability or upgrade to the latest version of Samba (3.0.25 or later), available from the Samba Web site. See References.For VMware ESX 3.0.1:Apply Patch Bundle ESX-1001213, available from the VMware Web site. See References.For VMware ESX 3.0.0:Apply Patch Bundle ESX-1001204, available from the VMware Web site. See References.For VMware ESX 2.5.4:Upgrade to the latest version of VMware ESX (patch 10 Build 53326 or later), available from the VMware Web site. See References.For VMware ESX 2.5.3:Upgrade to the latest version of VMware ESX (patch 13 Build 52488 or later), available from the VMware Web site. See References.For VMware ESX 2.1.3:Upgrade to the latest version of VMware ESX (patch 8 Build 53228 or later), available from the VMware Web site. See References.For VMware ESX 2.0.2:Upgrade to the latest version of VMware ESX (patch 8 Build 52650 or later), available from the VMware Web site. See References.For Mac OS:Apply Apple Security Update 2007-007, available from the Apple Web site. See References.For Hewlett-Packard (Samba):Refer to HPSBTU02218 SSRT071424 for patch, upgrade, or suggested workaround information. See References.For Hewlett-Packard (Samba):Refer to HPSBUX02218 SSRT071424 for patch, upgrade, or suggested workaround information. See References.For Debian GNU/Linux (samba):Refer to DSA-1291-1 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux (samba):Refer to USN-460-1 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (samba):Refer to MDKSA-2007:104 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux:Refer to RHSA-2007:0354-4 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (samba):Refer to GLSA 200705-15 for patch, upgrade, or suggested workaround information. See References.For Solaris (samba):Refer to Sun Alert ID: 102964 for patch, upgrade, or suggested workaround information. See References.For Tru64 UNIX:Refer to BugTraq Mailing List, Tue Jul 10 2007 - 07:53:45 CDT for patch, upgrade, or suggested workaround information. See References.For Turbolinux (samba):Refer to TLSA-2007-35 for patch, upgrade, or suggested workaround information. See References.For other distributions:Apply the appropriate update for your system. See References."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34314",
        "title": "Samba sec_io_acl buffer overflow",
        "body": "Samba is vulnerable to a heap-based buffer overflow, caused by improper bounds checking by the sec_io_acl function. By sending a specially-crafted RPC request to the SRVSVC RPC interface, a remote attacker could overflow a buffer and execute arbitrary code on the system.Apply the patch for this vulnerability or upgrade to the latest version of Samba (3.0.25 or later), available from the Samba Web site. See References.For VMware ESX 3.0.1:Apply Patch Bundle ESX-1001213, available from the VMware Web site. See References.For VMware ESX 3.0.0:Apply Patch Bundle ESX-1001204, available from the VMware Web site. See References.For VMware ESX 2.5.4:Upgrade to the latest version of VMware ESX (patch 10 Build 53326 or later), available from the VMware Web site. See References.For VMware ESX 2.5.3:Upgrade to the latest version of VMware ESX (patch 13 Build 52488 or later), available from the VMware Web site. See References.For VMware ESX 2.1.3:Upgrade to the latest version of VMware ESX (patch 8 Build 53228 or later), available from the VMware Web site. See References.For VMware ESX 2.0.2:Upgrade to the latest version of VMware ESX (patch 8 Build 52650 or later), available from the VMware Web site. See References.For Mac OS:Apply Apple Security Update 2007-007, available from the Apple Web site. See References.For Hewlett-Packard (Samba):Refer to HPSBTU02218 SSRT071424 for patch, upgrade, or suggested workaround information. See References.For Hewlett-Packard (Samba):Refer to HPSBUX02218 SSRT071424 for patch, upgrade, or suggested workaround information. See References.For Debian GNU/Linux (samba):Refer to DSA-1291-1 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux (samba):Refer to USN-460-1 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (samba):Refer to MDKSA-2007:104 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux:Refer to RHSA-2007:0354-4 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (samba):Refer to GLSA 200705-15 for patch, upgrade, or suggested workaround information. See References.For Solaris (samba):Refer to Sun Alert ID: 102964 for patch, upgrade, or suggested workaround information. See References.For Tru64 UNIX:Refer to BugTraq Mailing List, Tue Jul 10 2007 - 07:53:45 CDT for patch, upgrade, or suggested workaround information. See References.For Turbolinux (samba):Refer to TLSA-2007-35 for patch, upgrade, or suggested workaround information. See References.For other distributions:Apply the appropriate update for your system. See References."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34312",
        "title": "Samba smb_io_notify_option_type_data buffer overflow",
        "body": "Samba is vulnerable to a heap-based buffer overflow, caused by improper bounds checking by the mb_io_notify_option_type_data function. By sending a specially-crafted RPC request to the SPOOLSS RPC interface, a remote attacker could overflow a buffer and execute arbitrary code on the system.Apply the patch for this vulnerability or upgrade to the latest version of Samba (3.0.25 or later), available from the Samba Web site. See References.For VMware ESX 3.0.1:Apply Patch Bundle ESX-1001213, available from the VMware Web site. See References.For VMware ESX 3.0.0:Apply Patch Bundle ESX-1001204, available from the VMware Web site. See References.For VMware ESX 2.5.4:Upgrade to the latest version of VMware ESX (patch 10 Build 53326 or later), available from the VMware Web site. See References.For VMware ESX 2.5.3:Upgrade to the latest version of VMware ESX (patch 13 Build 52488 or later), available from the VMware Web site. See References.For VMware ESX 2.1.3:Upgrade to the latest version of VMware ESX (patch 8 Build 53228 or later), available from the VMware Web site. See References.For VMware ESX 2.0.2:Upgrade to the latest version of VMware ESX (patch 8 Build 52650 or later), available from the VMware Web site. See References.For Mac OS:Apply Apple Security Update 2007-007, available from the Apple Web site. See References.For Hewlett-Packard (Samba):Refer to HPSBTU02218 SSRT071424 for patch, upgrade, or suggested workaround information. See References.For Hewlett-Packard (Samba):Refer to HPSBUX02218 SSRT071424 for patch, upgrade, or suggested workaround information. See References.For Debian GNU/Linux (samba):Refer to DSA-1291-1 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux (samba):Refer to USN-460-1 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (samba):Refer to MDKSA-2007:104 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux:Refer to RHSA-2007:0354-4 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (samba):Refer to GLSA 200705-15 for patch, upgrade, or suggested workaround information. See References.For Solaris (samba):Refer to Sun Alert ID: 102964 for patch, upgrade, or suggested workaround information. See References.For Tru64 UNIX:Refer to BugTraq Mailing List, Tue Jul 10 2007 - 07:53:45 CDT for patch, upgrade, or suggested workaround information. See References.For Turbolinux (samba):Refer to TLSA-2007-35 for patch, upgrade, or suggested workaround information. See References.For other distributions:Apply the appropriate update for your system. See References."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34311",
        "title": "Samba netdfs_io_dfs_EnumInfo_d buffer overflow",
        "body": "Samba is vulnerable to a heap-based buffer overflow, caused by improper bounds checking by the netdfs_io_dfs_EnumInfo_d function. By sending a specially-crafted RPC request to the DFS RPC interface, a remote attacker could overflow a buffer and execute arbitrary code on the system.Apply the patch for this vulnerability or upgrade to the latest version of Samba (3.0.25 or later), available from the Samba Web site. See References.For VMware ESX 3.0.1:Apply Patch Bundle ESX-1001213, available from the VMware Web site. See References.For VMware ESX 3.0.0:Apply Patch Bundle ESX-1001204, available from the VMware Web site. See References.For VMware ESX 2.5.4:Upgrade to the latest version of VMware ESX (patch 10 Build 53326 or later), available from the VMware Web site. See References.For VMware ESX 2.5.3:Upgrade to the latest version of VMware ESX (patch 13 Build 52488 or later), available from the VMware Web site. See References.For VMware ESX 2.1.3:Upgrade to the latest version of VMware ESX (patch 8 Build 53228 or later), available from the VMware Web site. See References.For VMware ESX 2.0.2:Upgrade to the latest version of VMware ESX (patch 8 Build 52650 or later), available from the VMware Web site. See References.For Mac OS:Apply Apple Security Update 2007-007, available from the Apple Web site. See References.For Hewlett-Packard (Samba):Refer to HPSBTU02218 SSRT071424 for patch, upgrade, or suggested workaround information. See References.For Hewlett-Packard (Samba):Refer to HPSBUX02218 SSRT071424 for patch, upgrade, or suggested workaround information. See References.For Debian GNU/Linux (samba):Refer to DSA-1291-1 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux (samba):Refer to USN-460-1 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (samba):Refer to MDKSA-2007:104 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux:Refer to RHSA-2007:0354-4 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (samba):Refer to GLSA 200705-15 for patch, upgrade, or suggested workaround information. See References.For Solaris (samba):Refer to Sun Alert ID: 102964 for patch, upgrade, or suggested workaround information. See References.For Tru64 UNIX:Refer to BugTraq Mailing List, Tue Jul 10 2007 - 07:53:45 CDT for patch, upgrade, or suggested workaround information. See References.For Turbolinux (samba):Refer to TLSA-2007-35 for patch, upgrade, or suggested workaround information. See References.For other distributions:Apply the appropriate update for your system. See References."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34309",
        "title": "Samba lsa_io_privilege_set buffer overflow",
        "body": "Samba is vulnerable to a heap-based buffer overflow, caused by improper bounds checking by the lsa_io_privilege_set function. By sending a specially-crafted RPC request to the LSA RPC interface, a remote attacker could overflow a buffer and execute arbitrary code on the system.Apply the patch for this vulnerability or upgrade to the latest version of Samba (3.0.25 or later), available from the Samba Web site. See References.For VMware ESX 3.0.1:Apply Patch Bundle ESX-1001213, available from the VMware Web site. See References.For VMware ESX 3.0.0:Apply Patch Bundle ESX-1001204, available from the VMware Web site. See References.For VMware ESX 2.5.4:Upgrade to the latest version of VMware ESX (patch 10 Build 53326 or later), available from the VMware Web site. See References.For VMware ESX 2.5.3:Upgrade to the latest version of VMware ESX (patch 13 Build 52488 or later), available from the VMware Web site. See References.For VMware ESX 2.1.3:Upgrade to the latest version of VMware ESX (patch 8 Build 53228 or later), available from the VMware Web site. See References.For VMware ESX 2.0.2:Upgrade to the latest version of VMware ESX (patch 8 Build 52650 or later), available from the VMware Web site. See References.For Mac OS:Apply Apple Security Update 2007-007, available from the Apple Web site. See References.For Hewlett-Packard (Samba):Refer to HPSBTU02218 SSRT071424 for patch, upgrade, or suggested workaround information. See References.For Hewlett-Packard (Samba):Refer to HPSBUX02218 SSRT071424 for patch, upgrade, or suggested workaround information. See References.For Debian GNU/Linux (samba):Refer to DSA-1291-1 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux (samba):Refer to USN-460-1 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (samba):Refer to MDKSA-2007:104 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux:Refer to RHSA-2007:0354-4 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (samba):Refer to GLSA 200705-15 for patch, upgrade, or suggested workaround information. See References.For Solaris (samba):Refer to Sun Alert ID: 102964 for patch, upgrade, or suggested workaround information. See References.For Tru64 UNIX:Refer to BugTraq Mailing List, Tue Jul 10 2007 - 07:53:45 CDT for patch, upgrade, or suggested workaround information. See References.For Turbolinux (samba):Refer to TLSA-2007-35 for patch, upgrade, or suggested workaround information. See References.For other distributions:Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2007-2450": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34868",
        "title": "Apache Tomcat Manager and Host Manager cross-site scripting",
        "body": "Apache Tomcat is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the Manager and Host Manager Web forms. A remote attacker could exploit this vulnerability using the filename parameter to inject malicious script into a Web page which would be executed in a victim's Web browser within the security context of the hosting Web site, once the page is viewed. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Upgrade to the latest version of Apache Tomcat (6.0.HEAD, 5.5.HEAD, 5.0.HEAD, or 4.1.HEAD or later), available from the Apache Tomcat Web site. See References.For Red Hat Linux (tomcat):Refer to RHSA-2007:0569 for patch, upgrade, or suggested workaround information. See References.For other distributions:Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2007-2458": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33662",
        "title": "Pixaria Gallery cfg[sys][base_path] parameter file include",
        "body": "Pixaria Gallery could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the class.Smarty.php script or various other scripts using the cfg[sys][base_path] parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.Upgrade to the latest version of Pixaria Gallery (1.4.3 or later), available from the Pixaria Gallery Web site. See References."
      }
    ],
    "CVE-2007-2459": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34010",
        "title": "Imager Perl extension BMP file buffer overflow",
        "body": "The Imager extension for Perl is vulnerable to a buffer overflow, caused by improper bounds checking by the read_4bit_bmp() and read_8bit_bmp() functions. By creating a malicious BMP image file and persuading a victim to open the file, a remote attacker could overflow a buffer and execute arbitrary code on the system or cause the application to crash.Upgrade to the latest version of Imager (0.57 or later), available from the Imager Web page. See References."
      }
    ],
    "CVE-2007-2479": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33983",
        "title": "Trillian CTCP PING information disclosure",
        "body": "Trillian could allow a remote attacker to obtain sensitive information, caused by an error in the IRC module. An attacker could exploit this vulnerability by sending an overly long UTF-8 encoded CTCP PING message to obtain sensitive information.Upgrade to the latest version of Trillian (3.1.5.0 or later), available from the Trillian Web site. See References."
      }
    ],
    "CVE-2007-2508": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34163",
        "title": "Trend Micro ServerProtect EarthAgent.exe buffer overflow",
        "body": "Trend Micro ServerProtect is vulnerable to a stack-based buffer overflow, caused by improper bounds checking by the RPCFN_EVENTBACK_Online() function in the EarthAgent.exe daemon. By sending a specially-crafted RPC request to TCP port 3628, a remote attacker could overflow a buffer and execute arbitrary code on the system with elevated privileges.Apply the patch for this vulnerability (ServerProtect 5.58 for Windows Security Patch 3 - Build 1176), available from the Trend Micro Web site. See References."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34162",
        "title": "Trend Micro ServerProtect AgRpcCln.dll buffer overflow",
        "body": "Trend Micro ServerProtect is vulnerable to a stack-based buffer overflow, caused by improper bounds checking by the CAgRpcClient::CreateBinding() function in the AgRpcCln.dll library. By sending a specially-crafted RPC request to TCP port 5168, a remote attacker could overflow a buffer and execute arbitrary code on the system with elevated privileges.Apply the patch for this vulnerability (ServerProtect 5.58 for Windows Security Patch 3 - Build 1176), available from the Trend Micro Web site. See References."
      }
    ],
    "CVE-2007-2509": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34413",
        "title": "PHP ftp_putcmd() function CRLF injection",
        "body": "PHP is vulnerable to CRLF injection, caused by improper validation of user-supplied input by the ftp_putcmd() function. A remote attacker could inject arbitrary FTP commands using CRLF sequences, which will allow the attacker to conduct various attacks against the vulnerable system, including cross-site scripting, cache poisoning or session hijacking.Upgrade to the latest version of PHP (5.2.2 or 4.4.7 or later), available from the PHP Web site. See References.For Mandriva Linux:Refer to MDKSA-2007:102 and MDKSA-2007:103 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-462-1 for patch, upgrade, or suggested workaround information. See References.For Debian GNU/Linux (php4):Refer to DSA-1296 for patch, upgrade, or suggested workaround information. See References.For Debian GNU/Linux (php5):Refer to DSA-1295 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (PHP):Refer to GLSA 200705-19 for patch, upgrade, or suggested workaround information. See References.For Avaya (PHP):Refer to ASA-2007-231 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-2521": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34073",
        "title": "E-GADS! common.php file include",
        "body": "E-GADS! could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the common.php script using the locale parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.Upgrade to the latest version of E-GADS! (2.2.7 or later), available from the E-GADS! Web site. See References."
      }
    ],
    "CVE-2007-2522": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34204",
        "title": "Multiple Computer Associates (CA) products Console Server buffer overflow",
        "body": "Multiple Computer Associates (CA) Anti-Virus and Anti-Spyware products are vulnerable to a stack-based buffer overflow, caused by improper bounds checking of the Console Server login credentials by the inoweb service. By attempting to log in using an overly long username or password, a remote attacker could overflow a buffer and execute arbitrary code on the system with elevated privileges or cause the application to crash.Refer to the CA SupportConnect Security Notice 050807 for patch or upgrade information. See References."
      }
    ],
    "CVE-2007-2524": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34164",
        "title": "OTRS (Open Ticket Request System) index.pl cross-site scripting",
        "body": "OTRS is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the index.pl script. A remote attacker could exploit this vulnerability using the Subaction parameter in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Upgrade to the latest version of OTRS available from the OTRS Web site. See References.For Debian GNU/Linux (otrs2):Refer to DSA-1298 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-2571": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34101",
        "title": "Xoops WF-Quote Module index.php SQL injection",
        "body": "The Xoops WF-Quote Module is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the index.php script using the \"c\" parameter, which could allow the attacker to view, add, modify or delete information in the back-end database.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2572": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34103",
        "title": "NoAh mfa_theme.php file include",
        "body": "NoAh The PHP Content Architect could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the mfa_theme.php script using the tpls[1] parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2575": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34112",
        "title": "Gallery Watermark module watermark.php file include",
        "body": "The Gallery Watermark module could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the watermark.php script using the GALLERY_BASEDIR parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2581": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34343",
        "title": "Microsoft SharePoint Server default.aspx PATH_INFO cross-site scripting",
        "body": "Microsoft SharePoint Server is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the default.aspx script. A remote attacker could exploit this vulnerability using the PATH_INFO string to inject malicious script into a Web page which would be executed in a victim's Web browser within the security context of the hosting Web site, once the page is viewed. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Apply the appropriate patch for your system, as listed in the latest Microsoft Security Bulletin. See References.— OR —Use Microsoft Automatic Update if it is supported by your operating system. The original bulletin issued by Microsoft has been superseded."
      }
    ],
    "CVE-2007-2582": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34184",
        "title": "IBM DB2 Universal Database DB2 JDBC Applet Server buffer overflow",
        "body": "IBM DB2 Universal Database is vulnerable to a buffer overflow, caused by improper bounds checking by the DB2 JDBC Applet Server. By sending a specially-crafted request, a remote attacker could overflow a buffer and execute arbitrary code on the system or cause the server to crash.Apply the patch for your system, as listed in IBM APAR IY97750. See References."
      }
    ],
    "CVE-2007-2583": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34232",
        "title": "MySQL IF clause denial of service",
        "body": "MySQL is vulnerable to a denial of service, caused by a divide-by-zero error in IF clauses. By sending a specially-crafted IF clause, an authenticated remote attacker could cause the server to crash.Upgrade to the latest version of MySQL (5.0.40 or later), available from the MySQL Web site. See References.For Mandriva Linux (MySQL):Refer to MDKSA-2007:139 for patch, upgrade, or suggested workaround information. See References.For other distributions:Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2007-2589": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34219",
        "title": "SquirrelMail compose.php cross-site request forgery",
        "body": "SquirrelMail is vulnerable to a cross-site request forgery, caused by improper validation of user-supplied input by the compose.php script. A remote attacker could exploit this vulnerability by sending a specially-crafted email within an IMG tag, which would allow the attacker to perform cross-site scripting attacks, Web cache poisoning, and other malicious activity, if the attacker could persuade the victim to open the malicious email message.Upgrade to the latest version of SquirrelMail (1.4.10 or later), available from Sourceforge.net. See References.For Debian GNU/Linux (squirrelmail):Refer to DSA-1290-1 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (squirrelmail):Refer to RHSA-2007:0358 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux:Refer to MDKSA-2007:106 for patch, upgrade, or suggested workaround information. See References.For Mac OS:Apply Apple Security Update 2007-007, available from the Apple Web site. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-2609": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34174",
        "title": "GNU EDU ETCDIR and LIBSDIR file include",
        "body": "GNU EDU could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to the lom.php, lom_update.php, check-lom.php, or weigh_keywords.php scripts using the ETCDIR parameter or to the logout.php, help.php, index.php, or login.php scripts using the LIBSDIR parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2666": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34372",
        "title": "Scintilla RB buffer overflow",
        "body": "Scintilla is vulnerable to a stack-based buffer overflow, caused by improper bounds checking by the LexRuby.cxx module when processing RB ruby source files. By creating a specially-crafted .RB file, a remote attacker could overflow a buffer and execute arbitrary code on the system or cause the application to crash, if the attacker could persuade the victim to open the malicious file.Upgrade to the latest version of Scintilla (CVS 1.13 or later), available from the SourceForge.net Repository Web site. See References."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34269",
        "title": "Notepad++ RB file buffer overflow",
        "body": "Notepad++ is vulnerable to a stack-based buffer overflow, caused by improper bounds checking by the SciLexer module when processing RB ruby source files. By creating a specially-crafted .RB file, a remote attacker could overflow a buffer and execute arbitrary code on the system or cause the application to crash, if the attacker could persuade the victim to open the malicious file.Upgrade to the latest version of Notepad++ (4.1.2 or later), available from the Notepad++ Web site. See References."
      }
    ],
    "CVE-2007-2673": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34040",
        "title": "Censura vendorid parameter SQL injection",
        "body": "Censura is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the censura.php script using the vendorid parameter, which could allow the attacker to view, add, modify or delete information in the back-end database.Upgrade to the latest version of Censura (1.16.04 or later), available from the Censura Web site. See References."
      }
    ],
    "CVE-2007-2719": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34303",
        "title": "HP Systems Insight Manager JSESSIONID session hijacking",
        "body": "HP Systems Insight Manager could allow a remote attacker to hijack an administrator's session, caused by the improper handling of session data. An attacker could exploit this vulnerability by creating a specially-crafted Web page containing a malicious JSESSIONID cookie value to hijack an administrator's session and gain complete administrative control, if the attacker could persuade the victim to visit a malicious Web page and login to the affected application.Refer to HPSBMA02213 SSRT061214 for patch, upgrade, or suggested workaround information. See References."
      }
    ],
    "CVE-2007-2741": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34331",
        "title": "Little cms ICC profile buffer overflow",
        "body": "Little cms is vulnerable to a stack-based buffer overflow, caused by improper bounds checking by the embedded ICC profile image parser. By creating a specially-crafted JPEG image with an ICC profile, a remote attacker could execute arbitrary code on the system or cause the application to crash if the attacker could persuade the victim to view the malicious image.Update to the latest version of Little cms (1.15 or later), available from the Little cms Web site. See References.For other distributions:Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2007-2745": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34358",
        "title": "Vdeck printcal.pl cross-site scripting",
        "body": "Vdeck is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the printcal.pl script. A remote attacker could exploit this vulnerability using the type parameter in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2764": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34495",
        "title": "Sun Brocade SilkWorm embedded Linux kernel denial of service",
        "body": "Multiple Sun Brocade SilkWorm switches are vulnerable to a denial of service, caused by improper handling of user-created kernel processes by the embedded Linux kernel. A local attacker could exploit this vulnerability using unspecified attack vectors to cause the device to reboot.Refer to Sun Alert ID: 102752 for patch, upgrade, or suggested workaround information. See References."
      }
    ],
    "CVE-2007-2780": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34366",
        "title": "PsychoStats server.php newtheme information disclosure",
        "body": "PsychoStats could allow a remote attacker to obtain sensitive information. An attacker could send a specially-crafted URL request to the server.php script using an invalid newtheme parameter to cause an error message to be returned containing the full installation path. An attacker could use this information to launch further attacks against the affected system.Apply the fix for this vulnerability (psychostats3.0.6b.zip), available from the PsychoStats Web site. See References."
      }
    ],
    "CVE-2007-2788": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34652",
        "title": "Sun Java Runtime Environment image parsing buffer overflow",
        "body": "Sun Java Runtime Environment (JRE) is vulnerable to a buffer overflow in the image parsing code. By persuading a victim to load a specially-crafted applet, a remote attacker could overflow a buffer and execute arbitrary code on the system with the privileges of the victim.Refer to Sun Alert ID: 102934 for patch, upgrade, or suggested workaround information. See References.For BEA Jrockit:Refer to BEA07-177.00 for patch, upgrade, or suggested workaround information. See References.Refer to HS07-028 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (BEA JRockit):Refer to GLSA 200709-15 for patch, upgrade, or suggested workaround information. See References.For other distributions:Apply the appropriate update for your system. See References."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34318",
        "title": "Sun Java Development Kit (JDK) ICC profile integer overflow",
        "body": "Sun Java Development Kit (JDK) is vulnerable to an integer overflow, caused by improper bounds checking by the embedded ICC profile image parser. By creating a specially-crafted JPEG or Bitmap image, a remote attacker could execute arbitrary code on the system if the attacker could persuade the victim to view the malicious image.Upgrade to the latest version of Sun JDK (1.5.0_07-b03 or 1.6.0_01-b06 or later), available from the Sun Microsystems Web site. See References.For Gentoo Linux (Sun JDK/JRE):Refer to GLSA 200705-23 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (emul-linux-x86-java):Refer to GLSA 200706-08 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (BEA JRockit):Refer to GLSA 200709-15 for patch, upgrade, or suggested workaround information. See References.For other distributions:Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2007-2789": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34654",
        "title": "Sun Java Runtime Environment Java Virtual Machine denial of service",
        "body": "Sun Java Runtime Environment (JRE) is vulnerable to a denial of service. By persuading a victim to load a specially-crafted applet, a remote attacker could cause the Java Virtual Machine to hang, resulting in a denial of service.Refer to Sun Alert ID: 102934 for patch, upgrade, or suggested workaround information. See References.For BEA Jrockit:Refer to BEA07-177.00 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (BEA JRockit):Refer to GLSA 200709-15 for patch, upgrade, or suggested workaround information. See References.For other distributions:Apply the appropriate update for your system. See References."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34320",
        "title": "Sun Java Development Kit (JDK) BMP image parser denial of service",
        "body": "Sun Java Development Kit (JDK) is vulnerable to a denial of service attack when the BMP image parser attempts to open local files on a Linux or Unix system while parsing BMP images. By creating a specially-crafted Bitmap image, a remote attacker could cause a denial of service if the attacker could persuade the victim to view the malicious image.Upgrade to the latest version of Sun JDK (1.5.0_07-b03 or 1.6.0_01-b06 or later), available from the Sun Microsystems Web site. See References.For Gentoo Linux (Sun JDK/JRE):Refer to GLSA 200705-23 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (emul-linux-x86-java):Refer to GLSA 200706-08 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (BEA JRockit):Refer to GLSA 200709-15 for patch, upgrade, or suggested workaround information. See References.For other distributions:Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2007-2798": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/35080",
        "title": "MIT Kerberos rename_principal_2_svc buffer overflow",
        "body": "Kerberos is vulnerable to a stack-based buffer overflow, caused by improper bounds checking by the kadmind server's rename_principal_2_svc function. By sending a specially-crafted request to rename principals, an authenticated remote attacker could overflow a buffer and execute arbitrary code on the system with root privileges.For VMware ESX 3.0.1:Apply Patch Bundle ESX-1001723, available from the VMware Web site. See References.For VMware ESX 3.0.0:Apply Patch Bundle ESX-1001212, available from the VMware Web site. See References.For VMware ESX 3.0.2:Apply Patch Bundle ESX-1001731, available from the VMware Web site. See References.For VMware ESX 2.5.4:Upgrade to the latest version of VMware ESX (patch 10 Build 53326 or later), available from the VMware Web site. See References.For VMware ESX 2.5.3:Upgrade to the latest version of VMware ESX (patch 13 Build 52488 or later), available from the VMware Web site. See References.For VMware ESX 2.1.3:Upgrade to the latest version of VMware ESX (patch 8 Build 53228 or later), available from the VMware Web site. See References.For VMware ESX 2.0.2:Upgrade to the latest version of VMware ESX (patch 8 Build 52650 or later), available from the VMware Web site. See References.For Mac OS:Apply Apple Security Update 2007-007, available from the Apple Web site. See References.Apply the patch for this vulnerability, as listed in MITKRB5-SA-2007-005. See References.For Novell:Refer to Novell Security Alert Document ID: 3675615 for patch, upgrade or suggested workaround information. See References.For Red Hat Linux:Refer to RHSA-2007:0562-2 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux:Refer to MDKSA-2007:137 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux:Refer to USN-477-1 for patch, upgrade, or suggested workaround information. See References.For Solaris (kadmind):Refer to Sun Alert ID: 102985 for patch, upgrade, or suggested workaround information. See References.For Debian/GNU Linux (krb5):Refer to DSA-1323-1 for patch, upgrade, or suggested workaround information. See References.For Gentoo Linux (MIT Kerberos):Refer to GLSA 200707-11 for patch, upgrade, or suggested workaround information. See References.For Turbolinux (krb5):Refer to TLSA-2007-42 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-2799": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34731",
        "title": "Christos Zoulas file assert function code execution",
        "body": "Christos Zoulas' file and applications implementing the program, such as AMaViS, could allow a remote attacker to execute arbitrary code on the system, caused by an integer overflow when handling overly large files. A remote attacker could exploit this vulnerability by creating a specially-crafted file to bypass the assert function and execute arbitrary code on the system with the victim's privileges, once the malicious file is opened.For Gentoo Linux:Refer to GLSA 200705-25 for patch, upgrade, or suggested workaround information. See References.For AMaViS:Refer to AMaViS Security Announcement ASA-2007-3 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux:Refer to RHSA-2007:0391 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux (file):Refer to USN-439-2 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (file):Refer to MDKSA-2007:114 for patch, upgrade, or suggested workaround information. See References.For Avaya systems installed on RHEL versions 4 and 5:Refer to ASA-2007-290 for patch, upgrade, or suggested workaround information. See References.For Debian Linux (file):Refer to DSA-1343-1 for patch, upgrade, or suggested workaround information. See References.For Mac OS X:Apply Security Update 2008-002, available from the Apple Web site. See References.For other distributions:Apply the appropriate upgrade for your system. See References."
      }
    ],
    "CVE-2007-2801": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/35121",
        "title": "eTicket open.php cross-site scripting",
        "body": "eTicket is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the open.php script. A remote attacker could exploit this vulnerability using the err or warn parameter in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2803": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34403",
        "title": "Vizayn Urun Tanitim Sitesi default.asp SQL injection",
        "body": "Vizayn Urun Tanitim Sitesi is vulnerable to SQL injection. If \"islem\" is set to \"haberdetay\" a remote attacker could send specially-crafted SQL statements to default.asp script using the id parameter, which could allow the attacker to view, add, modify or delete information in the back-end database.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2811": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34404",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-2816": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34402",
        "title": "On-line bookmarks manager root parameter file include",
        "body": "On-line bookmarks manager could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL request to multiple scripts using the root parameter to specify a malicious file from a remote system, which could allow the attacker to execute arbitrary code on the vulnerable Web server.Upgrade to the latest version of On-line bookmarks (0.7.5 or later), available from the SourceForge.net Web site. See References."
      }
    ],
    "CVE-2007-2827": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34437",
        "title": "LeadTools ISIS ActiveX control buffer overflow",
        "body": "The LeadTools ISIS ActiveX control (ltisi14E.ocx) is vulnerable to a buffer overflow. By persuading a victim to visit a specially-crafted Web page, a remote attacker could overflow a buffer and execute arbitrary code on the system or cause the victim's browser to crash.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2831": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34453",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-2834": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/36656",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-2836": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/35029",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-2846": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34501",
        "title": "avast! antivirus SIS buffer overflow",
        "body": "avast! antivirus is vulnerable to a heap-based buffer overflow, caused by improper bounds checking when parsing SIS files. By creating a specially-crafted SIS file, a remote attacker could overflow a buffer and execute arbitrary code on the system, if the attacker could persuade the victim to open the malicious file.Upgrade to the latest version of avast! antivirus (4.7.700 or later), available from the avast! antivirus Web site. See References."
      }
    ],
    "CVE-2007-2855": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34433",
        "title": "Dart ZipLite Compression ActiveX control buffer overflow",
        "body": "The Dart ZipLite Compression ActiveX control (DartZipLite.dll) is vulnerable to a buffer overflow. By creating a specially-crafted Web page, a remote attacker could overflow a buffer and execute arbitrary code on the system, if the attacker could persuade the victim to visit the Web page and enable the ActiveX control.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2856": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34520",
        "title": "PowerTCP ZIP Compression ActiveX control buffer overflow",
        "body": "The PowerTCP ZIP Compression ActiveX control (DartZip.dll) is vulnerable to a buffer overflow. By creating a specially-crafted Web page, a remote attacker could overflow a buffer and execute arbitrary code on the system, if the attacker could persuade the victim to visit the Web page and enable the ActiveX control.No remedy available as of September 1, 2014."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34494",
        "title": "PowerTCP Service ActiveX control buffer overflow",
        "body": "The PowerTCP Service ActiveX control (DartService.dll) is vulnerable to a buffer overflow. By creating a specially-crafted Web page, a remote attacker could overflow a buffer and execute arbitrary code on the system, if the attacker could persuade the victim to visit the Web page and enable the ActiveX control.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2867": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34604",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-2868": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34605",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-2872": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/39398",
        "title": "PHP chunk_split() security bypass",
        "body": "PHP could allow a remote attacker to bypass security restrictions, caused by an integer overflow error in the chunk_split() function. An attacker could exploit this vulnerability to bypass open_basedir or safe_mode restrictions and gain unauthorized access to the system.Upgrade to the latest version of PHP (4.4.8 or later), available from the PHP Web site. See References."
      }
    ],
    "CVE-2007-1171": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/32582",
        "title": "NukeSentinel nsbypass.php SQL injection",
        "body": "NukeSentinel is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the nsbypass.php script using the tid parameter, which could allow the attacker to view, add, modify or delete information in the back-end database.Upgrade to the latest version of NukeSentinel (2.5.12 or later), available from the NukeScripts Web site. See References."
      }
    ],
    "CVE-2007-1211": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/33258",
        "title": "Microsoft Windows GDI WMF image denial of service",
        "body": "Microsoft Windows is vulnerable to a denial of service attack, caused by an invalid memory reference that can occur when an application attempts to interpret a malformed Windows Metafile (WMF) image. By persuading a victim to visit a malicious Web site hosting a malformed WMF file, a remote attacker could cause the victim's system to stop responding and possibly restart.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS07-017. See References."
      }
    ],
    "CVE-2007-2052": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34060",
        "title": "Python _localemodule.c information disclosure",
        "body": "Python could allow a local attacker to obtain sensitive information, caused by an off-by-one error in the PyLocale_strxfrm function in Modules/_localemodule.c that could result in a memory leak. An attacker could exploit this vulnerability using an unspecified attack vector to read portions of memory.For Debian GNU/Linux:Apply the patch for this vulnerability, as listed in Debian Bug report logs - #416934. See References.For Mandriva Linux (python):Refer to MDKSA-2007:099 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-2875": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34779",
        "title": "Linux kernel cpuset_tasks_read function information disclosure",
        "body": "Linux kernel could allow a local attacker to obtain sensitive information, caused by an underflow error in the cpuset_tasks_read function. A local attacker could exploit this vulnerability to read kernel memory and obtain sensitive information.Upgrade to the latest version of the Linux kernel (2.6.20.13 or 2.6.21.4 or later), available from the Linux Kernel Web site. See References.For Ubuntu Linux (linux-source):Refer to USN-489-1 for patch, upgrade, or suggested workaround information. See References.For Mandriva Linux (kernel):Refer to MDKSA-2007:171 for patch, upgrade, or suggested workaround information. See References.For Ubuntu Linux (linux-source):Refer to USN-510-1 for patch, upgrade, or suggested workaround information. See References.For Debian GNU/Linux (linux):Refer to DSA-1363-1 for patch, upgrade, or suggested workaround information. See References.For Red Hat Linux (kernel):Refer to RHSA-2007:0705-2 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-2884": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34476",
        "title": "Microsoft Visual Basic Company Name buffer overflow",
        "body": "Microsoft Visual Basic is vulnerable to a stack-based buffer overflow, caused by improper bounds checking of Visual Basic Project (VBF) files. By creating a specially-crafted VBP file and persuading the victim to open the project description page and select company name, a remote attacker could overflow a buffer and execute arbitrary code on the system with elevated privileges or cause the application to consume all available CPU resources.No remedy available as of September 1, 2014."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34475",
        "title": "Microsoft Visual Basic project detail buffer overflow",
        "body": "Microsoft Visual Basic is vulnerable to a stack-based buffer overflow, caused by improper bounds checking. By creating a specially-crafted VBP file containing an overly long project detail field, a remote attacker could overflow a buffer and execute arbitrary code on the system or cause the application to crash, if the attacker could persuade the victim to open the malicious file.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2893": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34508",
        "title": "Bochs NE2000 buffer overflow",
        "body": "Bochs is vulnerable to a heap-based buffer overflow, caused by improper bounds checking by the emulated NE2000 device. By sending a large value in the TXCNT register, a local attacker could overflow a buffer and execute arbitrary code on the system with root privileges.For Debian GNU/Linux (bochs):Refer to DSA-1351-1 for patch, upgrade, or suggested workaround information. See References.For other distributions:Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2007-2898": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34471",
        "title": "2z project rating.php SQL injection",
        "body": "2z project is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the rating.php script using the rating or post_id parameter, which could allow the attacker to view, add, modify or delete information in the back-end database.Upgrade to the latest version of 2z project (0.9.5 or later), available from the 2z project Web site. See References."
      }
    ],
    "CVE-2007-2899": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34472",
        "title": "Navboard config.php code execution",
        "body": "Navboard could allow a remote attacker to execute arbitrary code on the system, caused by improper validation of user-supplied input by the config.php script. A remote attacker could exploit this vulnerability using various parameters to inject and execute arbitrary PHP code on the system with the privileges of the Web server.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2900": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34469",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-2914": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34439",
        "title": "PsychoStats multiple cross-site scripting",
        "body": "PsychoStats is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the awards.php, login.php, register.php, and weapons.php scripts. A remote attacker could exploit this vulnerability using unspecified parameters to inject malicious script into a Web page which would be executed in a victim's Web browser within the security context of the hosting Web site, once the page is viewed. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2931": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/36314",
        "title": "Microsoft MSN Messenger video conversations buffer overflow",
        "body": "Microsoft MSN Messenger is vulnerable to a heap-based buffer overflow, caused by the improper handling of video conversations. By persuading the victim to accept an incoming Web cam invitation and sending specially-crafted data, a remote attacker could overflow a buffer and execute arbitrary code on the system.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS07-054. See References.For Hewlett-Packard:Refer to HPSBST02260 SSRT071471 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-2952": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/44124",
        "title": "Blue Coat K9 Web Protection HTTP version buffer overflow",
        "body": "Blue Coat K9 Web Protection is vulnerable to multiple stack-based buffer overflows in the filter service (k9filter.exe). By sending a specially-crafted HTTP response containing overly long version information, a remote attacker could exploit this vulnerability to overflow a buffer and execute arbitrary code on the system or cause the service to crash. Note: In order to exploit this vulnerability, the attacker would need to perform DNS cache poisoning or use man-in-the-middle techniques to intercept a victim's request.No remedy available as of September 1, 2014."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/44123",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-2954": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/35824",
        "title": "Novell Client NWSPOOL.DLL buffer overflow",
        "body": "Novell Client is vulnerable to a stack-based buffer overflow, caused by improper bounds checking by the nwspool.dll library. By sending specially-crafted RPC requests to the RpcAddPrinterDriver and RpcGetPrinterDriverDirectory functions, a remote attacker could overflow a buffer and execute arbitrary code on the system or cause the system to crash.Refer to Novell Technical Information Document ID: 5005400 for patch, upgrade, or suggested workaround information. See References."
      }
    ],
    "CVE-2007-2957": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/38175",
        "title": "McAfee E-Business Server authentication packet buffer overflow",
        "body": "McAfee E-Business Server is vulnerable to a heap-based buffer overflow, caused by an integer overflow in the e-Business administration utility service. By sending a specially-crafted authentication packet with an overly large length value, a remote attacker from within the local network could exploit this vulnerability to overflow a buffer and execute arbitrary code on the vulnerable system.Upgrade to the latest version of McAfee E-Business Server (8.5.3 for Solaris or 8.1.2 for Linux/HP-UX/AIX or later), available from the McAfee Web site. See References."
      }
    ],
    "CVE-2007-2966": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34575",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-2967": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34581",
        "title": "Multiple F-Secure archive denial of service",
        "body": "Multiple F-Secure Anti-Virus applications are vulnerable to a denial of service. By creating a specially-crafted ARJ archive or FSG packed executable file, a remote attacker could exploit this vulnerability to cause the application to enter an infinite loop, resulting in a denial of service, if the attacker could persuade the victim to scan a malicious file.Refer to F-Secure Security Bulletin FSC-2007-3 for patch, upgrade, or suggested workaround information. See References."
      }
    ],
    "CVE-2007-2980": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34528",
        "title": "LeadTools Raster ISIS Object ActiveX control buffer overflow",
        "body": "The LeadTools Raster ISIS Object (LTRIS14e.DLL) ActiveX control is vulnerable to a buffer overflow, caused by improper bounds checking when handling the DriverName property. By creating a specially-crafted Web page containing a malicious DriverName property, a remote attacker could overflow a buffer and execute arbitrary code on the system, once the Web page is opened and the ActiveX control is enabled.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2981": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34525",
        "title": "LeadTools Raster OCR Document Object ActiveX control buffer overflow",
        "body": "The LeadTools Raster OCR Document Object Library (ltrdc14e.dll) ActiveX control is vulnerable to a buffer overflow, caused by improper bounds checking when handling the DictionaryFileName property. By creating a specially-crafted Web page containing a malicious DictionaryFileName property, a remote attacker could overflow a buffer and execute arbitrary code on the system, once the page is opened and the ActiveX control is enabled.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2983": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34589",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-2984": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34578",
        "title": "Media Technology Group CDPass.dll ActiveX control buffer overflow",
        "body": "The Media Technology Group (CDPass.dll) ActiveX control is vulnerable to multiple stack-based buffer overflows. By persuading a victim to visit a specially-crafted Web page, a remote attacker could overflow a buffer and execute arbitrary code on the system with the privileges of the user or cause the victim's browser to crash.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2985": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34592",
        "title": "Pheap edit.php code execution",
        "body": "Pheap could allow a remote attacker with knowlege of the Admin username to execute arbitrary code on the system, caused by a vulnerability in the edit.php script. A remote attacker could exploit this vulnerability by sending a specially-crafted URL request using the filename parameter to execute arbitrary PHP code on the system.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-2997": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34567",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2007-3008": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34854",
        "title": "Mbedthis AppWeb HTTP TRACE cross-site scripting",
        "body": "Mbedthis AppWeb is vulnerable to cross-site scripting, caused by improper validation of user-supplied input. If the HTTP TRACE method is enabled, a remote attacker could exploit this vulnerability using a specially-crafted HTTP TRACE request to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Upgrade to the latest version of Mbedthis AppWeb (12.2.2 or later) available from the Mbedthis Web site. See References."
      }
    ],
    "CVE-2007-3010": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/36632",
        "title": "Alcatel-Lucent Unified Maintenance Tool OmniPCX masterCGI command execution",
        "body": "The Alcatel-Lucent Unified Maintenance Tool shipped with OmniPCX Enterprise could allow a remote attacker to execute arbitrary commands on the system, caused by improper validation of user-supplied input by the masterCGI script. A remote attacker could inject arbitrary shell commands using the ping and user parameters separated by a semi-colon character (;) in a specially-crafted URL request to the OmniPCX Web interface, which would be executed on the system with the privileges of the Web application user.Refer to the Alcatel-Lucent Security Advisory for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2007-3040": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/35752",
        "title": "Microsoft Agent ActiveX control buffer overflow",
        "body": "The Microsoft Agent ActiveX control (agentdpv.dll) is vulnerable to a stack-based buffer overflow, caused by improper bounds checking by the Agent.Control function. By persuading a victim to visit a specially-crafted Web page, a remote attacker could overflow a buffer and execute arbitrary code on the system with the victim's privileges.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS07-051. See References.For Hewlett-Packard:Refer to HPSBST02260 SSRT071471 for patch, upgrade, or suggested workaround information. See References.For other distributions:Contact your vendor for upgrade or patch information."
      }
    ],
    "CVE-2007-3050": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34684",
        "title": "Chameleon CMS PHPSESSID session hijacking",
        "body": "Chameleon CMS could allow a remote attacker to hijack a valid user's session, caused by a vulnerability in the cookie variable, PHPSESSID. By setting the PHPSESSID variable to a fixed value, a remote attacker could hijack a victim's session once the victim logs into the application using the set PHPSESSID value.Apply patch (build 2085/17) for this vulnerability, available from the Chameleon Web site. See References."
      }
    ],
    "CVE-2007-3056": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34726",
        "title": "WebSVN filedetails.php cross-site scripting",
        "body": "WebSVN is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the filedetails.php script. A remote attacker could exploit this vulnerability using the path parameter in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Upgrade to the latest version of WebSVN (2.0 or later), available from the WebSVN Web site. See References."
      }
    ],
    "CVE-2007-3063": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34716",
        "title": "My DataBook diary.php SQL injection",
        "body": "My DataBook is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the diary.php script using various parameters, which could allow the attacker to view, add, modify or delete information in the back-end database.No remedy available as of September 1, 2014."
      }
    ],
    "CVE-2007-3064": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/34717",
        "title": "My DataBook diary.php cross-site scripting",
        "body": "My DataBook is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the diary.php script. A remote attacker could exploit this vulnerability using the year parameter in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of September 1, 2014."
      }
    ]
  }
}