{
  "year": 2007,
  "total": 19,
  "reference": "docs.microsoft.com",
  "reports": {
    "CVE-2007-0025": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2007/ms07-012",
        "title": "Vulnerability in Microsoft MFC Could Allow Remote Code Execution (924667)",
        "body": "Who Should Read this Document: Customers who use Microsoft Windows Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Important Recommendation: Customers should apply the update at the earliest opportunity Security Update Replacement: None Caveats: Microsoft Knowledge Base Article 924667 documents the currently known issues that customers may experience when they install this security update. The article also documents recommended solutions for these issues. For more information, see Microsoft Knowledge Base Article 924667",
        "extra": "This update resolves a newly discovered, privately reported vulnerability. The vulnerability is documented in the \"Vulnerability Details\" section of this bulletin. An attacker who successfully exploited this vulnerability could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than users who operate with administrative user rights. Significant user interaction is required to exploit this vulnerability. We recommend that customers apply the update at the earliest opportunity."
      }
    ],
    "CVE-2007-0028": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2007/ms07-002",
        "title": "Vulnerabilities in Microsoft Excel Could Allow Remote Code Execution (927198)",
        "body": "Who Should Read this Document: Customers who use Microsoft Excel Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately Security Update Replacement: This bulletin replaces a prior security update. See the frequently asked questions (FAQ) section of this bulletin for the complete list. Caveats: Microsoft Knowledge Base Article 927198 documents the currently known issues that customers may experience when they install this security update. The article also documents recommended solutions for these issues. For more information, see Microsoft Knowledge Base Article 927198.",
        "extra": "This update resolves several newly discovered, privately reported vulnerabilities. Each vulnerability is documented in its own subsection in the \"Vulnerability Details\" section of this bulletin. An attacker who successfully exploited the most severe of these vulnerabilities could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. We recommend that customers apply the update immediately."
      }
    ],
    "CVE-2007-0034": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2007/ms07-003",
        "title": "Vulnerabilities in Microsoft Outlook Could Allow Remote Code Execution (925938)",
        "body": "Who Should Read this Document: Customers who use Microsoft Outlook Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately Security Update Replacement: This bulletin replaces a prior security update. See the frequently asked questions (FAQ) section of this bulletin for the complete list. Caveats: Microsoft Knowledge Base Article 925938 documents the currently known issues that customers may experience when they install this security update. The article also documents recommended solutions for these issues. For more information, see Microsoft Knowledge Base Article 925938.",
        "extra": "This update addresses several newly discovered, privately and publicly reported vulnerabilities. The vulnerabilities are documented in the “Vulnerability Details” section of this bulletin. When using vulnerable versions of Office, if a user is logged on with administrative user rights, an attacker who successfully exploited these vulnerabilities could take complete control of the system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than users who operate with administrative user rights. We recommend that customers apply the update immediately."
      }
    ],
    "CVE-2007-0035": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2007/ms07-024",
        "title": "Vulnerabilities in Microsoft Word Could Allow Remote Code Execution (934232)",
        "body": "Who Should Read this Document: Customers who use Microsoft Word Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately Security Update Replacement: This bulletin replaces a prior security update. See the Frequently Asked Questions (FAQ) section of this bulletin for details. Caveats: None",
        "extra": "This update resolves several newly discovered, privately and publicly reported vulnerabilities. Each vulnerability is documented in its own subsection in the Vulnerability Details section of this bulletin. We recommend that customers apply the update immediately."
      }
    ],
    "CVE-2007-0038": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2007/ms07-017",
        "title": "Vulnerabilities in GDI Could Allow Remote Code Execution (925902)",
        "body": "Who Should Read this Document: Customers who use Microsoft Windows Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately Security Update Replacement: This bulletin replaces a prior security update. See the Frequently Asked Questions (FAQ) section of this bulletin for details. Caveats: Microsoft Knowledge Base Article 925902 documents the currently known issues that customers may experience when they install this security update. The article also documents recommended solutions for these issues. For more information, see Microsoft Knowledge Base Article 925902",
        "extra": "This update resolves several newly discovered, publicly disclosed and privately reported vulnerabilities as well as additional issues discovered through internal investigations. Each vulnerability is documented in its own subsection in the Vulnerability Details section of this bulletin. An attacker who successfully exploited the most severe of these vulnerabilities could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Note The Windows Animated Cursor Remote Code Execution Vulnerability - CVE-2007-0038 is currently being exploited and was previously discussed by Microsoft Security Advisory 935423."
      }
    ],
    "CVE-2007-0039": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2007/ms07-026",
        "title": "Vulnerabilities in Microsoft Exchange Could Allow Remote Code Execution (931832)",
        "body": "Who Should Read this Document: Customers who use Microsoft Exchange Server Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately Security Update Replacement: This bulletin replaces two prior security updates. See the Frequently Asked Questions (FAQ) section of this bulletin for details.",
        "extra": "This update resolves several newly discovered**,** privately reported vulnerabilities. Each vulnerability is documented in its own subsection in the Vulnerability Details section of this bulletin. An attacker who successfully exploited the most severe of these vulnerabilities could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. We recommend that customers apply the update immediately."
      }
    ],
    "CVE-2007-0208": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2007/ms07-014",
        "title": "Vulnerabilities in Microsoft Word Could Allow Remote Code Execution (929434)",
        "body": "Who Should Read this Document: Customers who use Microsoft Office or Microsoft Works Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately Security Update Replacement: This bulletin replaces a prior security update. See the frequently asked questions (FAQ) section of this bulletin for the complete list. Caveats: None",
        "extra": "This update resolves several newly discovered, privately and publicly reported vulnerabilities. Each vulnerability is documented in its own subsection in the \"Vulnerability Details\" section of this bulletin. If a user is logged on with administrative user rights, an attacker who successfully exploited this vulnerability could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than users who operate with administrative user rights. We recommend that customers apply the update immediately."
      }
    ],
    "CVE-2007-0209": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2007/ms07-014",
        "title": "Vulnerabilities in Microsoft Word Could Allow Remote Code Execution (929434)",
        "body": "Who Should Read this Document: Customers who use Microsoft Office or Microsoft Works Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately Security Update Replacement: This bulletin replaces a prior security update. See the frequently asked questions (FAQ) section of this bulletin for the complete list. Caveats: None",
        "extra": "This update resolves several newly discovered, privately and publicly reported vulnerabilities. Each vulnerability is documented in its own subsection in the \"Vulnerability Details\" section of this bulletin. If a user is logged on with administrative user rights, an attacker who successfully exploited this vulnerability could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than users who operate with administrative user rights. We recommend that customers apply the update immediately."
      }
    ],
    "CVE-2007-0213": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2007/ms07-026",
        "title": "Vulnerabilities in Microsoft Exchange Could Allow Remote Code Execution (931832)",
        "body": "Who Should Read this Document: Customers who use Microsoft Exchange Server Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately Security Update Replacement: This bulletin replaces two prior security updates. See the Frequently Asked Questions (FAQ) section of this bulletin for details.",
        "extra": "This update resolves several newly discovered**,** privately reported vulnerabilities. Each vulnerability is documented in its own subsection in the Vulnerability Details section of this bulletin. An attacker who successfully exploited the most severe of these vulnerabilities could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. We recommend that customers apply the update immediately."
      }
    ],
    "CVE-2007-0220": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2007/ms07-026",
        "title": "Vulnerabilities in Microsoft Exchange Could Allow Remote Code Execution (931832)",
        "body": "Who Should Read this Document: Customers who use Microsoft Exchange Server Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately Security Update Replacement: This bulletin replaces two prior security updates. See the Frequently Asked Questions (FAQ) section of this bulletin for details.",
        "extra": "This update resolves several newly discovered**,** privately reported vulnerabilities. Each vulnerability is documented in its own subsection in the Vulnerability Details section of this bulletin. An attacker who successfully exploited the most severe of these vulnerabilities could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. We recommend that customers apply the update immediately."
      }
    ],
    "CVE-2007-0221": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2007/ms07-026",
        "title": "Vulnerabilities in Microsoft Exchange Could Allow Remote Code Execution (931832)",
        "body": "Who Should Read this Document: Customers who use Microsoft Exchange Server Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately Security Update Replacement: This bulletin replaces two prior security updates. See the Frequently Asked Questions (FAQ) section of this bulletin for details.",
        "extra": "This update resolves several newly discovered**,** privately reported vulnerabilities. Each vulnerability is documented in its own subsection in the Vulnerability Details section of this bulletin. An attacker who successfully exploited the most severe of these vulnerabilities could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. We recommend that customers apply the update immediately."
      }
    ],
    "CVE-2007-0947": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2007/ms07-027",
        "title": "Cumulative Security Update for Internet Explorer (931768)",
        "body": "Who Should Read this Document: Customers who use Microsoft Windows Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately Security Update Replacement: This bulletin replaces several prior security updates. See the Frequently Asked Questions (FAQ) section of this bulletin for details. Caveats: Microsoft Knowledge Base Article 931768 documents the currently known issues that customers may experience when they install this security update. The article also documents recommended solutions for these issues. For more information, see Microsoft Knowledge Base Article 931768.",
        "extra": "This update resolves several newly discovered, privately reported and public vulnerabilities. Each vulnerability is documented in its own subsection in the Vulnerability Details section of this bulletin. If a user is logged on with administrative user rights, an attacker who successfully exploited the most severe of these vulnerabilities could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with the same user rights as the logged-on user. Users whose accounts are configured to have fewer user rights on the system could be less impacted than users who operate with administrative user rights. We recommend that customers apply the update immediately."
      }
    ],
    "CVE-2007-1202": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2007/ms07-024",
        "title": "Vulnerabilities in Microsoft Word Could Allow Remote Code Execution (934232)",
        "body": "Who Should Read this Document: Customers who use Microsoft Word Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately Security Update Replacement: This bulletin replaces a prior security update. See the Frequently Asked Questions (FAQ) section of this bulletin for details. Caveats: None",
        "extra": "This update resolves several newly discovered, privately and publicly reported vulnerabilities. Each vulnerability is documented in its own subsection in the Vulnerability Details section of this bulletin. We recommend that customers apply the update immediately."
      }
    ],
    "CVE-2007-1204": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2007/ms07-019",
        "title": "Vulnerability in Universal Plug and Play Could Allow Remote Code Execution (931261)",
        "body": "Who Should Read this Document: Customers who use Microsoft Windows Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately Security Update Replacement: None Caveats: None",
        "extra": "This update resolves a newly discovered, privately reported vulnerability. The vulnerability is documented in its own subsection in the Vulnerability Details section of this bulletin. We recommend that customers apply the update immediately."
      }
    ],
    "CVE-2007-1206": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2007/ms07-022",
        "title": "Vulnerability in Windows Kernel Could Allow Elevation of Privilege (931784)",
        "body": "Who Should Read this Document: Customers who use Microsoft Windows Impact of Vulnerability: Elevation of Privilege Maximum Severity Rating: Important Recommendation: Customers should apply the update at the earliest opportunity Security Update Replacement: This bulletin replaces a prior security update. See the Frequently Asked Questions (FAQ) section of this bulletin for details.",
        "extra": "This update resolves a newly discovered, privately reported vulnerability. The vulnerability is documented in its own subsection in the Vulnerability Details section of this bulletin. An attacker who successfully exploited this vulnerability could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. We recommend that customers apply the update at the earliest opportunity."
      }
    ],
    "CVE-2007-1211": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2007/ms07-017",
        "title": "Vulnerabilities in GDI Could Allow Remote Code Execution (925902)",
        "body": "Who Should Read this Document: Customers who use Microsoft Windows Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately Security Update Replacement: This bulletin replaces a prior security update. See the Frequently Asked Questions (FAQ) section of this bulletin for details. Caveats: Microsoft Knowledge Base Article 925902 documents the currently known issues that customers may experience when they install this security update. The article also documents recommended solutions for these issues. For more information, see Microsoft Knowledge Base Article 925902",
        "extra": "This update resolves several newly discovered, publicly disclosed and privately reported vulnerabilities as well as additional issues discovered through internal investigations. Each vulnerability is documented in its own subsection in the Vulnerability Details section of this bulletin. An attacker who successfully exploited the most severe of these vulnerabilities could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Note The Windows Animated Cursor Remote Code Execution Vulnerability - CVE-2007-0038 is currently being exploited and was previously discussed by Microsoft Security Advisory 935423."
      }
    ],
    "CVE-2007-1214": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2007/ms07-023",
        "title": "Vulnerabilities in Microsoft Excel Could Allow Remote Code Execution (934233)",
        "body": "Who Should Read this Document: Customers who use Microsoft Excel Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately Security Update Replacement: This bulletin replaces a prior security update. See the Frequently Asked Questions (FAQ) section of this bulletin for details. Caveats: Microsoft Knowledge Base Article 934233 documents the currently known issues that customers may experience when they install this security update. The article also documents recommended solutions for these issues. For more information, see Microsoft Knowledge Base Article 934233.",
        "extra": "This update resolves several newly discovered, privately reported vulnerabilities. Each vulnerability is documented in its own subsection in the Vulnerability Details section of this bulletin. We recommend that customers apply the update immediately."
      }
    ],
    "CVE-2007-1747": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2007/ms07-025",
        "title": "Vulnerability in Microsoft Office Could Allow Remote Code Execution (934873)",
        "body": "Who Should Read this Document: Customers who use Microsoft Office Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately Security Update Replacement: This bulletin replaces a prior security update. See the Frequently Asked Questions (FAQ) section of this bulletin for details. Caveats: Microsoft Knowledge Base Article 934873 documents the currently known issues that customers may experience when they install this security update. The article also documents recommended solutions for these issues. For more information, see Microsoft Knowledge Base Article 934873.",
        "extra": "This update resolves a privately reported vulnerability. The vulnerability is documented in its own subsection in the Vulnerability Details section of this bulletin. An attacker who successfully exploited this vulnerability could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. When using vulnerable versions of Office, if a user is logged on with administrative user rights, an attacker who successfully exploited this vulnerability could take complete control of the system. An attacker could then install programs; view, change, or delete data; or create new accounts with the same user rights as the logged-on user. Users whose accounts are configured to have fewer user rights on the system could be less impacted than users who operate with administrative user rights. We recommend that customers apply the update immediately.Severity Ratings and Vulnerability Identifiers: Vulnerability IdentifiersImpact of VulnerabilityMicrosoft Office 2000 Service Pack 3Microsoft Office XP Service Pack 3Microsoft Office 2003 Service Pack 22007 Microsoft Office SystemMicrosoft Office 2004 for MacDrawing Object Vulnerability - CVE-2007-1747Remote Code ExecutionCriticalImportantImportantImportantImportant This assessment is based on the types of systems that are affected by the vulnerability, their typical deployment patterns, and the effect that exploiting the vulnerability would have on them. Frequently Asked Questions (FAQ) Related to This Security Update What are the known issues that customers may experience when they install this security update?Microsoft Knowledge Base Article 934873 documents the currently known issues that customers may experience when they install this security update. The article also documents recommended solutions for these issues. For more information, see Microsoft Knowledge Base Article 934873. I do not have all of the Affected Software installed, but I do have other Microsoft Office applications installed. Why am I being offered the security update?This vulnerability affects only the products listed in the Affected Software section. However, other Microsoft Office applications use some of the same files as the products listed in the Affected Software that the security update affects. We recommend installing the update to prevent the security update from being offered again. What updates does this release replace?This security update replaces a prior security update. The security bulletin ID and affected software is listed in the following table. Bulletin IDMicrosoft Office 2000 Service Pack 3Microsoft Office XP Service Pack 3Microsoft Office 2003 Service Pack 22007 Microsoft Office SystemMicrosoft Office 2004 for MacMS07-015ReplacedReplacedReplacedNot ApplicableReplaced Can I use the Microsoft Baseline Security Analyzer (MBSA) to determine whether this update is required?The following table provides the MBSA detection summary for this security update. SoftwareMBSA 1.2.1MBSA 2.0.1Microsoft Office 2000 Service Pack 3YesNoMicrosoft Office XP Service Pack 3YesYesMicrosoft Office 2003 Service Pack 2YesYes2007 Microsoft Office SystemYesYesMicrosoft Office 2004 for MacNoNo Note MBSA 1.2.1 uses an integrated version of the Office Detection Tool (ODT) which does not support remote scans of this security update. For more information about MBSA, visit the MBSA Web site. For more information about MBSA, visit the MBSA Web site. For more information about the programs that Microsoft Update and MBSA 2.0 currently do not detect, see Microsoft Knowledge Base Article 895660. Note for Windows Vista MBSA 2.0.1 is not supported on Windows Vista but supports remote scans of computers running Windows Vista. For additional information about MBSA support for Windows Vista, visit the MBSA Web site. See also Microsoft Knowledge Base Article 931943: Microsoft Baseline Security Analyzer (MBSA) support for Windows Vista. For more detailed information, see Microsoft Knowledge Base Article 910723: Summary list of monthly detection and deployment guidance articles. Can I use Systems Management Server (SMS) to determine whether this update is required?The following table provides the SMS summary for this security update. SoftwareSMS 2.0SMS 2003Microsoft Office 2000 Service Pack 3YesNoMicrosoft Office XP Service Pack 3YesYesMicrosoft Office 2003 Service Pack 2YesYes2007 Microsoft Office SystemYesYesMicrosoft Office 2004 for MacNoNo SMS uses MBSA for detection. Therefore, SMS has the same limitation that is listed earlier in this bulletin related to programs that MBSA does not detect.For SMS 2.0, the SMS SUS Feature Pack, which includes the Security Update Inventory Tool, can be used by SMS to detect security updates. SMS SUIT uses the MBSA 1.2.1 engine for detection. For more information about the Security Update Inventory Tool, visit the following Microsoft Web site. For more information about the limitations of the Security Update Inventory Tool, see Microsoft Knowledge Base Article 306460. The SMS SUS Feature Pack also includes the Microsoft Office Inventory Tool to detect required updates for Microsoft Office applications. For SMS 2003, the SMS 2003 Inventory Tool for Microsoft Updates can be used by SMS to detect security updates that are offered by Microsoft Update and that are supported by Windows Server Update Services. For more information about the SMS 2003 Inventory Tool for Microsoft Updates, visit the following Microsoft Web site. SMS 2003 can also use the Microsoft Office Inventory Tool to detect required updates for Microsoft Office applications. Note If you have used an Administrative Installation Point (AIP) for deploying Office 2000, Office XP or Office 2003, you may not be able to deploy the update using SMS if you have updated the AIP from the original baseline. For more information about how to change the source for a client computer from an updated administrative installation point to an Office 2000 original baseline source or Service Pack 3 (SP3), see Microsoft Knowledge Base Article 932889.For more information on how to change the source for a client computer from an updated administrative installation point to an Office XP original baseline source or Service Pack 3 (SP3), see Microsoft Knowledge Base Article 922665.For more information about how to change the source for a client computer from an updated administrative installation point to an Office 2003 original baseline source or Service Pack 2 (SP2), see Microsoft Knowledge Base Article 902349. For more information about SMS, visit the SMS Web site. For more detailed information, see Microsoft Knowledge Base Article 910723: Summary list of monthly detection and deployment guidance articles. Vulnerability Details Drawing Object Vulnerability - CVE-2007-1747: A remote code execution vulnerability exists in the way Microsoft Office handles a specially crafted drawing object. An attacker could exploit this vulnerability when Office parses a file and processes a malformed drawing object. Such a specially crafted file might be included as an e-mail attachment or hosted on a malicious Web site. An attacker could exploit the vulnerability by constructing a specially crafted Office file containing a malformed drawing object that could allow remote code execution. Mitigating Factors for Drawing Object Vulnerability - CVE-2007-1747: An attacker who successfully exploited this vulnerability could gain the same user rights as the local user. Users whose accounts are configured to have fewer user rights on the system could be less impacted than users who operate with administrative user rights.In a Web-based attack scenario, an attacker would have to host a Web site that contains an Office file that is used to attempt to exploit this vulnerability. In addition, compromised Web sites and Web sites that accept or host user-provided content could contain specially crafted content that could exploit this vulnerability. An attacker would have no way to force users to visit a specially crafted Web site. Instead, an attacker would have to persuade them to visit the Web site, typically by getting them to click a link that takes them to the attacker's site.The vulnerability cannot be exploited automatically through e-mail. For an attack to be successful a user must open an attachment that is sent in an e-mail message.Users who have installed and are using the Office Document Open Confirmation Tool for Office 2000 will be prompted with Open, Save, or Cancel before opening a document. The features of the Office Document Open Confirmation Tool are incorporated in Office XP and Office 2003. Workarounds for Drawing Object Vulnerability - CVE-2007-1747: Do not open or save Microsoft Office files that you receive from untrusted sources or that you receive unexpectedly from trusted sources. This vulnerability could be exploited when a user opens a specially crafted file. FAQ for Drawing Object Vulnerability - CVE-2007-1747: What is the scope of the vulnerability?A remote code execution vulnerability exists in the way Microsoft Office handles a specially crafted drawing object. An attacker could exploit this vulnerability by getting a user into opening a specially crafted file containing a malicious drawing object. Such a specially crafted file might be included as an e-mail attachment or hosted on a malicious Web site. Opening a specially crafted file could allow remote code execution in the security context of the logged on user. If the user is logged on with administrative user rights, an attacker who successfully exploited this vulnerability could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with the same user rights as the logged-on user. Users whose accounts are configured to have fewer user rights on the system could be less affected than users who operate with administrative user rights. What causes the vulnerability?Office does not perform sufficient data validation when parsing Office drawing objects. When Office opens a specially crafted Office file and parses a malformed drawing object, it may corrupt memory in such a way that an attacker could execute arbitrary code. What might an attacker use the vulnerability to do?An attacker who successfully exploited this vulnerability could run arbitrary code on a user’s system. This could allow an attacker to take complete control of the affected system. How could an attacker exploit the vulnerability?In an e-mail attack scenario, an attacker could exploit the vulnerability by sending a specially-crafted file to the user and by convincing the user to open the file. In a Web-based attack scenario, an attacker would have to host a Web site that contains a Office file that is used to attempt to exploit this vulnerability. In addition, compromised Web sites and Web sites that accept or host user-provided content could contain specially crafted content that could exploit this vulnerability. An attacker would have no way to force users to visit a specially crafted Web site. Instead, an attacker would have to persuade them to visit the Web site, typically by getting them to click a link that takes them to the attacker's site. What systems are primarily at risk from the vulnerability?Workstations and terminal servers are primarily at risk. Servers could be at more risk if administrators allow users to log on to servers and to run programs. However, best practices strongly discourage allowing this. I don’t have any of the affected software installed on my system but I do have MSO.dll on my system and I am getting offered the security update, why?MSO.dll is a file shared between Office applications; only customers having an Office application called out as affected are at risk from this vulnerability. Since the file is on the system even if you don’t have an affected Office application installed Microsoft recommends that you install the security update. What does the update do?The update removes the vulnerability by modifying the way that Microsoft Office handles certain drawing objects. When this security bulletin was issued, had this vulnerability been publicly disclosed?No. Microsoft received information about this vulnerability through responsible disclosure. Microsoft had not received any information to indicate that this vulnerability had been publicly disclosed when this security bulletin was originally issued. This security bulletin addresses the privately disclosed vulnerability as well as additional issues discovered through internal investigations. When this security bulletin was issued, had Microsoft received any reports that this vulnerability was being exploited?No. Microsoft had not received any information to indicate that this vulnerability had been publicly used to attack customers and had not seen any examples of proof of concept code published when this security bulletin was originally issued. Security Update Information Affected Software: For information about the specific security update for your affected software, click the appropriate link: Office 2000 Prerequisites and Additional Update Details Important Before you install this update, make sure that the following requirements have been met: Microsoft Windows Installer 2.0 must be installed. Microsoft Windows Server 2003, Windows XP, and Microsoft Windows 2000 Service Pack 3 (SP3) include Windows Installer 2.0 or a later version. To install the latest version of Windows Installer, visit one of the following Microsoft Web sites: Windows Installer 2.0 for Windows 95, Windows 98, Windows 98 SE, and Windows Millennium Edition Windows Installer 2.0 for Windows 2000 and Windows NT 4.0 Office 2000 Service Pack 3 (SP3) must be installed. Before you install this update, install Office 2000 SP3. For more information about how to install Office 2000 SP3, see Microsoft Knowledge Base Article 326585. For more information about how to determine the version of Office 2000 that is installed on your computer, see Microsoft Knowledge Base Article 255275. Inclusion in Future Service Packs There are no more service packs planned for this software. The update for this issue may be included in a future update rollup. Restart Requirement To help reduce the chance that a restart will be required, stop all affected services and close all applications that may use the affected files prior to installing the security update. For more information about the reasons why you may be prompted to restart, see Microsoft Knowledge Base Article 887012. Removal Information After you install the update, you cannot remove it. To revert to an installation before the update was installed; you must remove the application, and then install it again from the original CD-ROM. Automated Client Installation Information Office Update Web Site We recommend that you install the Microsoft Office 2000 client updates by using the Office Update Web site. The Office Update Web site detects which installation you have and prompts you to install exactly what you must have to make sure that your installation is completely up to date. To have the Office Update Web site detect the updates that you must install on your computer, visit the Office Update Web site, and then click Office Update in the “Get updates now” section located in the upper right region of the Web page. After detection is complete, you will receive a list of recommended updates for your approval. Click Agree and Install to complete the process. Manual Client Installation Information For detailed information about how to manually install this update, review the following section. Installation Information The security update supports the following setup switches. SwitchDescription/qSpecifies quiet mode, or suppresses prompts, when files are being extracted./q:uSpecifies user-quiet mode, which presents some dialog boxes to the user./q:aSpecifies administrator-quiet mode, which does not present any dialog boxes to the user./t:pathSpecifies the target folder for extracting files./cExtracts the files without installing them. If /t:path is not specified, you are prompted for a target folder./c:pathOverrides the install command that is defined by author. Specifies the path and name of the Setup.inf or .exe file./r:nNever restarts the computer after installation./r:IPrompts the user to restart the computer if a restart is required, except when used with /q:a./r:aAlways restarts the computer after installation./r:sRestarts the computer after installation without prompting the user./n:vNo version checking - Install the program over any earlier version. Note These switches do not necessarily work with all updates. If a switch is not available, that functionality is required for the correct installation of the update. Also, using the /n:v switch is unsupported and may result in an unbootable system. If the installation is unsuccessful, you should contact your support professional to understand why it could not install. For more information about the supported setup switches, see Microsoft Knowledge Base Article 197147. Note The full file office update is intended for both client and administrative deployment scenarios. Client Deployment Information Download this security update for Office 2000.Click Save this program to disk, and then click OK.Click Save.Using Windows Explorer, find the folder that contains the saved file, and then double-click the saved file.If you are prompted to install the update, click Yes.Click Yes to accept the License Agreement.Insert your original source CD-ROM when you are prompted to do so, and then click OK.When you receive a message that states the installation was successful, click OK. Note If the security update is already installed on your computer, you receive the following error message: This update has already been applied or is included in an update that has already been applied. Client Installation File Information The English version of this update has the file attributes that are listed in the following table. The dates and times for these files are listed in coordinated universal time (UTC). When you view the file information, it is converted to local time. To find the difference between UTC and local time, use the Time Zone tab in the Date and Time tool in Control Panel. Office 2000 Service Pack 3: File NameVersionDateTimeSizeMso9.dll9.0.0.896122-Mar-200701:495,595,185 Verifying that the Update Has Been Applied Microsoft Baseline Security Analyzer To verify that a security update has been applied to an affected system, you may be able to use the Microsoft Baseline Security Analyzer (MBSA) tool. See the frequently asked question, “Can I use the Microsoft Baseline Security Analyzer (MBSA) to determine whether this update is required?” in the section, Frequently Asked Questions (FAQ) Related to This Security Update, earlier in this bulletin. File Version Verification Note Because there are several versions of Microsoft Windows, the following steps may be different on your computer. If they are, see your product documentation to complete these steps. Click Start, and then click Search.In the Search Results pane, click All files and folders under Search Companion.In the All or part of the file name box, type a file name from the appropriate file information table, and then click Search.In the list of files, right-click a file name from the appropriate file information table, and then click Properties.Note Depending on the version of the operating system or programs installed, some of the files that are listed in the file information table may not be installed.On the Version tab, determine the version of the file that is installed on your computer by comparing it to the version that is documented in the appropriate file information table.Note Attributes other than the file version may change during installation. Comparing other file attributes to the information in the file information table is not a supported method of verifying that the update has been applied. Also, in certain cases, files may be renamed during installation. If the file or version information is not present, use one of the other available methods to verify update installation. Administrative Installation Information If you installed your application from a server location, the server administrator must update the server location with the administrative update and deploy that update to your computer. Installation Information The following setup switches are relevant to administrative installations as they allow an administrator to customize how the files are extracted from the security update. SwitchDescription/?Displays the command-line options./qSpecifies quiet mode, or suppresses prompts, when files are being extracted./t:pathSpecifies the target folder for extracting files./cExtracts the files without installing them. If /t:path is not specified, you are prompted for a target folder./c:pathOverrides the install command that is defined by author. Specifies the path and name of the Setup.inf or .exe file. For more information about the supported setup switches, see Microsoft Knowledge Base Article 197147. Administrative Deployment Information To update your administrative installation, follow these steps: Download this security update for Office 2000.Click Save this program to disk, and then click OK.Click Save.Using Windows Explorer, locate the folder that contains the saved file. Click Start, click Run, type the following command, and then click OK to extract the .msp file:[path\\name of EXE file] /c /t:C:\\AdminUpdateNote Double-clicking the .exe file does not extract the .msp file; it applies the update to the local computer. In order to update an administrative image, you must first extract the .msp file.Click Yes to accept the License Agreement.Click Yes if you are prompted to create the folder.If you are familiar with the procedure for updating your administrative installation, click Start, click Run, type the following command, and then click OK:msiexec /a Admin Path**\\**MSI File **/p C:\\AdminUpdate\\**MSP File SHORTFILENAMES=TRUENote Admin Path is the path of your administrative installation point for your application (for example, C:\\Office2000), MSI File is the .msi database package for the application (for example, Data1.msi), and MSP File is the name of the administrative update (for example, SHAREDff.msp).Note You can append /qb+ to the command line so that the Administrative Installation dialog box and the End User License Agreement dialog box do not appear.Click Next in the provided dialog box. Do not change your CD key, installation location, or company name in the provided dialog box.Click I accept the terms in the License Agreement, and then click Install. At this point, your administrative installation point is updated. Next, you must update the workstations configurations that were originally installed from this administrative installation. To do this, please review the following “Workstation Deployment Information” subsection. Any new installations that you run from this administrative installation point will include the update. Warning Any workstation configuration that was originally installed from this administrative installation before you installed the update cannot use this administrative installation for actions like repairing Office or adding new features until you complete the steps in the following “Workstation Deployment Information” subsection for this workstation. Workstation Deployment Information To deploy the update to the client workstations, click Start, click Run, type the following command, and then click OK: msiexec /I Admin Path**\\**MSI File **/qb REINSTALL=**Feature List REINSTALLMODE=vomu Note Admin Path is the path of your administrative installation point for your application (for example, C:\\Office2000), MSI File is the .msi database package for the application (for example, Data1.msi), and Feature List is the list of feature names (case sensitive) that must be reinstalled for the update. To install all features, you can use REINSTALL=ALL or you can install the following features: ProductFeatureMSPUB, O9PUB, 09PBProductFiles,PubPrimary,MSDrawFilesO9EXLProductFiles, EXCELNonBootFilesO9PRMProductFiles, OUTLOOKNonBootFiles, WORDNonBootFiles, ACCESSNonBootFiles, EXCELNonBootFiles, FPClientNonBootFiles, PPTNonBootFiles, ProductNonBootFilesO9PROProductFiles, OUTLOOKNonBootFiles, WORDNonBootFiles, ACCESSNonBootFiles, EXCELNonBootFiles, PPTNonBootFilesO9SBE, 9327_o9procd1_sbe_coxs_slv_data1 productProductFiles, OUTLOOKNonBootFiles,WORDNonBootFiles, EXCELNonBootFilesO9FPProductFiles, FPClientNonBootFiles, ProductNonBootFilesO9PIPC1ProductFiles, OUTLOOKNonBootFiles, MSDrawFiles, WORDNonBootFiles, EXCELNonBootFilesO9PIPC2ProductFiles, MSDrawFiles, WORDNonBootFiles, EXCELNonBootFilesO9PRMCD2ProductFiles,AccessRuntimeMaster, PubPrimary, MSDrawFiles, SBCMNonBootFilesO9STDProductFiles, OUTLOOKNonBootFiles, WORDNonBootFiles, EXCELNonBootFiles, PPTNonBootFiles Note Administrators working in managed environments can find complete resources for deploying Office updates in an organization at the Office Admin Update Center. At that site, scroll down and look under the Update Resources section for the software version you are updating. The Windows Installer Documentation also provides more information about the parameters supported by Windows Installer. Administrative Installation File Information The English version of this update has the file attributes that are listed in the following table. The dates and times for these files are listed in coordinated universal time (UTC). When you view the file information, it is converted to local time. To find the difference between UTC and local time, use the Time Zone tab in the Date and Time tool in Control Panel. Office 2000 Service Pack 3: File NameVersionDateTimeSizeMso9.dll9.0.0.896122-Mar-200701:495,595,185 Verifying that the Update Has Been Applied Microsoft Baseline Security Analyzer To verify that a security update has been applied to an affected system, you may be able to use the Microsoft Baseline Security Analyzer (MBSA) tool. See the frequently asked question, “Can I use the Microsoft Baseline Security Analyzer (MBSA) to determine whether this update is required?” in the section, Frequently Asked Questions (FAQ) Related to This Security Update, earlier in this bulletin. File Version Verification Note Because there are several versions of Microsoft Windows, the following steps may be different on your computer. If they are, see your product documentation to complete these steps. Click Start, and then click Search.In the Search Results pane, click All files and folders under Search Companion.In the All or part of the file name box, type a file name from the appropriate file information table, and then click Search.In the list of files, right-click a file name from the appropriate file information table, and then click Properties.Note Depending on the version of the operating system or programs installed, some of the files that are listed in the file information table may not be installed.On the Version tab, determine the version of the file that is installed on your computer by comparing it to the version that is documented in the appropriate file information table.Note Attributes other than the file version may change during installation. Comparing other file attributes to the information in the file information table is not a supported method of verifying that the update has been applied. Also, in certain cases, files may be renamed during installation. If the file or version information is not present, use one of the other available methods to verify update installation. Office XP Prerequisites and Additional Update Details Important: Before you install this update, make sure that the following requirements have been met: Microsoft Windows Installer 2.0 must be installed. Microsoft Windows Server 2003, Windows XP, and Microsoft Windows 2000 Service Pack 3 (SP3) include Windows Installer 2.0 or a later version. To install the latest version of the Windows Installer, visit one of the following Microsoft Web sites: Windows Installer 2.0 for Windows 95, Windows 98, Windows 98 SE, and Windows Millennium Edition Windows Installer 2.0 for Windows 2000 and Windows NT 4.0 Office XP Service Pack 3 (SP3) must be installed. Before you install this update, install Office XP SP3. For more information about how to install Office XP SP3, see Microsoft Knowledge Base Article 832671. For more information about how to determine the version of Office XP that is installed on your computer, see Microsoft Knowledge Base Article 291331. For more information about the version information displayed in the About dialog box, see Microsoft Knowledge Base Article 328294. Inclusion in Future Service Packs There are no more service packs planned for this software. The update for this issue may be included in a future update rollup. Restart Requirement To help reduce the chance that a restart will be required, stop all affected services and close all applications that may use the affected files prior to installing the security update. For more information about the reasons why you may be prompted to restart, see Microsoft Knowledge Base Article 887012. Removal Information To remove this security update, use the Add or Remove Programs tool in Control Panel. Note When you remove this update, you may be prompted to insert the Microsoft Office XP CD in the CD drive. Additionally, you may not have the option to uninstall the update from the Add or Remove Programs tool in Control Panel. There are several possible causes for this issue. For more information about the removal, see Microsoft Knowledge Base Article 903771. Automated Client Installation Information Microsoft Update Web Site This update will be available through the Microsoft Update Web site. Microsoft Update consolidates updates that are provided by Windows Update and Office Update into one location and lets you choose automatic delivery and installation of high-priority and security updates. We recommend that you install this update by using the Microsoft Update Web site. The Microsoft Update Web site detects your particular installation and prompts you to install exactly what you must have to make sure that your installation is completely up to date. To have the Microsoft Update Web site detect the required updates that you must install on your computer, visit the Microsoft Update Web site. You will be given the choice of Express (Recommended) or Custom. After detection is complete, you will receive a list of recommended updates for your approval. Click Install Updates or Review and Install Updates to complete the process. Manual Client Installation Information For detailed information about how to manually install this update, review the following section. Installation Information The security update supports the following setup switches. SwitchDescription/qSpecifies quiet mode, or suppresses prompts, when files are being extracted./q:uSpecifies user-quiet mode, which presents some dialog boxes to the user./q:aSpecifies administrator-quiet mode, which does not present any dialog boxes to the user./t:pathSpecifies the target folder for extracting files./cExtracts the files without installing them. If /t:path is not specified, you are prompted for a target folder./c:pathOverrides the install command that is defined by author. Specifies the path and name of the Setup.inf or .exe file./r:nNever restarts the computer after installation./r:IPrompts the user to restart the computer if a restart is required, except when used with /q:a./r:aAlways restarts the computer after installation./r:sRestarts the computer after installation without prompting the user./n:vNo version checking - Install the program over any earlier version. Note These switches do not necessarily work with all updates. If a switch is not available, that functionality is required for the correct installation of the update. Also, using the /n:v switch is unsupported and may result in an unbootable system. If the installation is unsuccessful, you should contact your support professional to understand why it could not install. For more information about the supported setup switches, see Microsoft Knowledge Base Article 197147. Note The full file office update is intended for both client and administrative deployment scenarios. Client Deployment Information Download this security update for Office XP.Click Save this program to disk, and then click OK.Click Save.Using Windows Explorer, find the folder that contains the saved file, and then double-click the saved file.If you are prompted to install the update, click Yes.Click Yes to accept the License Agreement.Insert your original source CD-ROM when you are prompted to do so, and then click OK.When you receive a message that states the installation was successful, click OK. Note If the security update is already installed on your computer, you see the following error message: This update has already been applied or is included in an update that has already been applied. Client Installation File Information The English version of this update has the file attributes that are listed in the following table. The dates and times for these files are listed in coordinated universal time (UTC). When you view the file information, it is converted to local time. To find the difference between UTC and local time, use the Time Zone tab in the Date and Time tool in Control Panel. Office XP: File NameVersionDateTimeSizeMso.dll10.0.6830.026-Mar-200717:259,819,480 Administrative Installation Information If you installed your application from a server location, the server administrator must update the server location with the administrative update and deploy that update to your computer. Installation Information The following setup switches are relevant to administrative installations as they allow an administrator to customize how the files are extracted from within the security update. SwitchDescription/?Displays the command-line options./qSpecifies quiet mode, or suppresses prompts, when files are being extracted./t:pathSpecifies the target folder for extracting files./cExtracts the files without installing them. If /t:path is not specified, you are prompted for a target folder./c:pathOverrides the install command that is defined by author. Specifies the path and name of the Setup.inf or .exe file. For more information about the supported setup switches, see Microsoft Knowledge Base Article 197147. Administrative Deployment Information To update your administrative installation, follow these steps: Download this security update for Office XP.Click Save this program to disk, and then click OK.Click Save.Using Windows Explorer, locate the folder that contains the saved file. Click Start, click Run, type the following command, and then click OK to extract the .msp file:[path\\name of EXE file] /c /t:C:\\AdminUpdateNote Double-clicking the .exe file does not extract the .msp file; it applies the update to the local computer. In order to update an administrative image, you must first extract the .msp file.Click Yes to accept the License Agreement.Click Yes if you are prompted to create the folder.If you are familiar with the procedure for updating your administrative installation, click Start, click Run, type the following command, and then click OK:msiexec /a Admin Path**\\**MSI File **/p C:\\adminUpdate\\**MSP File SHORTFILENAMES=TRUENote Admin Path is the path of your administrative installation point for your application (for example, C:\\OfficeXp), MSI File is the .msi database package for the application (for example, Data1.msi), and MSP File is the name of the administrative update (for example, SHAREDff.msp).Note You can append /qb+ to the command line so that the Administrative Installation dialog box and the End User License Agreement dialog box do not appear.Click Next in the provided dialog box. Do not change your CD key, installation location, or company name in the provided dialog box.Click I accept the terms in the License Agreement, and then click Install. At this point, your administrative installation point is updated. Next, you must update the workstation configurations that were originally installed from this administrative installation. To do this, see the following “Workstation Deployment Information” subsection. Any new installations that you run from this administrative installation point will include the update. Warning Any workstation configuration that was originally installed from this administrative installation before you installed the update cannot use this administrative installation for actions like repairing Office or adding new features until you complete the steps in the following “Workstation Deployment Information” subsection for this workstation. Workstation Deployment Information To deploy the update to the client workstations, click Start, click Run, type the following command, and then click OK: msiexec /I Admin Path**\\**MSI File **/qb REINSTALL=**Feature List REINSTALLMODE=vomu Note Admin Path is the path of your administrative installation point for your application (for example, C:\\OfficeXP), MSI File is the .msi database package for the application (for example, Data1.msi), and Feature List is the list of feature names (case sensitive) that must be reinstalled for the update. To install all features, you can use REINSTALL=ALL or you can install the following features: (Comment: Choose from the following or else enter unique.) ProductFeatureACCESS, FP, OUTLOOK, PPT, ACCESSRT, PUBProductFilesPIPC1, PROPLUS, PRO, SBE, STD, STDEDUProductFilesEXCELEXCELNonBootFiles, ProductFiles Note Administrators working in managed environments can find complete resources for deploying Office updates in an organization on the Office Admin Update Center. On the home page of that site, look under the Update Strategies section for the software version you are updating. The Windows Installer Documentation also provides more information about the parameters supported by the Windows Installer. Administrative Installation File Information The English version of this update has the file attributes that are listed in the following table. The dates and times for these files are listed in coordinated universal time (UTC). When you view the file information, it is converted to local time. To find the difference between UTC and local time, use the Time Zone tab in the Date and Time tool in Control Panel. Office XP: File NameVersionDateTimeSizeMso.dll10.0.6830.026-Mar-200717:259,819,480 Verifying that the Update Has Been Applied Microsoft Baseline Security Analyzer To verify that a security update has been applied to an affected system, you may be able to use the Microsoft Baseline Security Analyzer (MBSA) tool. See the frequently asked question, “Can I use the Microsoft Baseline Security Analyzer (MBSA) to determine whether this update is required?” in the section, Frequently Asked Questions (FAQ) Related to This Security Update, earlier in this bulletin. File Version Verification Note Because there are several versions of Microsoft Windows, the following steps may be different on your computer. If they are, see your product documentation to complete these steps. Click Start, and then click Search.In the Search Results pane, click All files and folders under Search Companion.In the All or part of the file name box, type a file name from the appropriate file information table, and then click Search.In the list of files, right-click a file name from the appropriate file information table, and then click Properties.Note Depending on the version of the operating system or programs installed, some of the files that are listed in the file information table may not be installed.On the Version tab, determine the version of the file that is installed on your computer by comparing it to the version that is documented in the appropriate file information table.Note Attributes other than the file version may change during installation. Comparing other file attributes to the information in the file information table is not a supported method of verifying that the update has been applied. Also, in certain cases, files may be renamed during installation. If the file or version information is not present, use one of the other available methods to verify update installation. Office 2003 Prerequisites and Additional Update Details Important: Before you install this update, make sure that the following requirements have been met: To update Office 2003, Office 2003 Service Pack 2 must be installed. Before you install this update, install Office 2003 SP2.To update Excel Viewer 2003, the latest version of Excel Viewer 2003 must be installed. Download the latest Excel Viewer 2003. For more information about how to determine the version of Office 2003 that is installed on your computer, see Microsoft Knowledge Base Article 821549. For more information about the version information displayed in the About dialog box, see Microsoft Knowledge Base Article 328294. Inclusion in Future Service Packs: The update for this issue will be included in a future service pack or update rollup. Restart Requirement To help reduce the chance that a restart will be required, stop all affected services and close all applications that may use the affected files prior to installing the security update. For more information about the reasons why you may be prompted to restart, see Microsoft Knowledge Base Article 887012. Removal Information To remove this security update, use Add or Remove Programs in Control Panel.Note When you remove this update, you may be prompted to insert the Microsoft Office 2003 CD in the CD drive. Additionally, you may not have the option to uninstall the update from Add or Remove Programs in Control Panel. There are several possible causes for this issue. For more information about the removal, see Microsoft Knowledge Base Article 903771. Automated Client Installation Information Microsoft Update Web Site This update will be available through the Microsoft Update Web site. Microsoft Update consolidates updates that are provided by Windows Update and Office Update into one location and lets you choose automatic delivery and installation of high-priority and security updates. We recommend that you install this update by using the Microsoft Update Web site. The Microsoft Update Web site detects your particular installation and prompts you to install exactly what you must have to make sure that your installation is completely up to date. To have the Microsoft Update Web site detect the required updates that you must install on your computer, visit the Microsoft Update Web site. You will be given the choice of Express (Recommended) or Custom. After detection is complete, you will receive a list of recommended updates for your approval. Click Install Updates or Review and Install Updates to complete the process. Manual Client Installation Information For detailed information about how to manually install this update, review the following section. Installation Information The security update supports the following setup switches. SwitchDescription/qSpecifies quiet mode, or suppresses prompts, when files are being extracted./q:uSpecifies user-quiet mode, which presents some dialog boxes to the user./q:aSpecifies administrator-quiet mode, which does not present any dialog boxes to the user./t:pathSpecifies the target folder for extracting files./cExtracts the files without installing them. If /t:path is not specified, you are prompted for a target folder./c:pathOverrides the install command that is defined by author. Specifies the path and name of the Setup.inf or .exe file./r:nNever restarts the computer after installation./r:IPrompts the user to restart the computer if a restart is required, except when used with /q:a./r:aAlways restarts the computer after installation./r:sRestarts the computer after installation without prompting the user./n:vNo version checking - Install the program over any earlier version. Note These switches do not necessarily work with all updates. If a switch is not available, that functionality is required for the correct installation of the update. Also, using the /n:v switch is unsupported and may result in an unbootable system. If the installation is unsuccessful, you should contact your support professional to understand why it could not install. For more information about the supported setup switches, see Microsoft Knowledge Base Article 197147. Note The full file office update is intended for both client and administrative deployment scenarios. Client Deployment Information Download the security update for Office 2003.Click Save this program to disk, and then click OK.Click Save.Using Windows Explorer, find the folder that contains the saved file, and then double-click the saved file.If you are prompted to install the update, click Yes.Click Yes to accept the License Agreement.Insert your original source CD-ROM when you are prompted to do so, and then click OK.When you receive a message that states the installation was successful, click OK. Note If the security update is already installed on your computer, you receive the following error message: This update has already been applied or is included in an update that has already been applied. Client Installation File Information The English version of this update has the file attributes that are listed in the following table. The dates and times for these files are listed in coordinated universal time (UTC). When you view the file information, it is converted to local time. To find the difference between UTC and local time, use the Time Zone tab in the Date and Time tool in Control Panel. Office 2003: File NameVersionDateTimeSizeMso.dll11.0.8132.017-Mar-200715:4412,262,232 Administrative Installation Information If you installed your application from a server location, the server administrator must update the server location with the administrative update and deploy that update to your computer. Installation Information The following setup switches are relevant to administrative installations as they allow an administrator to customize how the files are extracted from within the security update. SwitchDescription/?Displays the command-line options./qSpecifies quiet mode, or suppresses prompts, when files are being extracted./t:pathSpecifies the target folder for extracting files./cExtracts the files without installing them. If /t:path is not specified, you are prompted for a target folder./c:pathOverrides the install command that is defined by author. Specifies the path and name of the Setup.inf or .exe file. For more information about the supported setup switches, see Microsoft Knowledge Base Article 197147. Administrative Deployment Information To update your administrative installation, follow these steps: Download the security update for Office 2003.Click Save this program to disk, and then click OK.Click Save.Using Windows Explorer, locate the folder that contains the saved file. Click Start, click Run, type the following command, and then click OK to extract the .msp file:[path\\name of EXE file] /c /t:C:\\AdminUpdateNote Double-clicking the .exe file does not extract the .msp file; it applies the update to the local computer. In order to update an administrative image, you must first extract the .msp file.Click Yes to accept the License Agreement.Click Yes if you are prompted to create the folder.If you are familiar with the procedure for updating your administrative installation**,** click Start, click Run, type the following command, and then click OK:msiexec /a Admin Path**\\**MSI File **/p C:\\adminUpdate\\**MSP File SHORTFILENAMES=TRUENote Admin Path is the path of your administrative installation point for your application (for example, C:\\Office2003), MSI File is the .msi database package for the application (for example, Data1.msi), and MSP File is the name of the administrative update (for example, SHAREDff.msp).Note You can append /qb+ to the command line so that the Administrative Installation dialog box and the End User License Agreement dialog box do not appear.Click Next in the provided dialog box. Do not change your CD key, installation location, or company name in the provided dialog box.Click I accept the terms in the License Agreement, and then click Install. At this point, your administrative installation point is updated. Next, you must update the workstations configurations that were originally installed from this administrative installation. To do this, please review the following “Workstation Deployment Information” subsection. Any new installations that you run from this administrative installation point will include the update. Warning Any workstation configuration that was originally installed from this administrative installation before you installed the update cannot use this administrative installation for actions such as repairing Office or adding new features until you complete the steps in the following “Workstation Deployment Information” subsection. Workstation Deployment Information To deploy the update to the client workstations, click Start, click Run, type the following command, and then click OK: Msiexec /I Admin Path**\\**MSI File **/qb REINSTALL=**Feature List REINSTALLMODE=vomu Note Admin Path is the path of your administrative installation point for your application (for example, C:\\Office2003), MSI File is the .msi database package for the application (for example, Data1.msi), and Feature List is the list of feature names (case sensitive) that must be reinstalled for the update. To install all features, you can use REINSTALL=ALL or you can install the following features: (Comment: Choose from the following or else enter unique.) ProductFeatureSTD11, BASIC11, PERS11, STDP11WORDNonBootFiles, EXCELNonBootFiles, ProductFilesFP11ProductFilesPROI11, PRO11, PRO11SBWORDNonBootFiles, ACCESSNonBootFiles, EXCELNonBootFiles, ProductFilesXLVIEWExcelViewer Note Administrators working in managed environments can find complete resources for deploying Office updates in an organization on the Office Admin Update Center. On the home page of that site, look under the Update Strategies section for the software version you are updating. The Windows Installer Documentation also provides more information about the parameters supported by the Windows Installer. Administrative Installation File Information The English version of this update has the file attributes that are listed in the following table. The dates and times for these files are listed in coordinated universal time (UTC). When you view the file information, it is converted to local time. To find the difference between UTC and local time, use the Time Zone tab in the Date and Time tool in Control Panel. Office 2003: File NameVersionDateTimeSizeMso.dll11.0.8132.017-Mar-200715:4412,262,232 Verifying that the Update Has Been Applied Microsoft Baseline Security Analyzer To verify that a security update has been applied to an affected system, you may be able to use the Microsoft Baseline Security Analyzer (MBSA) tool. See the frequently asked question, “Can I use the Microsoft Baseline Security Analyzer (MBSA) to determine whether this update is required?” in the section, Frequently Asked Questions (FAQ) Related to This Security Update, earlier in this bulletin. File Version Verification Note Because there are several versions of Microsoft Windows, the following steps may be different on your computer. If they are, see your product documentation to complete these steps. Click Start, and then click Search.In the Search Results pane, click All files and folders under Search Companion.In the All or part of the file name box, type a file name from the appropriate file information table, and then click Search.In the list of files, right-click a file name from the appropriate file information table, and then click Properties.Note Depending on the version of the operating system or programs installed, some of the files that are listed in the file information table may not be installed.On the Version tab, determine the version of the file that is installed on your computer by comparing it to the version that is documented in the appropriate file information table.Note Attributes other than the file version may change during installation. Comparing other file attributes to the information in the file information table is not a supported method of verifying that the update has been applied. Also, in certain cases, files may be renamed during installation. If the file or version information is not present, use one of the other available methods to verify update installation. The 2007 Microsoft Office System Prerequisites and Additional Update Details Important: Before you install this update, make sure that the following requirements have been met: To update the 2007 Office system, the 2007 Office system must be installed.Microsoft Windows Installer 3.1 must be installed. Microsoft Windows Server 2003 SP1 includes Windows Installer 3.1 or a later version. To install the latest version of Windows Installer 3.1, visit the following site: Windows Installer 3.1 Redistributable (v2) on the Microsoft Download Center.For more information about the version information displayed in the About dialog box, see Microsoft Knowledge Base Article 328294. Inclusion in Future Service Packs: The update for this issue will be included in a future service pack. Restart Requirement To help reduce the chance that a restart will be required, stop all affected services and close all applications that may use the affected files prior to installing the security update. For more information about the reasons why you may be prompted to restart, see Microsoft Knowledge Base Article 887012. Removal Information To remove this security update, use Add or Remove Programs in Control Panel.Note When you remove this update, you may be prompted to insert the 2007 Microsoft Office system CD in the CD drive. Additionally, you may not have the option to uninstall the update from Add or Remove Programs in Control Panel. There are several possible causes for this issue. For more information about the removal, see Microsoft Knowledge Base Article 903771. Automated Client Installation Information Microsoft Update Web Site This update will be available through the Microsoft Update Web site. Microsoft Update consolidates updates that are provided by Windows Update and Office Update into one location and lets you choose automatic delivery and installation of high-priority and security updates. We recommend that you install this update by using the Microsoft Update Web site. The Microsoft Update Web site detects your particular installation and prompts you to install exactly what you must have to make sure that your installation is completely up to date. To have the Microsoft Update Web site detect the required updates that you must install on your computer, visit the Microsoft Update Web site. You will be given the choice of Express (Recommended) or Custom. After detection is complete, you will receive a list of recommended updates for your approval. Click Install Updates or Review and Install Updates to complete the process. Installation Information For detailed information about how to manually install this update, review the following section. Installation Information The security update supports the following setup switches. SwitchDescription/? or /helpDisplays usage dialog./passiveSpecifies passive mode. Requires no user interaction; users see basic progress dialogs but cannot cancel./quietSpecifies quiet mode, or suppresses prompts, when files are being extracted./norestartSuppresses restarting the system if the update requires a restart./forcerestartAutomatically restarts the system after applying the update, regardless of whether the update requires the restart./extractExtracts the files without installing them. You are prompted for a target folder./extract:<path>Overrides the install command that is defined by author. Specifies the path and name of the Setup.inf or .exe file./lang:<LCID>Forces the use of a specific language, when the update package supports that language./log:<log file>Enables logging, by both Vnox and Installer, during the update installation. Note These switches do not necessarily work with all updates. If a switch is not available, that functionality is required for the correct installation of the update. Also, using the /n:v switch is unsupported and may result in an unbootable system. If the installation is unsuccessful, you should contact your support professional to understand why it could not install. For more information about the supported setup switches, see Microsoft Knowledge Base Article 197147. Note The full file office update is intended for both client and administrative deployment scenarios. Deployment Information Download the security update for the 2007 Office system.Click Save this program to disk, and then click OK.Click Save.Using Windows Explorer, find the folder that contains the saved file, and then double-click the saved file.If you are prompted to install the update, click Yes.Click Yes to accept the License Agreement.Insert your original source CD-ROM when you are prompted to do so, and then click OK.When you receive a message that states the installation was successful, click OK. Note If the security update is already installed on your computer, you receive the following error message: This update has already been applied or is included in an update that has already been applied. Installation File Information The English version of this update has the file attributes that are listed in the following table. The dates and times for these files are listed in coordinated universal time (UTC). When you view the file information, it is converted to local time. To find the difference between UTC and local time, use the Time Zone tab in the Date and Time tool in Control Panel. The 2007 Microsoft Office system: File NameVersionDateTimeSizeMso.dll12.00.6017.500012-Apr-200712:2216,877,960 Verifying that the Update Has Been Applied Microsoft Baseline Security Analyzer To verify that a security update has been applied to an affected system, you may be able to use the Microsoft Baseline Security Analyzer (MBSA) tool. See the frequently asked question, “Can I use the Microsoft Baseline Security Analyzer (MBSA) to determine whether this update is required?” in the section, Frequently Asked Questions (FAQ) Related to This Security Update, earlier in this bulletin. File Version Verification Note Because there are several versions of Microsoft Windows, the following steps may be different on your computer. If they are, see your product documentation to complete these steps. Click Start, and then click Search.In the Search Results pane, click All files and folders under Search Companion.In the All or part of the file name box, type a file name from the appropriate file information table, and then click Search.In the list of files, right-click a file name from the appropriate file information table, and then click Properties.Note Depending on the version of the operating system or programs installed, some of the files that are listed in the file information table may not be installed.On the Version tab, determine the version of the file that is installed on your computer by comparing it to the version that is documented in the appropriate file information table.Note Attributes other than the file version may change during installation. Comparing other file attributes to the information in the file information table is not a supported method of verifying that the update has been applied. Also, in certain cases, files may be renamed during installation. If the file or version information is not present, use one of the other available methods to verify update installation. Office 2004 for Mac Installation Information: Quit any applications that are running, including virus-protection applications, all Microsoft Office applications, Microsoft Messenger for Mac, and Office Notifications, because they might interfere with installation.Open the Microsoft Office 2004 for Mac 11.3.5 Update volume on your desktop. This step might have been performed for you.To start the update process, in the Microsoft Office 2004 for Mac 11.3.5 Update volume window, double-click the Microsoft Office 2004 for Mac 11.3.5 Update application, and follow the instructions on the screen.If the installation finishes successfully, you can remove the update installer from your hard disk. To verify that the installation finished successfully, see the following “Verifying Update Installation” subsection. To remove the update installer, first drag the Microsoft Office 2004 for Mac 11.3.5 Update volume to the Trash, and then drag the file that you downloaded to the Trash. Restart Requirement This update does not require you to restart your computer. Removal Information This update cannot be uninstalled. Verifying Update Installation To verify that a security update is installed on an affected system, follow these steps: In the Finder, navigate to the Application Folder (Microsoft Office 2004: Office).Select the file, Microsoft Component Plugin.On the File menu click Get Info or Show Info. If the Version number is 11.3.5, the update has been successfully installed. Other Information Obtaining Other Security Updates: Updates for other security issues are available at the following locations: Security updates are available at the Microsoft Download Center. You can find them most easily by doing a keyword search for \"security_patch.\"Updates for consumer platforms are available at the Microsoft Update Web site. Support: Customers in the U.S. and Canada can receive technical support from Microsoft Product Support Services at 1-866-PCSAFETY. There is no charge for support calls that are associated with security updates.International customers can receive support from their local Microsoft subsidiaries. There is no charge for support that is associated with security updates. For more information about how to contact Microsoft for support issues, visit the International Support Web site. Security Resources: The Microsoft TechNet Security Web site provides additional information about security in Microsoft products.TechNet Update Management CenterMicrosoft Software Update ServicesMicrosoft Windows Server Update ServicesMicrosoft Baseline Security Analyzer (MBSA)Windows UpdateMicrosoft UpdateWindows Update Catalog: For more information about the Windows Update Catalog, see Microsoft Knowledge Base Article 323166.Office Update Software Update Services: By using Microsoft Software Update Services (SUS), administrators can quickly and reliably deploy the latest critical updates and security updates to Windows 2000 and Windows Server 2003-based servers, and to desktop systems that are running Windows 2000 Professional or Windows XP Professional. For more information about how to deploy security updates by using Software Update Services, visit the Software Update Services Web site. Windows Server Update Services: By using Windows Server Update Services (WSUS), administrators can quickly and reliably deploy the latest critical updates and security updates for Windows 2000 operating systems and later, Office XP and later, Exchange Server 2003, and SQL Server 2000 onto Windows 2000 and later operating systems. For more information about how to deploy security updates using Windows Server Update Services, visit the Windows Server Update Services Web site. Systems Management Server: Microsoft Systems Management Server (SMS) delivers a highly configurable enterprise solution for managing updates. By using SMS, administrators can identify Windows-based systems that require security updates and can perform controlled deployment of these updates throughout the enterprise with minimal disruption to end users. For more information about how administrators can use SMS 2003 to deploy security updates, visit the SMS 2003 Security Patch Management Web site. SMS 2.0 users can also use Software Updates Service Feature Pack to help deploy security updates. For information about SMS, visit the SMS Web site. Note SMS uses the Microsoft Baseline Security Analyzer, the Microsoft Office Detection Tool, and the Enterprise Update Scan Tool to provide broad support for security bulletin update detection and deployment. Some software updates may not be detected by these tools. Administrators can use the inventory capabilities of the SMS in these cases to target updates to specific systems. For more information about this procedure, visit the following Web site. Some security updates require administrative rights following a restart of the system. Administrators can use the Elevated Rights Deployment Tool (available in the SMS 2003 Administration Feature Pack and in the SMS 2.0 Administration Feature Pack) to install these updates. Disclaimer: The information provided in the Microsoft Knowledge Base is provided \"as is\" without warranty of any kind. Microsoft disclaims all warranties, either express or implied, including the warranties of merchantability and fitness for a particular purpose. In no event shall Microsoft Corporation or its suppliers be liable for any damages whatsoever including direct, indirect, incidental, consequential, loss of business profits or special damages, even if Microsoft Corporation or its suppliers have been advised of the possibility of such damages. Some states do not allow the exclusion or limitation of liability for consequential or incidental damages so the foregoing limitation may not apply. Revisions: V1.0 (May 8, 2007): Bulletin published.V1.1 (May 16, 2007): Bulletin workarounds section updated, with the removal of the “Use Microsoft Word Viewer 2003 to open and view files” workaround. This workaround is not valid for the vulnerability discussed in this security bulletin.V1.2 (May 17, 2007): This Bulletin has been revised due to new issues discovered with the security update as reflected in Microsoft Knowledge Base Article 934873.V2.0 (March 26, 2008): This Bulletin has been revised to add Microsoft Office Compatibility Pack for Word, Excel, and PowerPoint 2007 File Formats and Microsoft Office Compatibility Pack for Word, Excel, and PowerPoint 2007 File Formats Service Pack 1 to the Affected Software list.V2.1 (April 30, 2008): This Bulletin has been revised to move Microsoft Office Compatibility Pack for Word, Excel, and PowerPoint 2007 File Formats Service Pack 1 from the Affected Software list to the Non-Affected Software list. Built at 2014-04-18T13:49:36Z-07:00 </content>"
      }
    ],
    "CVE-2007-1748": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2007/ms07-029",
        "title": "Vulnerability in Windows DNS RPC Interface Could Allow Remote Code Execution (935966)",
        "body": "Who Should Read this Document: Customers who use Microsoft Windows Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately Security Update Replacement: None Caveats: None",
        "extra": "This update resolves a publicly disclosed vulnerability. The vulnerability is documented in its own subsection in the Vulnerability Details section of this bulletin. An attacker who successfully exploited this vulnerability could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. We recommend that customers apply the update immediately."
      }
    ]
  }
}