{
  "year": 2004,
  "total": 8,
  "reference": "docs.microsoft.com",
  "reports": {
    "CVE-2004-0119": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2004/ms04-011",
        "title": "Security Update for Microsoft Windows (835732)",
        "body": "Who should read this document: Customers who use Microsoft® Windows® Impact of vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately. Security Update Replacement: This bulletin replaces several prior security updates. See the frequently asked questions (FAQ) section of this bulletin for the complete list. Caveats: The security update for Windows NT Server 4.0 Terminal Server Edition Service Pack 6 requires, as a prerequisite, the Windows NT Server 4.0 Terminal Server Edition Security Rollup Package (SRP). To download the SRP, visit the following Web site. You must install the SRP before you install the security update that is provided in this security bulletin. If you are not using Windows NT Server 4.0 Terminal Server Edition Service Pack 6 you do not need to install the SRP. Microsoft Knowledge Base Article 835732 documents the currently known issues that customers may experience when they install this security update. The article also documents recommended solutions for these issues. For more information, see Microsoft Knowledge Base Article 835732.",
        "error": true,
        "extra": "Microsoft re-issued this bulletin on June 15, 2004 to advise on the availability of an updated Windows NT 4.0 Workstation update for the Pan Chinese language. This revised update corrects an installation issue that some customers experienced with the original update. This issue is unrelated to the security vulnerability discussed in this bulletin. However, this issue has caused some customers difficulty installing the update. If you have previously applied this security update, this update does need to be installed to avoid potential issues when installing future security updates. This issue only affects the Pan Chinese language version of the update and only those versions of the update are being re-released. Other language versions of this update are not affected and are not being re-released. This update resolves several newly-discovered vulnerabilities. Each vulnerability is documented in this bulletin in its own section. An attacker who successfully exploited the most severe of these vulnerabilities could take complete control of an affected system, including installing programs; viewing, changing, or deleting data; or creating new accounts that have full privileges. Microsoft recommends that customers apply the update immediately."
      }
    ],
    "CVE-2004-0123": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2004/ms04-011",
        "title": "Security Update for Microsoft Windows (835732)",
        "body": "Who should read this document: Customers who use Microsoft® Windows® Impact of vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately. Security Update Replacement: This bulletin replaces several prior security updates. See the frequently asked questions (FAQ) section of this bulletin for the complete list. Caveats: The security update for Windows NT Server 4.0 Terminal Server Edition Service Pack 6 requires, as a prerequisite, the Windows NT Server 4.0 Terminal Server Edition Security Rollup Package (SRP). To download the SRP, visit the following Web site. You must install the SRP before you install the security update that is provided in this security bulletin. If you are not using Windows NT Server 4.0 Terminal Server Edition Service Pack 6 you do not need to install the SRP. Microsoft Knowledge Base Article 835732 documents the currently known issues that customers may experience when they install this security update. The article also documents recommended solutions for these issues. For more information, see Microsoft Knowledge Base Article 835732.",
        "error": true,
        "extra": "Microsoft re-issued this bulletin on June 15, 2004 to advise on the availability of an updated Windows NT 4.0 Workstation update for the Pan Chinese language. This revised update corrects an installation issue that some customers experienced with the original update. This issue is unrelated to the security vulnerability discussed in this bulletin. However, this issue has caused some customers difficulty installing the update. If you have previously applied this security update, this update does need to be installed to avoid potential issues when installing future security updates. This issue only affects the Pan Chinese language version of the update and only those versions of the update are being re-released. Other language versions of this update are not affected and are not being re-released. This update resolves several newly-discovered vulnerabilities. Each vulnerability is documented in this bulletin in its own section. An attacker who successfully exploited the most severe of these vulnerabilities could take complete control of an affected system, including installing programs; viewing, changing, or deleting data; or creating new accounts that have full privileges. Microsoft recommends that customers apply the update immediately."
      }
    ],
    "CVE-2004-0203": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2004/ms04-026",
        "title": "Vulnerability in Exchange Server 5.5 Outlook Web Access Could Allow Cross-Site Scripting and Spoofing Attacks (842436)",
        "body": "Who should read this document: System administrators who have servers running Microsoft® Exchange Server 5.5 Outlook® Web Access Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Moderate Recommendation: Customers should consider applying the security update. Security Update Replacement: This update replaces the security update that is provided in Microsoft Security Bulletin MS03-047. Caveats: Customers who have customized any of the Active Server Pages (ASP) pages that are listed in the File Information section in this document should back up those files before they apply this update because those ASPs will be overwritten when the update is applied. Any customizations would then have to be reapplied to the new ASP pages. Version Requirements for Dependent Components for This Update:To install successfully, this update requires that the Microsoft Outlook Web Access server have either: Internet Explorer 5.01 Service Pack 3 (SP3) installed when using Windows 2000 SP3; Internet Explorer 5.01 SP4 installed when using Windows 2000 SP4; or Internet Explorer 6 SP1installed when using other supported operating systems. Version Recommendations for Dependent Components on the Outlook Web Access Server:At the time of this writing, the following versions are recommended for dependent components on the Outlook Web Access server: Microsoft Internet Information Services (IIS):IIS 4.0 on Windows NT 4.0 SP6IIS 5.0 on Windows 2000 SP3 or laterMicrosoft Internet Explorer:Internet Explorer 6.0",
        "error": true,
        "extra": "This update resolves a newly-discovered, privately reported vulnerability. A cross-site scripting and spoofing vulnerability exists in Outlook Web Access for Exchange Server 5.5 that could allow an attacker to convince a user to run a malicious script. The vulnerability is documented in the Vulnerability Details section of this bulletin. An attacker who successfully exploited the vulnerability could manipulate Web browser caches and intermediate proxy server caches, and put spoofed content in those caches. They may also be able to exploit the vulnerability to perform cross-site scripting attacks. We recommend that customers consider applying the security update. Note Customers who have customized any of the ASP pages that are listed in the File Information section in this document should back up those files before they apply this update because those ASPs will be overwritten when the update is applied. Any customizations would then have to be reapplied to the new ASP pages. See Microsoft Knowledge Base Article 327178 for the Microsoft support policy for the customization of Outlook Web Access."
      }
    ],
    "CVE-2004-0574": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2004/ms04-036",
        "title": "Vulnerability in NNTP Could Allow Remote Code Execution (883935)",
        "body": "Who should read this document: Customers who use Microsoft Windows or Microsoft Exchange Server Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately. Security Update Replacement: None Caveats: None",
        "error": true,
        "extra": "This update resolves a newly-discovered, privately reported vulnerability. A remote code execution vulnerability exists within the Network News Transfer Protocol (NNTP) component of the affected operating systems. This vulnerability could potentially affect systems that do not use NNTP. This is because some programs that are listed in the affected software section require that the NNTP component be enabled before you can install them. The vulnerability is documented in the Vulnerability Details section of this bulletin. An attacker who successfully exploited this vulnerability could take complete control of an affected system, including installing programs; viewing, changing, or deleting data; or creating new accounts that have full privileges. We recommend that customers apply the update immediately."
      }
    ],
    "CVE-2004-0840": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2004/ms04-035",
        "title": "Vulnerability in SMTP Could Allow Remote Code Execution (885881)",
        "body": "Who should read this document: System administrators who use Microsoft Exchange 2000 Server, Microsoft Exchange Server 2003, Windows XP 64-Bit Edition Version 2003, or Windows Server 2003 Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately. Security Update Replacement: None Caveats: The security update for Exchange 2000 Server Service Pack 3 requires, as a prerequisite, the Exchange 2000 Server Post-Service Pack 3 (SP3) Update Rollup. You must install the Update Rollup for Exchange 2000 (KB870540) before you install the security update that is provided in this security bulletin. This security update will detect whether the Update Rollup is installed. If the Update Rollup is not installed, you will be directed to the download Web site. For more information, see Microsoft Knowledge Base Article 870540. To download the prerequisite update, visit this Web site.",
        "error": true,
        "extra": "Subsequent to the release of this bulletin, it was determined that a variation of the vulnerability addressed also affects Exchange 2000 Server. Microsoft has updated the bulletin, on February 8, 2005, with additional information about Exchange 2000 Server and also to direct users to a security update for this additional affected platform. This update resolves a newly-discovered vulnerability. A remote code execution vulnerability exists in the Simple Mail Transfer Protocol (SMTP) component that is provided as part of the affected software. The vulnerability is documented in the Vulnerability Details section of this bulletin. An attacker who successfully exploited this vulnerability could take complete control of an affected system, including installing programs; viewing, changing, or deleting data; or creating new accounts that have full privileges. We recommend that customers apply the update immediately."
      }
    ],
    "CVE-2004-0847": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2005/ms05-004",
        "title": "ASP.NET Path Validation Vulnerability (887219)",
        "body": "Who should read this document: Customers who use Microsoft® Windows® .NET Framework Impact of Vulnerability: Information Disclosure, possible Elevation of Privilege Maximum Severity Rating: Important Recommendation: Customers should install the update at the earliest opportunity. Security Update Replacement: None. Caveats: Microsoft Knowledge Base Article 887219 documents the currently known issues that customers may experience when they install this security update. The article also documents recommended solutions for these issues. For more information, see Microsoft Knowledge Base Article 887219.",
        "error": true,
        "extra": "This update resolves a public vulnerability in ASP.NET that could allow an attacker to bypass the security of an ASP.NET Web site and gain unauthorized access. The vulnerability is documented in the Vulnerability Details section of this bulletin.An attacker who successfully exploited this vulnerability could gain unauthorized access to parts of a Web site. The actions that the attacker could take would depend on the specific content being protected."
      }
    ],
    "CVE-2004-0978": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2004/ms04-038",
        "title": "Cumulative Security Update for Internet Explorer (834707)",
        "body": "Who should read this document: Customers who use Microsoft Windows Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should install the update immediately. Security Update Replacement: This update replaces the update that is included with Microsoft Security Bulletin MS04-025. That update is also a cumulative update. Caveats: Microsoft Knowledge Base Article 834707 documents the currently known issues that customers may experience when they install this security update. The article also documents recommended solutions for these issues. This update may not include hotfixes that have been released since the release of MS04-004 or MS04-025. Customers who have received hotfixes from Microsoft or from their support providers since the release of MS04-004 or MS04-025 should review the FAQ section for this update to determine how this update might affect their operating systems. This update contains several functionality and security changes which are documented in the FAQ section for this update.",
        "error": true,
        "extra": "This update resolves several newly discovered publicly and privately reported vulnerabilities. Each vulnerability is documented in this bulletin in its own Vulnerability Details section. If a user is logged on with administrative privileges, an attacker who successfully exploited the most severe of these vulnerabilities could take complete control of an affected system, including installing programs; viewing, changing, or deleting data; or creating new accounts with full privileges. Users whose accounts are configured to have fewer privileges on the system would be at less risk than users who operate with administrative privileges. Microsoft recommends that customers install the update immediately."
      }
    ],
    "CVE-2004-1166": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2006/ms06-042",
        "title": "Cumulative Security Update for Internet Explorer (918899)",
        "body": "Who should read this document: Customers who use Microsoft Windows Impact of Vulnerability: Remote Code Execution Maximum Severity Rating: Critical Recommendation: Customers should apply the update immediately. Security Update Replacement: This bulletin replaces several prior security updates. See the frequently asked questions (FAQ) section of this bulletin for the complete list. Caveats: On September 12, 2006, this Security Bulletin and Internet Explorer 6 Service Pack 1, Internet Explorer 5.01 Service Pack 4, and Internet Explorer 6 for Microsoft Windows Server 2003 security updates were updated to address a vulnerability documented in the Vulnerability Details section as Long URL Buffer Overflow – CVE-2006-3873. Customers using these versions of Internet Explorer should apply the new update immediately. On August 24, 2006 this Security Bulletin and the Internet Explorer 6 Service Pack 1 security updates were updated to address an issue documented in Microsoft Knowledge Base Article 923762. This issue may lead to an additional buffer overrun condition only affecting Internet Explorer 6 Service Pack 1 customers that have applied the original version of that update released August 8th, 2006. The security issue is documented in the Vulnerability Details section as Long URL Buffer Overflow – CVE-2006-3869. Internet Explorer 6 Service Pack 1 Customers should apply the new update immediately. Microsoft Knowledge Base Article 918899 documents this and any other currently known issues that customers may experience when they install this security update. The article also documents recommended solutions for these issues. For more information, see Microsoft Knowledge Base Article 918899.",
        "error": true,
        "extra": "This update resolves several newly discovered, publicly and privately reported vulnerabilities. Each vulnerability is documented in its own “Vulnerability Details” section of this bulletin. If a user is logged on with administrative user rights, an attacker who successfully exploited the most severe of these vulnerabilities could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. Users whose accounts are configured to have fewer user rights on the system could be less impacted than users who operate with administrative user rights. We recommend that customers apply the update immediately."
      }
    ]
  }
}