{
  "year": 2016,
  "total": 101,
  "reference": "exchange.xforce.ibmcloud.com",
  "reports": {
    "CVE-2016-0205": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/109394",
        "title": "IBM Cloud Orchestrator information disclosure",
        "body": "A vulnerability has been identified in IBM Cloud Orchestrator 2.3, 2.3.0.1, 2.4, and 2.4.0.1 that could allow an attacker after authentication to enumerate valid users of the system. IBM X-Force ID: 109394.Refer to IBM Security Bulletin C4000049 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-0207": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/109399",
        "title": "IBM Algorithmics One-Algo Risk Application clickjacking",
        "body": "IBM Algorithmics One-Algo Risk Application could allow a remote attacker to hijack the clicking action of the victim. A remote attacker could send a specially-crafted HTTP request to hijack the victim's click actions from the system.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-0223": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/110006",
        "title": "IBM Forms Server cross-site scripting",
        "body": "IBM Forms Server is vulnerable to cross-site scripting, caused by improper validation of user-supplied input. A remote attacker could exploit this vulnerability using a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Refer to IBM Security Bulletin 1977574 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-0237": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/110328",
        "title": "IBM Security Guardium Database Activity Monitor information disclosure",
        "body": "IBM Security Guardium Database Activity Monitor contains locally cached browser data, that could allow a local attacker to obtain sensitive information.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-0238": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/110409",
        "title": "IBM Security Guardium information disclosure",
        "body": "IBM Security Guardium 9.0, 9.1, 9.5, 10.0, and 10.1 transmits sensitive data in cleartext in the query of the request. This could allow an attacker to obtain sensitive information using man in the middle techniques. IBM X-Force ID: 110409Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2016-0253": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/110562",
        "title": "IBM Financial Transaction Manager cross-site scripting",
        "body": "IBM Financial Transaction Manager for ACH Services for Multi-Platform is vulnerable to cross-site scripting, caused by improper validation of user-supplied input. A remote attacker could exploit this vulnerability using a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2016-0261": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/110604",
        "title": "IBM Curam Social Program Management cross-site scripting",
        "body": "IBM Curam Social Program Management is vulnerable to cross-site scripting, caused by improper validation of user-supplied input. A remote attacker could exploit this vulnerability using a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Refer to IBM Security Bulletin 1981103 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-0272": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/111052",
        "title": "IBM Financial Transaction Manager cross-site request forgery",
        "body": "IBM Financial Transaction Manager for ACH Services for Multi-Platform is vulnerable to cross-site request forgery, caused by improper validation of user-supplied input. By persuading an authenticated user to visit a malicious Web site, a remote attacker could send a malformed HTTP request. An attacker could exploit this vulnerability to perform cross-site scripting attacks, Web cache poisoning, and other malicious activities.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2016-0276": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/111084",
        "title": "IBM Financial Transaction Manager remote code execution",
        "body": "IBM Financial Transaction Manager for ACH Services for Multi-Platform could allow a remote attacker to execute arbitrary code on the system,. An attacker could exploit this vulnerability using a specially crafted serialized Java Message Service (JMS) ObjectMessage object to execute arbitrary code on the system.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2016-0286": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/111234",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-0291": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/111302",
        "title": "IBM BigFix command injection",
        "body": "The BigFix platform allows an authorized user with specific access to the report server to inject commands that would be executed by the operating system.Refer to IBM Security Bulletin 1985748 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-0295": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/111363",
        "title": "IBM BigFix Platform cross-site request forgery",
        "body": "The BigFix Platform is vulnerable to cross-site request forgery, caused by improper validation of user-supplied input. By persuading an authenticated user to visit a malicious Web site, a remote attacker could send a malformed HTTP request. An attacker could exploit this vulnerability to perform cross-site scripting attacks, Web cache poisoning, and other malicious activities.Refer to IBM Security Bulletin 1985830 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-0299": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/111382",
        "title": "IBM Tririga information disclosure",
        "body": "IBM Tririga could disclose sensitive information using a query to the IBM TRIRIGA platform database using crafted web service request by means of a HTTP / SOAP query.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2016-0300": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/111412",
        "title": "IBM TRIRIGA Application Platform security bypass",
        "body": "The IBM TRIRIGA Application Platform has a security flaw that grants unauthenticated access into all JSP pages within the application structure, which allowed for subsequent probing and exploitation.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2016-0311": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/111480",
        "title": "IBM Tivoli Business Service Manager cross-site scripting",
        "body": "IBM Tivoli Business Service Manager is vulnerable to cross-site scripting, caused by improper validation of user-supplied input. A remote attacker could exploit this vulnerability using a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-0312": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/111486",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-0327": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/111643",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-0335": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/111736",
        "title": "IBM Security Identity Manager Virtual Appliance cross-site request forgery",
        "body": "IBM Security Identity Manager Virtual Appliance is vulnerable to cross-site request forgery, caused by improper validation of user-supplied input. By persuading an authenticated user to visit a malicious Web site, a remote attacker could send a malformed HTTP request. An attacker could exploit this vulnerability to perform cross-site scripting attacks, Web cache poisoning, and other malicious activities.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-0336": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/111737",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-0343": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/111784",
        "title": "IBM TRIRIGA Application information disclosure",
        "body": "IBM TRIRIGA could allow an authenticated user to obtain sensitive information displayed in error messages.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2016-0345": [
      {
        "url": "http://exchange.xforce.ibmcloud.com/vulnerabilities/111786",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-0348": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/111813",
        "title": "IBM TRIRIGA Application cross-site request forgery",
        "body": "IBM TRIRIGA is vulnerable to cross-site request forgery, caused by improper validation of user-supplied input. By persuading an authenticated user to visit a malicious Web site, a remote attacker could send a malformed HTTP request. An attacker could exploit this vulnerability to perform cross-site scripting attacks, Web cache poisoning, and other malicious activities.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2016-0351": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/111890",
        "title": "IBM Security Identity Manager Virtual Appliance information disclosure",
        "body": "IBM Security Identity Manager Virtual Appliance could allow a remote attacker to obtain sensitive information, caused by the failure to set the secure flag for the session cookie in SSL mode. By intercepting its transmission within an HTTP session, an attacker could exploit this vulnerability to capture the cookie and obtain sensitive information.Refer to IBM Security Bulletin 1989198 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-0355": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/111894",
        "title": "IBM Sametime Enterprise Meeting Server denial of service",
        "body": "IBM Sametime Enterprise Meeting Server 8.5.2 and 9.0 could allow an authenticated user that has been invited to a Sametime meeting room, to cause the screen sharing to cease through the use of cross-site request forgery. IBM X-Force ID: 111894.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-0356": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/111895",
        "title": "IBM Sametime Enterprise Meeting Server denial of service",
        "body": "IBM Sametime Enterprise Meeting Server 8.5.2 and 9.0 could allow an authenticated user that has been invited to a Sametime meeting room, to cause the screen sharing to cease through the use of cross-site request forgery. IBM X-Force ID: 111895.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-0358": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/111928",
        "title": "IBM Sametime security bypass",
        "body": "IBM Sametime 8.5.2 and 9.0 could allow an unauthorized authenticated user to enumerate group chat ID numbers and join meetings that he was not invited to. IBM X-Force ID: 111928.Refer to IBM Security Bulletin 2006441 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-0366": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/112071",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-0367": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/112072",
        "title": "IBM Security Identity Manager Virtual Appliance information disclosure",
        "body": "IBM Security Identity Manager Virtual Appliance displays sensitive information in an error message that an authenticated user could use to perform further attacks against the system.Refer to IBM Security Bulletin 1989198 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-10503": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/113803",
        "title": "IBM Sametime Meeting Server vote spoofing",
        "body": "IBM Sametime Meeting Server 8.5.2 and 9.0 could allow an authenticated and invited user of Sametime meeting to lower any or all hands in an e-meeting, thus spoofing results of votes in the meeting. IBM X-Force ID: 113803.Refer to IBM Security Bulletin 2006439 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-2959": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/113804",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-2964": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/113813",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-2965": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/113846",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-2966": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/113847",
        "title": "IBM Sametime security bypass",
        "body": "IBM Sametime 8.5.1 and 9.0 could allow an authenticated user to enumerate meeting rooms by guessing the meeting room id. IBM X-Force ID: 113847.Refer to IBM Security Bulletin 2006441 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-2967": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/113848",
        "title": "IBM Sametime cross-site scripting",
        "body": "IBM Sametime 8.5.2 and 9.0 is vulnerable to cross-site scripting. This vulnerability allows users to embed arbitrary JavaScript code in the Sametime away message altering the intended functionality potentially leading to credentials disclosure within a trusted session. IBM X-Force ID: 113848.Refer to IBM Security Bulletin 2006441 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-2969": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/113850",
        "title": "IBM Sametime Meeting Server information disclosure",
        "body": "IBM Sametime Meeting Server 8.5.2 and 9.0 may send replies that contain emails of people that should not be in these messages. IBM X-Force ID: 113850.Refer to IBM Security Bulletin 2006439 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-2970": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/113851",
        "title": "IBM Sametime information disclosure",
        "body": "IBM Sametime 8.5 and 9.0 meetings server may provide detailed information in an error message that may provide details about the application to possible attackers. IBM X-Force ID: 113851.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-2971": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/113898",
        "title": "IBM Sametime Media Services information disclosure",
        "body": "IBM Sametime Media Services 8.5.2 and 9.0 can disclose sensitive information in stack trace error logs that could aid an attacker in future attacks. IBM X-Force ID: 113898.Refer to IBM Security Bulletin 2006439 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-2973": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/113899",
        "title": "IBM Sametime Media Services cross-site scripting",
        "body": "IBM Sametime Media Services 8.5.2 and 9.0 is vulnerable to cross-site scripting. This vulnerability allows users to embed arbitrary JavaScript code in the Web UI thus altering the intended functionality potentially leading to credentials disclosure within a trusted session. IBM X-Force ID: 113899.Refer to IBM Security Bulletin 2006439 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-2974": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/113934",
        "title": "IBM Sametime Connect information disclosure",
        "body": "IBM Sametime Connect 8.5.2 and 9.0, after uninstalling the Sametime Rich Client, could disclose potentially sensitive information related to the Sametime environment as well as other users on the local machine of the user. IBM X-Force ID: 113934.Refer to IBM Security Bulletin 2006444 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-2975": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/113935",
        "title": "IBM Sametime cross-site scripting",
        "body": "IBM Sametime 8.5.2 and 9.0 is vulnerable to cross-site scripting. This vulnerability allows users to embed arbitrary JavaScript code in the Web UI thus altering the intended functionality potentially leading to credentials disclosure within a trusted session. IBM X-Force ID: 113935.Refer to IBM Security Bulletin 2006441 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-2976": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/113936",
        "title": "IBM Sametime Meeting Server information disclosure",
        "body": "IBM Sametime Meeting Server 8.5.2 and 9.0 could allow a meeting invitee to obtain previously cleared sensitive information by viewing the meeting report history. IBM X-Force ID: 113936.Refer to IBM Security Bulletin 2006441 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-2977": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/113937",
        "title": "IBM Sametime Meeting Server spoofing",
        "body": "IBM Sametime Meeting Server 8.5.2 and 9.0 could allow a malicious user to lower other users hands in the meeting. IBM X-Force ID: 113937.Refer to IBM Security Bulletin 2006439 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-2978": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/113938",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-2979": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/113945",
        "title": "IBM Sametime Meeting Server cross-site scripting",
        "body": "IBM Sametime Meeting Server 8.5.2 and 9.0 is vulnerable to cross-site scripting. This vulnerability allows users to embed arbitrary JavaScript code in the Web UI thus altering the intended functionality potentially leading to credentials disclosure within a trusted session. IBM X-Force ID: 113945.Refer to IBM Security Bulletin 2006439 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-2983": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/113999",
        "title": "IBM Tealeaf Customer Experience security bypass",
        "body": "IBM Tealeaf Customer Experience 8.7, 8.8, and 9.0.2 could allow a remote attacker under unusual circumstances to read operational data or TLS session state for any active sessions, cause denial of service, or bypass security. IBM X-Force ID: 113999.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2016-3048": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/114711",
        "title": "IBM OpenPages GRC Platform cross-site scripting",
        "body": "IBM OpenPages GRC Platform 7.1, 7.2, and 7.3 is vulnerable to cross-site scripting. This vulnerability allows users to embed arbitrary JavaScript code in the Web UI thus altering the intended functionality potentially leading to credentials disclosure within a trusted session. IBM X-Force ID: 114711.Refer to IBM Security Bulletin 1997685 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-3049": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/114712",
        "title": "IBM OpenPages GRC Platform HTML injection",
        "body": "IBM OpenPages GRC Platform 7.1, 7.2, and 7.3 is vulnerable to HTML injection. A remote attacker could inject malicious HTML code, which when viewed, would be executed in the victim's Web browser within the security context of the hosting site. IBM X-Force ID: 114712.Refer to IBM Security Bulletin 1997686 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-3051": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/114714",
        "title": "IBM Security Access Manager for Web security bypass",
        "body": "IBM Security Access Manager for Web 9.0.0 could allow an authenticated user to access some privileged functionality of the server. IBM X-Force ID: 114714Refer to IBM Security Bulletin 1995724 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-5893": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/115336",
        "title": "IBM Sterling B2B Integrator Standard Edition information disclosure",
        "body": "IBM Sterling B2B Integrator Standard Edition 5.2 allows web pages to be stored locally which can be read by another user on the system. IBM X-Force ID: 115336Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-5959": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/116136",
        "title": "IBM Security Privileged Identity Manager information disclosure",
        "body": "IBM Security Privileged Identity Manager 2.0.2 and 2.1.0 stores sensitive information in URL parameters. This may lead to information disclosure if unauthorized parties have access to the URLs via server logs, referrer header or browser history. IBM X-Force ID: 116136Refer to IBM Security Bulletin 2003092 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-5960": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/116171",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-6018": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/116738",
        "title": "IBM Emptoris Contract Management information disclosure",
        "body": "IBM Emptoris Contract Management 10.0 and 10.1 reveals detailed error messages in certain features that could cause an attacker to gain additional information to conduct further attacks. IBM X-Force ID: 116738.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-6021": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/116755",
        "title": "IBM Emptoris Strategic Supply Management cross-site scripting",
        "body": "IBM Emptoris Strategic Supply Management Platform 10.0 and 10.1 is vulnerable to cross-site scripting. This vulnerability allows users to embed arbitrary JavaScript code in the Web UI thus altering the intended functionality potentially leading to credentials disclosure within a trusted session. IBM X-Force ID: 116755.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-6024": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/116868",
        "title": "IBM Jazz Foundation information disclosure",
        "body": "IBM Jazz technology based products might divulge information that might be useful in helping attackers through error messages. IBM X-Force ID: 116868.Refer to IBM Security Bulletin 2010512 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-6029": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/116881",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-6083": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/117696",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-6087": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/117918",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-6114": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/118352",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-6118": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/118356",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-6121": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/118383",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-8232": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/121443",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-8937": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/118750",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-8939": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/118790",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-8946": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/118833",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-8948": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/118835",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-8950": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/118837",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-8951": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/118838",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-8952": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/118839",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-8964": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/118853",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-8975": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/118912",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-8987": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/119039",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-9700": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/119528",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-9701": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/119529",
        "title": "IBM Team Concert cross-site scripting",
        "body": "IBM Team Concert 4.0, 5.0 and 6.0 is vulnerable to cross-site scripting. This vulnerability allows users to embed arbitrary JavaScript code in the Web UI thus altering the intended functionality potentially leading to credentials disclosure within a trusted session. IBM X-Force ID: 119529.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-9710": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/119618",
        "title": "IBM Predictive Solutions Foundation file include",
        "body": "IBM Predictive Solutions Foundation (formerly PMQ) could allow a remote attacker to include arbitrary files. A remote attacker could send a specially-crafted URL to specify a file from the local system, which could allow the attacker to obtain sensitive information. IBM X-Force ID: 119618Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-9711": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/119619",
        "title": "IBM Predictive Solutions Foundation information disclosure",
        "body": "IBM Predictive Solutions Foundation (IBM Cognos Analytics 11.0) reveals sensitive information in detailed error messages that could aid an attacker in further attacks against the system. IBM X-Force ID: 119619.Refer to IBM Security Bulletin 2014337 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-9714": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/119727",
        "title": "IBM InfoSphere Master Data Management Server cross-site request forgery",
        "body": "IBM InfoSphere Master Data Management Server 10.1, 11.0, 11.3, 11.4, 11.5, and 11.6 is vulnerable to cross-site request forgery which could allow an attacker to execute malicious and unauthorized actions transmitted from a user that the website trusts. IBM X-Force ID: 119727.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2016-9715": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/119728",
        "title": "IBM InfoSphere Master Data Management Server cross-site scripting",
        "body": "IBM InfoSphere Master Data Management Server 11.0, 11.3, 11.4, 11.5, and 11.6 is vulnerable to cross-site scripting. This vulnerability allows users to embed arbitrary JavaScript code in the Web UI thus altering the intended functionality potentially leading to credentials disclosure within a trusted session. IBM X-Force ID: 119728.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2016-9716": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/119729",
        "title": "IBM InfoSphere Master Data Management Server cross-site request forgery",
        "body": "IBM InfoSphere Master Data Management Server 11.0, 11.3, 11.4, 11.5, and 11.6 is vulnerable to cross-site request forgery which could allow an attacker to execute malicious and unauthorized actions transmitted from a user that the website trusts. IBM X-Force ID: 119729.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2016-9717": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/119730",
        "title": "IBM Infosphere Master Data Management (MDM) parameter override",
        "body": "HTTP Parameter Override is identified in the IBM Infosphere Master Data Management (MDM) 10.1. 11.0. 11.3, 11.4, 11.5, and 11.6 product. It enables attackers by exposing the presence of duplicated parameters which may produce an anomalous behavior in the application that can be potentially exploited.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2016-9718": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/119732",
        "title": "IBM InfoSphere Master Data Management Server cross-site scripting",
        "body": "IBM InfoSphere Master Data Management Server 10.1. 11.0. 11.3, 11.4, 11.5, and 11.6 is vulnerable to cross-site scripting. This vulnerability allows users to embed arbitrary JavaScript code in the Web UI thus altering the intended functionality potentially leading to credentials disclosure within a trusted session. IBM X-Force ID: 119732.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2016-9719": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/119733",
        "title": "IBM InfoSphere Master Data Management Server clickjacking",
        "body": "IBM InfoSphere Master Data Management Server 10.1. 11.0. 11.3, 11.4, 11.5, and 11.6 could allow a remote attacker to hijack the clicking action of the victim. By persuading a victim to visit a malicious Web site, a remote attacker could exploit this vulnerability to hijack the victim's click actions and possibly launch further attacks against the victim. IBM X-Force ID: 119733.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2016-9732": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/119761",
        "title": "IBM Curam Social Program Management cross-site scripting",
        "body": "IBM Curam Social Program Management 6.0, 6.1, 6.2 and 7.0 is vulnerable to cross-site scripting. This vulnerability allows users to embed arbitrary JavaScript code in the Web UI thus altering the intended functionality potentially leading to credentials disclosure within a trusted session. IBM X-Force ID: 119761.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-9733": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/119762",
        "title": "IBM Team Concert cross-site scripting",
        "body": "IBM Team Concert (RTC) 4.0, 5.0 and 6.0 is vulnerable to cross-site scripting. This vulnerability allows users to embed arbitrary JavaScript code in the Web UI thus altering the intended functionality potentially leading to credentials disclosure within a trusted session. IBM X-Force ID: 119762.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-9736": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/119780",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-9746": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/119821",
        "title": "IBM Team Concert cross-site scripting",
        "body": "IBM Team Concert (RTC) 4.0, 5.0 and 6.0 is vulnerable to cross-site scripting. This vulnerability allows users to embed arbitrary JavaScript code in the Web UI thus altering the intended functionality potentially leading to credentials disclosure within a trusted session. IBM X-Force ID: 119821.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-9749": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/120206",
        "title": "IBM Campaign security bypass",
        "body": "IBM Campaign 9.1.0, 9.1.2, 10.0, and 10.1 could allow an authenticated user with access to the local network to bypass security due to lack of input validation. IBM X-Force ID: 120206.Refer to IBM Security Bulletin 738293 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-9972": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/120208",
        "title": "IBM QRadar information disclosure",
        "body": "IBM QRadar 7.2 and 7.3 could allow a remote attacker to obtain sensitive information, caused by the failure to properly enable HTTP Strict Transport Security. An attacker could exploit this vulnerability to obtain sensitive information using man in the middle techniques. IBM X-Force ID: 120208Refer to IBM Security Bulletin 2004925 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-9973": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/120209",
        "title": "IBM Jazz Foundation cross-site scripting",
        "body": "IBM Jazz Foundation is vulnerable to cross-site scripting. This vulnerability allows users to embed arbitrary JavaScript code in the Web UI thus altering the intended functionality potentially leading to credentials disclosure within a trusted session. IBM X-Force ID: 120209Refer to IBM Security Bulletin 2004534 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-9977": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/120253",
        "title": "IBM Maximo Asset Management session hijacking",
        "body": "IBM Maximo Asset Management 7.1, 7.5, and 7.6 could allow a remote attacker to hijack a user's session, caused by the failure to invalidate an existing session identifier. An attacker could exploit this vulnerability to gain access to another user's session. IBM X-Force ID: 120253Refer to IBM Security Bulletin 2003981 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-9982": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/120274",
        "title": "IBM Sterling B2B Integrator Standard Edition information disclosure",
        "body": "IBM Sterling B2B Integrator Standard Edition 5.2 could allow an authenticated user to obtain sensitive information such as account lists due to improper access control. IBM X-Force ID: 120274Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-9983": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/120275",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-9984": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/120276",
        "title": "IBM Maximo Asset Management privilege escalation",
        "body": "IBM Maximo Asset Management 7.5 and 7.6 could allow a remote authenticated attacker to execute arbitrary commands on the system as administrator. IBM X-Force ID: 120276Refer to IBM Security Bulletin 1998608 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2016-9986": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/120552",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-9987": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/120553",
        "title": "IBM Jazz Foundation Reporting Service cross-site scripting",
        "body": "IBM Jazz Foundation Reporting Service (JRS) 5.0 and 6.0 is vulnerable to cross-site scripting. This vulnerability allows users to embed arbitrary JavaScript code in the Web UI thus altering the intended functionality potentially leading to credentials disclosure within a trusted session. IBM X-Force ID: 120553.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2016-9988": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/120554",
        "title": "IBM Jazz Foundation Reporting Service cross-site scripting",
        "body": "IBM Jazz Foundation Reporting Service (JRS) 5.0 and 6.0 is vulnerable to cross-site scripting. This vulnerability allows users to embed arbitrary JavaScript code in the Web UI thus altering the intended functionality potentially leading to credentials disclosure within a trusted session. IBM X-Force ID: 120554.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2016-9989": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/120555",
        "title": "IBM Jazz Foundation Reporting Service cross-site scripting",
        "body": "IBM Jazz Foundation Reporting Service (JRS) 5.0 and 6.0 is vulnerable to cross-site scripting. This vulnerability allows users to embed arbitrary JavaScript code in the Web UI thus altering the intended functionality potentially leading to credentials disclosure within a trusted session. IBM X-Force ID: 120555.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2016-9991": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/121314",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-0344": [
      {
        "url": "http://exchange.xforce.ibmcloud.com/vulnerabilities/111785",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2016-2981": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/113994?cm_mc_uid=06394756914614889387221&cm_mc_sid_50200000=1490229077",
        "title": "IBM CLM information disclosure",
        "body": "An undisclosed vulnerability in the CLM applications may allow unauthorized access to user credentials. IBM Reference #: 1999965Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2016-6019": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/116739",
        "title": "IBM Emptoris Strategic Supply Management Platform cross-site scripting",
        "body": "IBM Emptoris Strategic Supply Management Platform 10.0.0.x through 10.1.1.x is vulnerable to cross-site scripting. This vulnerability allows users to embed arbitrary JavaScript code in the Web UI thus altering the intended functionality potentially leading to credentials disclosure within a trusted session. IBM X-Force ID: 116739.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2016-9747": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/119822",
        "title": "IBM RELM cross-site scripting",
        "body": "IBM RELM 4.0, 5.0 and 6.0 is vulnerable to cross-site scripting. This vulnerability allows users to embed arbitrary JavaScript code in the Web UI thus altering the intended functionality potentially leading to credentials disclosure within a trusted session. IBM X-Force ID: 119822Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References."
      }
    ]
  }
}