{
  "year": 2016,
  "total": 85,
  "reference": "usn.ubuntu.com",
  "reports": {
    "CVE-2016-0762": [
      {
        "url": "https://usn.ubuntu.com/4557-1/",
        "title": "USN-4557-1: Tomcat vulnerabilities",
        "body": "It was discovered that the Tomcat realm implementations incorrectly handled passwords when a username didn't exist. A remote attacker could possibly use this issue to enumerate usernames. (CVE-2016-0762)"
      }
    ],
    "CVE-2016-10087": [
      {
        "url": "https://usn.ubuntu.com/3712-1/",
        "title": "USN-3712-1: libpng vulnerabilities",
        "body": "Patrick Keshishian discovered that libpng incorrectly handled certain PNG files. An attacker could possibly use this to cause a denial of service. This issue only affected Ubuntu 14.04 LTS and Ubuntu 16.04 LTS. (CVE-2016-10087)"
      },
      {
        "url": "https://usn.ubuntu.com/3712-2/",
        "title": "USN-3712-2: libpng vulnerability",
        "body": "Details USN-3712-1 fixed a vulnerability in libpng. This update provides the corresponding update for Ubuntu 12.04 ESM. Original advisory details: Patrick Keshishian discovered that libpng incorrectly handled certain PNG files. An attacker could possibly use this to cause a denial of service."
      }
    ],
    "CVE-2016-10165": [
      {
        "url": "https://usn.ubuntu.com/3770-2/",
        "title": "USN-3770-2: Little CMS vulnerabilities",
        "body": "Ibrahim El-Sayed discovered that Little CMS incorrectly handled certain files. An attacker could possibly use this issue to cause a denial of service. (CVE-2016-10165)"
      },
      {
        "url": "https://usn.ubuntu.com/3770-1/",
        "title": "USN-3770-1: Little CMS vulnerabilities",
        "body": "Ibrahim El-Sayed discovered that Little CMS incorrectly handled certain files. An attacker could possibly use this issue to cause a denial of service. (CVE-2016-10165)"
      }
    ],
    "CVE-2016-10169": [
      {
        "url": "https://usn.ubuntu.com/3568-1/",
        "title": "USN-3568-1: WavPack vulnerabilities",
        "body": "Hanno Böck discovered that WavPack incorrectly handled certain WV files. An attacker could possibly use this to cause a denial of service. This issue only affected Ubuntu 14.04 LTS and Ubuntu 16.04 LTS. (CVE-2016-10169)"
      }
    ],
    "CVE-2016-10208": [
      {
        "url": "https://usn.ubuntu.com/3754-1/",
        "title": "USN-3754-1: Linux kernel vulnerabilities",
        "body": "Ralf Spenneberg discovered that the ext4 implementation in the Linux kernel did not properly validate meta block groups. An attacker with physical access could use this to specially craft an ext4 image that causes a denial of service (system crash). (CVE-2016-10208)"
      }
    ],
    "CVE-2016-10209": [
      {
        "url": "https://usn.ubuntu.com/3736-1/",
        "title": "USN-3736-1: libarchive vulnerabilities",
        "body": "It was discovered that libarchive incorrectly handled certain archive files. A remote attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 14.04 LTS and Ubuntu 16.04 LTS. (CVE-2016-10209, CVE-2016-10349, CVE-2016-10350)"
      }
    ],
    "CVE-2016-10253": [
      {
        "url": "https://usn.ubuntu.com/3571-1/",
        "title": "USN-3571-1: Erlang vulnerabilities",
        "body": "It was discovered that Erlang incorrectly handled certain regular expressions. A remote attacker could possibly use this issue to cause Erlang to crash, resulting in a denial of service, or execute arbitrary code. This issue only affected Ubuntu 16.04 LTS. (CVE-2016-10253)"
      }
    ],
    "CVE-2016-10317": [
      {
        "url": "https://usn.ubuntu.com/3636-1/",
        "title": "USN-3636-1: Ghostscript vulnerabilities",
        "body": "It was discovered that Ghostscript incorrectly handled certain PostScript files. An attacker could possibly use this to cause a denial of server. (CVE-2016-10317)"
      }
    ],
    "CVE-2016-10349": [
      {
        "url": "https://usn.ubuntu.com/3736-1/",
        "title": "USN-3736-1: libarchive vulnerabilities",
        "body": "It was discovered that libarchive incorrectly handled certain archive files. A remote attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 14.04 LTS and Ubuntu 16.04 LTS. (CVE-2016-10209, CVE-2016-10349, CVE-2016-10350)"
      }
    ],
    "CVE-2016-10350": [
      {
        "url": "https://usn.ubuntu.com/3736-1/",
        "title": "USN-3736-1: libarchive vulnerabilities",
        "body": "It was discovered that libarchive incorrectly handled certain archive files. A remote attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 14.04 LTS and Ubuntu 16.04 LTS. (CVE-2016-10209, CVE-2016-10349, CVE-2016-10350)"
      }
    ],
    "CVE-2016-10708": [
      {
        "url": "https://usn.ubuntu.com/3809-1/",
        "title": "USN-3809-1: OpenSSH vulnerabilities",
        "body": "Robert Swiecki discovered that OpenSSH incorrectly handled certain messages. An attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 14.04 LTS and Ubuntu 16.04 LTS. (CVE-2016-10708)"
      }
    ],
    "CVE-2016-10712": [
      {
        "url": "https://usn.ubuntu.com/3600-1/",
        "title": "USN-3600-1: PHP vulnerabilities",
        "body": "It was discovered that PHP incorrectly handled certain stream metadata. A remote attacker could possibly use this issue to set arbitrary metadata. This issue only affected Ubuntu 14.04 LTS. (CVE-2016-10712)"
      },
      {
        "url": "https://usn.ubuntu.com/3566-2/",
        "title": "USN-3566-2: PHP vulnerabilities",
        "body": "It was discovered that PHP incorrectly handled certain stream metadata. A remote attacker could possibly use this issue to set arbitrary metadata. This issue only affected Ubuntu 12.04 ESM. (CVE-2016-10712)"
      }
    ],
    "CVE-2016-10713": [
      {
        "url": "https://usn.ubuntu.com/3624-1/",
        "title": "USN-3624-1: Patch vulnerabilities",
        "body": "It was discovered that Patch incorrectly handled certain files. An attacker could possibly use this to cause a denial of service. (CVE-2016-10713)"
      },
      {
        "url": "https://usn.ubuntu.com/3624-2/",
        "title": "USN-3624-2: Patch vulnerabilities",
        "body": "It was discovered that Patch incorrectly handled certain files. An attacker could possibly use this to cause a denial of service. (CVE-2016-10713)"
      }
    ],
    "CVE-2016-10714": [
      {
        "url": "https://usn.ubuntu.com/3593-1/",
        "title": "USN-3593-1: Zsh vulnerabilities",
        "body": "It was discovered that Zsh incorrectly handled certain errors. An attacker could possibly use this issue to cause a denial of service. (CVE-2016-10714)"
      }
    ],
    "CVE-2016-10905": [
      {
        "url": "https://usn.ubuntu.com/4145-1/",
        "title": "USN-4145-1: Linux kernel vulnerabilities",
        "body": "It was discovered that a race condition existed in the GFS2 file system in the Linux kernel. A local attacker could possibly use this to cause a denial of service (system crash). (CVE-2016-10905)"
      }
    ],
    "CVE-2016-10906": [
      {
        "url": "https://usn.ubuntu.com/4163-1/",
        "title": "USN-4163-1: Linux kernel vulnerabilities",
        "body": "It was discovered that a race condition existed in the ARC EMAC ethernet driver for the Linux kernel, resulting in a use-after-free vulnerability. An attacker could use this to cause a denial of service (system crash). (CVE-2016-10906)"
      },
      {
        "url": "https://usn.ubuntu.com/4163-2/",
        "title": "USN-4163-2: Linux kernel (Xenial HWE) vulnerabilities",
        "body": "It was discovered that a race condition existed in the ARC EMAC ethernet driver for the Linux kernel, resulting in a use-after-free vulnerability. An attacker could use this to cause a denial of service (system crash). (CVE-2016-10906)"
      }
    ],
    "CVE-2016-2090": [
      {
        "url": "https://usn.ubuntu.com/4243-1/",
        "title": "USN-4243-1: libbsd vulnerabilities",
        "body": "It was discovered that libbsd incorrectly handled certain inputs. An attacker could possibly use this issue to execute arbitrary code. This issue only affected Ubuntu 14.04 ESM. (CVE-2016-2090)"
      }
    ],
    "CVE-2016-2147": [
      {
        "url": "https://usn.ubuntu.com/3935-1/",
        "title": "USN-3935-1: BusyBox vulnerabilities",
        "body": "Nico Golde discovered that the BusyBox DHCP client incorrectly handled certain malformed domain names. A remote attacker could possibly use this issue to cause the DHCP client to crash, leading to a denial of service. This issue only affected Ubuntu 14.04 LTS and Ubuntu 16.04 LTS. (CVE-2016-2147)"
      }
    ],
    "CVE-2016-2148": [
      {
        "url": "https://usn.ubuntu.com/3935-1/",
        "title": "USN-3935-1: BusyBox vulnerabilities",
        "body": "Nico Golde discovered that the BusyBox DHCP client incorrectly handled certain 6RD options. A remote attacker could use this issue to cause the DHCP client to crash, leading to a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 14.04 LTS and Ubuntu 16.04 LTS. (CVE-2016-2148)"
      }
    ],
    "CVE-2016-2569": [
      {
        "url": "https://usn.ubuntu.com/3557-1/",
        "title": "USN-3557-1: Squid vulnerabilities",
        "body": "Mathias Fischer discovered that Squid incorrectly handled certain long strings in headers. A malicious remote server could possibly cause Squid to crash, resulting in a denial of service. This issue was only addressed in Ubuntu 16.04 LTS. (CVE-2016-2569)"
      }
    ],
    "CVE-2016-2570": [
      {
        "url": "https://usn.ubuntu.com/3557-1/",
        "title": "USN-3557-1: Squid vulnerabilities",
        "body": "William Lima discovered that Squid incorrectly handled XML parsing when processing Edge Side Includes (ESI). A malicious remote server could possibly cause Squid to crash, resulting in a denial of service. This issue was only addressed in Ubuntu 16.04 LTS. (CVE-2016-2570)"
      }
    ],
    "CVE-2016-2571": [
      {
        "url": "https://usn.ubuntu.com/3557-1/",
        "title": "USN-3557-1: Squid vulnerabilities",
        "body": "Alex Rousskov discovered that Squid incorrectly handled response-parsing failures. A malicious remote server could possibly cause Squid to crash, resulting in a denial of service. This issue only applied to Ubuntu 16.04 LTS. (CVE-2016-2571)"
      },
      {
        "url": "https://usn.ubuntu.com/3557-1/",
        "title": "USN-3557-1: Squid vulnerabilities",
        "body": "Alex Rousskov discovered that Squid incorrectly handled response-parsing failures. A malicious remote server could possibly cause Squid to crash, resulting in a denial of service. This issue only applied to Ubuntu 16.04 LTS. (CVE-2016-2571)"
      }
    ],
    "CVE-2016-2774": [
      {
        "url": "https://usn.ubuntu.com/3586-1/",
        "title": "USN-3586-1: DHCP vulnerabilities",
        "body": "Konstantin Orekhov discovered that the DHCP server incorrectly handled a large number of concurrent TCP sessions. A remote attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 14.04 LTS and Ubuntu 16.04 LTS. (CVE-2016-2774)"
      }
    ],
    "CVE-2016-3948": [
      {
        "url": "https://usn.ubuntu.com/3557-1/",
        "title": "USN-3557-1: Squid vulnerabilities",
        "body": "Santiago Ruano Rincón discovered that Squid incorrectly handled certain Vary headers. A remote attacker could possibly use this issue to cause Squid to crash, resulting in a denial of service. This issue was only addressed in Ubuntu 16.04 LTS. (CVE-2016-3948)"
      }
    ],
    "CVE-2016-3954": [
      {
        "url": "https://usn.ubuntu.com/4030-1/",
        "title": "USN-4030-1: web2py vulnerabilities",
        "body": "It was discovered that web2py uses a hardcoded encryption key. An attacker could possibly use this issue to execute arbitrary code. (CVE-2016-3953, CVE-2016-3954, CVE-2016-3957)"
      }
    ],
    "CVE-2016-3977": [
      {
        "url": "https://usn.ubuntu.com/4107-1/",
        "title": "USN-4107-1: GIFLIB vulnerabilities",
        "body": "It was discovered that GIFLIB incorrectly handled certain GIF files. An attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 18.04 LTS. (CVE-2016-3977)"
      }
    ],
    "CVE-2016-4429": [
      {
        "url": "https://usn.ubuntu.com/3759-2/",
        "title": "USN-3759-2: libtirpc vulnerabilities",
        "body": "Aldy Hernandez discovered that libtirpc incorrectly handled certain inputs. An attacker could possibly use this issue to cause a denial of service. (CVE-2016-4429)"
      },
      {
        "url": "https://usn.ubuntu.com/3759-1/",
        "title": "USN-3759-1: libtirpc vulnerabilities",
        "body": "Aldy Hernandez discovered that libtirpc incorrectly handled certain inputs. An attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 14.04 LTS and Ubuntu 16.04 LTS. (CVE-2016-4429)"
      }
    ],
    "CVE-2016-5824": [
      {
        "url": "https://usn.ubuntu.com/3897-1/",
        "title": "USN-3897-1: Thunderbird vulnerabilities",
        "body": "A use-after-free was discovered in libical. If a user were tricked in to opening a specially crafted ICS calendar file, an attacker could potentially exploit this to cause a denial of service. (CVE-2016-5824)"
      }
    ],
    "CVE-2016-6153": [
      {
        "url": "https://usn.ubuntu.com/4019-1/",
        "title": "USN-4019-1: SQLite vulnerabilities",
        "body": "It was discovered that SQLite incorrectly handled certain inputs. An attacker could possibly use this issue to cause a denial of service. This issue only affected Ubuntu 16.04 LTS. (CVE-2016-6153)"
      },
      {
        "url": "https://usn.ubuntu.com/4019-2/",
        "title": "USN-4019-2: SQLite vulnerabilities",
        "body": "It was discovered that SQLite incorrectly handled certain inputs. An attacker could possibly use this issue to cause a denial of service. (CVE-2016-6153)"
      }
    ],
    "CVE-2016-6232": [
      {
        "url": "https://usn.ubuntu.com/4100-1/",
        "title": "USN-4100-1: KConfig and KDE libraries vulnerabilities",
        "body": "It was discovered that KConfig allows remote attackers to write to arbitrary files via a ../ in a filename in an archive file. (CVE-2016-6232)"
      }
    ],
    "CVE-2016-6328": [
      {
        "url": "https://usn.ubuntu.com/4277-1/",
        "title": "USN-4277-1: libexif vulnerabilities",
        "body": "Liu Bingchang discovered that libexif incorrectly handled certain files. An attacker could possibly use this issue to access sensitive information or cause a denial of service. This issue only affected Ubuntu 12.04 ESM, Ubuntu 14.04 ESM and Ubuntu 16.04 LTS. (CVE-2016-6328)"
      }
    ],
    "CVE-2016-6794": [
      {
        "url": "https://usn.ubuntu.com/4557-1/",
        "title": "USN-4557-1: Tomcat vulnerabilities",
        "body": "It was discovered that Tomcat incorrectly controlled reading system properties. A malicious application could possibly use this to bypass Security Manager restrictions. (CVE-2016-6794)"
      }
    ],
    "CVE-2016-6816": [
      {
        "url": "https://usn.ubuntu.com/4557-1/",
        "title": "USN-4557-1: Tomcat vulnerabilities",
        "body": "Regis Leroy discovered that Tomcat incorrectly filtered certain invalid characters from the HTTP request line. A remote attacker could possibly use this issue to inject data into HTTP responses. (CVE-2016-6816)"
      }
    ],
    "CVE-2016-7837": [
      {
        "url": "https://usn.ubuntu.com/4311-1/",
        "title": "USN-4311-1: BlueZ vulnerabilities",
        "body": "It was discovered that BlueZ incorrectly handled certain commands. A local attacker could use this issue to cause BlueZ to crash, resulting in a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 16.04 LTS. (CVE-2016-7837)"
      }
    ],
    "CVE-2016-7913": [
      {
        "url": "https://usn.ubuntu.com/3798-2/",
        "title": "USN-3798-2: Linux kernel (Trusty HWE) vulnerabilities",
        "body": "It was discovered that a use-after-free vulnerability existed in the device driver for XCeive xc2028/xc3028 tuners in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2016-7913)"
      },
      {
        "url": "https://usn.ubuntu.com/3798-1/",
        "title": "USN-3798-1: Linux kernel vulnerabilities",
        "body": "It was discovered that a use-after-free vulnerability existed in the device driver for XCeive xc2028/xc3028 tuners in the Linux kernel. A local attacker could use this to cause a denial of service (system crash) or possibly execute arbitrary code. (CVE-2016-7913)"
      }
    ],
    "CVE-2016-7942": [
      {
        "url": "https://usn.ubuntu.com/3758-2/",
        "title": "USN-3758-2: libx11 vulnerabilities",
        "body": "Tobias Stoeckmann discovered that libx11 incorrectly handled certain images. An attacker could possibly use this issue to access sensitive information (CVE-2016-7942)"
      },
      {
        "url": "https://usn.ubuntu.com/3758-1/",
        "title": "USN-3758-1: libx11 vulnerabilities",
        "body": "Tobias Stoeckmann discovered that libx11 incorrectly handled certain images. An attacker could possibly use this issue to access sensitive information (CVE-2016-7942)"
      }
    ],
    "CVE-2016-7943": [
      {
        "url": "https://usn.ubuntu.com/3758-2/",
        "title": "USN-3758-2: libx11 vulnerabilities",
        "body": "Tobias Stoeckmann discovered that libx11 incorrectly handled certain inputs. An attacker could possibly use this issue to access sensitive information. (CVE-2016-7943)"
      },
      {
        "url": "https://usn.ubuntu.com/3758-1/",
        "title": "USN-3758-1: libx11 vulnerabilities",
        "body": "Tobias Stoeckmann discovered that libx11 incorrectly handled certain inputs. An attacker could possibly use this issue to access sensitive information. (CVE-2016-7943)"
      }
    ],
    "CVE-2016-9311": [
      {
        "url": "https://usn.ubuntu.com/3707-2/",
        "title": "USN-3707-2: NTP vulnerabilities",
        "body": "Matthew Van Gundy discovered that NTP incorrectly handled the trap service. A remote attacker could possibly use this issue to cause NTP to crash, resulting in a denial of service. (CVE-2016-9311)"
      }
    ],
    "CVE-2016-9840": [
      {
        "url": "https://usn.ubuntu.com/4246-1/",
        "title": "USN-4246-1: zlib vulnerabilities",
        "body": "It was discovered that zlib incorrectly handled pointer arithmetic. An attacker could use this issue to cause zlib to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2016-9840, CVE-2016-9841)"
      },
      {
        "url": "https://usn.ubuntu.com/4292-1/",
        "title": "USN-4292-1: rsync vulnerabilities",
        "body": "It was discovered that rsync incorrectly handled pointer arithmetic in zlib. An attacker could use this issue to cause rsync to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2016-9840, CVE-2016-9841)"
      }
    ],
    "CVE-2016-9841": [
      {
        "url": "https://usn.ubuntu.com/4246-1/",
        "title": "USN-4246-1: zlib vulnerabilities",
        "body": "It was discovered that zlib incorrectly handled pointer arithmetic. An attacker could use this issue to cause zlib to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2016-9840, CVE-2016-9841)"
      },
      {
        "url": "https://usn.ubuntu.com/4292-1/",
        "title": "USN-4292-1: rsync vulnerabilities",
        "body": "It was discovered that rsync incorrectly handled pointer arithmetic in zlib. An attacker could use this issue to cause rsync to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2016-9840, CVE-2016-9841)"
      }
    ],
    "CVE-2016-9842": [
      {
        "url": "https://usn.ubuntu.com/4246-1/",
        "title": "USN-4246-1: zlib vulnerabilities",
        "body": "It was discovered that zlib incorrectly handled vectors involving left shifts of negative integers. An attacker could use this issue to cause zlib to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2016-9842)"
      },
      {
        "url": "https://usn.ubuntu.com/4292-1/",
        "title": "USN-4292-1: rsync vulnerabilities",
        "body": "It was discovered that rsync incorrectly handled vectors involving left shifts of negative integers in zlib. An attacker could use this issue to cause rsync to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2016-9842)"
      }
    ],
    "CVE-2016-9843": [
      {
        "url": "https://usn.ubuntu.com/4246-1/",
        "title": "USN-4246-1: zlib vulnerabilities",
        "body": "It was discovered that zlib incorrectly handled vectors involving big-endian CRC calculation. An attacker could use this issue to cause zlib to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2016-9843)"
      },
      {
        "url": "https://usn.ubuntu.com/4292-1/",
        "title": "USN-4292-1: rsync vulnerabilities",
        "body": "It was discovered that rsync incorrectly handled vectors involving big-endian CRC calculation in zlib. An attacker could use this issue to cause rsync to crash, resulting in a denial of service, or possibly execute arbitrary code. (CVE-2016-9843)"
      }
    ],
    "CVE-2016-9928": [
      {
        "url": "https://usn.ubuntu.com/4506-1/",
        "title": "USN-4506-1: MCabber vulnerability",
        "body": "It was discovered that MCabber does not properly manage roster pushes. An attacker could possibly use this issue to remotely perform man-in-the-middle attacks. (CVE-2016-9928)."
      }
    ],
    "CVE-2016-9941": [
      {
        "url": "https://usn.ubuntu.com/4587-1/",
        "title": "USN-4587-1: iTALC vulnerabilities",
        "body": "Josef Gajdusek discovered that iTALC had heap-based buffer overflow vulnerabilities. A remote attacker could used these issues to cause a denial of service or possibly execute arbitrary code. (CVE-2016-9941, CVE-2016-9942)"
      }
    ],
    "CVE-2016-9942": [
      {
        "url": "https://usn.ubuntu.com/4587-1/",
        "title": "USN-4587-1: iTALC vulnerabilities",
        "body": "Josef Gajdusek discovered that iTALC had heap-based buffer overflow vulnerabilities. A remote attacker could used these issues to cause a denial of service or possibly execute arbitrary code. (CVE-2016-9941, CVE-2016-9942)"
      }
    ],
    "CVE-2016-1000339": [
      {
        "url": "https://usn.ubuntu.com/3727-1/",
        "title": "USN-3727-1: Bouncy Castle vulnerabilities",
        "body": "Details It was discovered that Bouncy Castle incorrectly handled certain crypto algorithms. A remote attacker could possibly use these issues to obtain sensitive information, including private keys."
      }
    ],
    "CVE-2016-1000343": [
      {
        "url": "https://usn.ubuntu.com/3727-1/",
        "title": "USN-3727-1: Bouncy Castle vulnerabilities",
        "body": "Details It was discovered that Bouncy Castle incorrectly handled certain crypto algorithms. A remote attacker could possibly use these issues to obtain sensitive information, including private keys."
      }
    ],
    "CVE-2016-10245": [
      {
        "url": "https://usn.ubuntu.com/4002-1/",
        "title": "USN-4002-1: Doxygen vulnerability",
        "body": "Details It was discovered that Doxygen incorrectly handled certain queries. An attacker could possibly use this issue to execute arbitrary code and compromise sensitive information."
      }
    ],
    "CVE-2016-10248": [
      {
        "url": "https://usn.ubuntu.com/3693-1/",
        "title": "USN-3693-1: JasPer vulnerabilities",
        "body": "Details It was discovered that JasPer incorrectly handled certain malformed JPEG-2000 image files. If a user or automated system using JasPer were tricked into opening a specially crafted image, an attacker could exploit this to cause a denial of service or possibly execute code with the privileges of the user invoking the program."
      }
    ],
    "CVE-2016-10250": [
      {
        "url": "https://usn.ubuntu.com/3693-1/",
        "title": "USN-3693-1: JasPer vulnerabilities",
        "body": "Details It was discovered that JasPer incorrectly handled certain malformed JPEG-2000 image files. If a user or automated system using JasPer were tricked into opening a specially crafted image, an attacker could exploit this to cause a denial of service or possibly execute code with the privileges of the user invoking the program."
      }
    ],
    "CVE-2016-10254": [
      {
        "url": "https://usn.ubuntu.com/3670-1/",
        "title": "USN-3670-1: elfutils vulnerabilities",
        "body": "Details Agostino Sarubbo discovered that elfutils incorrectly handled certain malformed ELF files. If a user or automated system were tricked into processing a specially crafted ELF file, elfutils could be made to crash or consume resources, resulting in a denial of service."
      }
    ],
    "CVE-2016-10255": [
      {
        "url": "https://usn.ubuntu.com/3670-1/",
        "title": "USN-3670-1: elfutils vulnerabilities",
        "body": "Details Agostino Sarubbo discovered that elfutils incorrectly handled certain malformed ELF files. If a user or automated system were tricked into processing a specially crafted ELF file, elfutils could be made to crash or consume resources, resulting in a denial of service."
      }
    ],
    "CVE-2016-10269": [
      {
        "url": "https://usn.ubuntu.com/3602-1/",
        "title": "USN-3602-1: LibTIFF vulnerabilities",
        "body": "Details It was discovered that LibTIFF incorrectly handled certain malformed images. If a user or automated system were tricked into opening a specially crafted image, a remote attacker could crash the application, leading to a denial of service, or possibly execute arbitrary code with user privileges."
      }
    ],
    "CVE-2016-10371": [
      {
        "url": "https://usn.ubuntu.com/3602-1/",
        "title": "USN-3602-1: LibTIFF vulnerabilities",
        "body": "Details It was discovered that LibTIFF incorrectly handled certain malformed images. If a user or automated system were tricked into opening a specially crafted image, a remote attacker could crash the application, leading to a denial of service, or possibly execute arbitrary code with user privileges."
      }
    ],
    "CVE-2016-10727": [
      {
        "url": "https://usn.ubuntu.com/3724-1/",
        "title": "USN-3724-1: Evolution Data Server vulnerability",
        "body": "Details Jon Kristensen discovered that Evolution Data Server would automatically downgrade a connection to an IMAP server if the IMAP server did not support SSL. This would result in the user's password being unexpectedly sent in clear text, even though the user had requested to use SSL."
      }
    ],
    "CVE-2016-2335": [
      {
        "url": "https://usn.ubuntu.com/3913-1/",
        "title": "USN-3913-1: P7ZIP vulnerabilities",
        "body": "Details It was discovered that p7zip did not correctly handle certain malformed archives. If a user or automated system were tricked into processing a specially crafted archive with p7zip, then p7zip could be made to crash, possibly leading to abitrary code execution."
      }
    ],
    "CVE-2016-3186": [
      {
        "url": "https://usn.ubuntu.com/3606-1/",
        "title": "USN-3606-1: LibTIFF vulnerabilities",
        "body": "Details It was discovered that LibTIFF incorrectly handled certain malformed images. If a user or automated system were tricked into opening a specially crafted image, a remote attacker could crash the application, leading to a denial of service, or possibly execute arbitrary code with user privileges."
      }
    ],
    "CVE-2016-3616": [
      {
        "url": "https://usn.ubuntu.com/3706-1/",
        "title": "USN-3706-1: libjpeg-turbo vulnerabilities",
        "body": "Details It was discovered that libjpeg-turbo incorrectly handled certain malformed JPEG images. If a user or automated system were tricked into opening a specially crafted JPEG image, a remote attacker could cause libjpeg-turbo to crash, resulting in a denial of service, or possibly execute arbitrary code."
      },
      {
        "url": "https://usn.ubuntu.com/3706-1/",
        "title": "USN-3706-1: libjpeg-turbo vulnerabilities",
        "body": "Details It was discovered that libjpeg-turbo incorrectly handled certain malformed JPEG images. If a user or automated system were tricked into opening a specially crafted JPEG image, a remote attacker could cause libjpeg-turbo to crash, resulting in a denial of service, or possibly execute arbitrary code."
      },
      {
        "url": "https://usn.ubuntu.com/3706-2/",
        "title": "USN-3706-2: libjpeg-turbo vulnerabilities",
        "body": "Details USN-3706-1 fixed a vulnerability in libjpeg-turbo. This update provides the corresponding update for Ubuntu 12.04 ESM. Original advisory details: It was discovered that libjpeg-turbo incorrectly handled certain malformed JPEG images. If a user or automated system were tricked into opening a specially crafted JPEG image, a remote attacker could cause libjpeg-turbo to crash, resulting in a denial of service, or possibly execute arbitrary code."
      }
    ],
    "CVE-2016-5102": [
      {
        "url": "https://usn.ubuntu.com/3606-1/",
        "title": "USN-3606-1: LibTIFF vulnerabilities",
        "body": "Details It was discovered that LibTIFF incorrectly handled certain malformed images. If a user or automated system were tricked into opening a specially crafted image, a remote attacker could crash the application, leading to a denial of service, or possibly execute arbitrary code with user privileges."
      }
    ],
    "CVE-2016-5318": [
      {
        "url": "https://usn.ubuntu.com/3606-1/",
        "title": "USN-3606-1: LibTIFF vulnerabilities",
        "body": "Details It was discovered that LibTIFF incorrectly handled certain malformed images. If a user or automated system were tricked into opening a specially crafted image, a remote attacker could crash the application, leading to a denial of service, or possibly execute arbitrary code with user privileges."
      }
    ],
    "CVE-2016-5684": [
      {
        "url": "https://usn.ubuntu.com/3925-1/",
        "title": "USN-3925-1: FreeImage vulnerability",
        "body": "Details It was discovered that an out-of-bounds write vulnerability existed in the XMP image handling functionality of the FreeImage library. If a user or automated system were tricked into opening a specially crafted image, a remote attacker could overwrite arbitrary memory, resulting in code execution."
      }
    ],
    "CVE-2016-8883": [
      {
        "url": "https://usn.ubuntu.com/3693-1/",
        "title": "USN-3693-1: JasPer vulnerabilities",
        "body": "Details It was discovered that JasPer incorrectly handled certain malformed JPEG-2000 image files. If a user or automated system using JasPer were tricked into opening a specially crafted image, an attacker could exploit this to cause a denial of service or possibly execute code with the privileges of the user invoking the program."
      }
    ],
    "CVE-2016-8887": [
      {
        "url": "https://usn.ubuntu.com/3693-1/",
        "title": "USN-3693-1: JasPer vulnerabilities",
        "body": "Details It was discovered that JasPer incorrectly handled certain malformed JPEG-2000 image files. If a user or automated system using JasPer were tricked into opening a specially crafted image, an attacker could exploit this to cause a denial of service or possibly execute code with the privileges of the user invoking the program."
      }
    ],
    "CVE-2016-9262": [
      {
        "url": "https://usn.ubuntu.com/3693-1/",
        "title": "USN-3693-1: JasPer vulnerabilities",
        "body": "Details It was discovered that JasPer incorrectly handled certain malformed JPEG-2000 image files. If a user or automated system using JasPer were tricked into opening a specially crafted image, an attacker could exploit this to cause a denial of service or possibly execute code with the privileges of the user invoking the program."
      }
    ],
    "CVE-2016-9387": [
      {
        "url": "https://usn.ubuntu.com/3693-1/",
        "title": "USN-3693-1: JasPer vulnerabilities",
        "body": "Details It was discovered that JasPer incorrectly handled certain malformed JPEG-2000 image files. If a user or automated system using JasPer were tricked into opening a specially crafted image, an attacker could exploit this to cause a denial of service or possibly execute code with the privileges of the user invoking the program."
      }
    ],
    "CVE-2016-9390": [
      {
        "url": "https://usn.ubuntu.com/3693-1/",
        "title": "USN-3693-1: JasPer vulnerabilities",
        "body": "Details It was discovered that JasPer incorrectly handled certain malformed JPEG-2000 image files. If a user or automated system using JasPer were tricked into opening a specially crafted image, an attacker could exploit this to cause a denial of service or possibly execute code with the privileges of the user invoking the program."
      }
    ],
    "CVE-2016-9394": [
      {
        "url": "https://usn.ubuntu.com/3693-1/",
        "title": "USN-3693-1: JasPer vulnerabilities",
        "body": "Details It was discovered that JasPer incorrectly handled certain malformed JPEG-2000 image files. If a user or automated system using JasPer were tricked into opening a specially crafted image, an attacker could exploit this to cause a denial of service or possibly execute code with the privileges of the user invoking the program."
      }
    ],
    "CVE-2016-9600": [
      {
        "url": "https://usn.ubuntu.com/3693-1/",
        "title": "USN-3693-1: JasPer vulnerabilities",
        "body": "Details It was discovered that JasPer incorrectly handled certain malformed JPEG-2000 image files. If a user or automated system using JasPer were tricked into opening a specially crafted image, an attacker could exploit this to cause a denial of service or possibly execute code with the privileges of the user invoking the program."
      }
    ]
  }
}