{
  "year": 2014,
  "total": 15,
  "reference": "usn.ubuntu.com",
  "reports": {
    "CVE-2014-10070": [
      {
        "url": "https://usn.ubuntu.com/3593-1/",
        "title": "USN-3593-1: Zsh vulnerabilities",
        "body": "It was discovered that Zsh incorrectly handled certain enviroment variables. An attacker could possibly use this issue to gain privileged access to the system. This issue only affected Ubuntu 14.04 LTS. (CVE-2014-10070)"
      }
    ],
    "CVE-2014-10071": [
      {
        "url": "https://usn.ubuntu.com/3593-1/",
        "title": "USN-3593-1: Zsh vulnerabilities",
        "body": "It was discovered that Zsh incorrectly handled certain inputs. An attacker could possibly use this to execute arbitrary code. This issue only affected Ubuntu 14.04 LTS. (CVE-2014-10071)"
      }
    ],
    "CVE-2014-10072": [
      {
        "url": "https://usn.ubuntu.com/3593-1/",
        "title": "USN-3593-1: Zsh vulnerabilities",
        "body": "It was discovered that Zsh incorrectly handled some symbolic links. An attacker could possibly use this to execute arbitrary code. This issue only affected Ubuntu 14.04 LTS. (CVE-2014-10072)"
      }
    ],
    "CVE-2014-6051": [
      {
        "url": "https://usn.ubuntu.com/4587-1/",
        "title": "USN-4587-1: iTALC vulnerabilities",
        "body": "Nicolas Ruff discovered that iTALC had buffer overflows, divide-by-zero errors and didn't check malloc return values. A remote attacker could use these issues to cause a denial of service or possibly execute arbitrary code. (CVE-2014-6051, CVE-2014-6052, CVE-2014-6053, CVE-2014-6054, CVE-2014-6055)"
      }
    ],
    "CVE-2014-6052": [
      {
        "url": "https://usn.ubuntu.com/4587-1/",
        "title": "USN-4587-1: iTALC vulnerabilities",
        "body": "Nicolas Ruff discovered that iTALC had buffer overflows, divide-by-zero errors and didn't check malloc return values. A remote attacker could use these issues to cause a denial of service or possibly execute arbitrary code. (CVE-2014-6051, CVE-2014-6052, CVE-2014-6053, CVE-2014-6054, CVE-2014-6055)"
      }
    ],
    "CVE-2014-6054": [
      {
        "url": "https://usn.ubuntu.com/4587-1/",
        "title": "USN-4587-1: iTALC vulnerabilities",
        "body": "Nicolas Ruff discovered that iTALC had buffer overflows, divide-by-zero errors and didn't check malloc return values. A remote attacker could use these issues to cause a denial of service or possibly execute arbitrary code. (CVE-2014-6051, CVE-2014-6052, CVE-2014-6053, CVE-2014-6054, CVE-2014-6055)"
      }
    ],
    "CVE-2014-6055": [
      {
        "url": "https://usn.ubuntu.com/4587-1/",
        "title": "USN-4587-1: iTALC vulnerabilities",
        "body": "Nicolas Ruff discovered that iTALC had buffer overflows, divide-by-zero errors and didn't check malloc return values. A remote attacker could use these issues to cause a denial of service or possibly execute arbitrary code. (CVE-2014-6051, CVE-2014-6052, CVE-2014-6053, CVE-2014-6054, CVE-2014-6055)"
      }
    ],
    "CVE-2014-9323": [
      {
        "url": "https://usn.ubuntu.com/3929-1/",
        "title": "USN-3929-1: Firebird vulnerabilities",
        "body": "It was discovered that Firebird incorrectly handled certain malformed packets. A remote attacker could possibly use this issue with a specially crafted network packet to cause Firebird to crash, resulting in a denial of service. (CVE-2014-9323)"
      }
    ],
    "CVE-2014-9620": [
      {
        "url": "https://usn.ubuntu.com/3686-1/",
        "title": "USN-3686-1: file vulnerabilities",
        "body": "Alexander Cherepanov discovered that file incorrectly handled a large number of notes. An attacker could use this issue to cause a denial of service. This issue only affected Ubuntu 14.04 LTS. (CVE-2014-9620)"
      }
    ],
    "CVE-2014-9621": [
      {
        "url": "https://usn.ubuntu.com/3686-1/",
        "title": "USN-3686-1: file vulnerabilities",
        "body": "Alexander Cherepanov discovered that file incorrectly handled certain long strings. An attacker could use this issue to cause a denial of service. This issue only affected Ubuntu 14.04 LTS. (CVE-2014-9621)"
      }
    ],
    "CVE-2014-9645": [
      {
        "url": "https://usn.ubuntu.com/3935-1/",
        "title": "USN-3935-1: BusyBox vulnerabilities",
        "body": "Mathias Krause discovered that BusyBox incorrectly handled kernel module loading restrictions. A local attacker could possibly use this issue to bypass intended restrictions. This issue only affected Ubuntu 14.04 LTS. (CVE-2014-9645)"
      }
    ],
    "CVE-2014-9653": [
      {
        "url": "https://usn.ubuntu.com/3686-1/",
        "title": "USN-3686-1: file vulnerabilities",
        "body": "Alexander Cherepanov discovered that file incorrectly handled certain malformed ELF files. An attacker could use this issue to cause a denial of service, or possibly execute arbitrary code. This issue only affected Ubuntu 14.04 LTS. (CVE-2014-9653)"
      }
    ],
    "CVE-2014-9092": [
      {
        "url": "https://usn.ubuntu.com/3706-1/",
        "title": "USN-3706-1: libjpeg-turbo vulnerabilities",
        "body": "Details It was discovered that libjpeg-turbo incorrectly handled certain malformed JPEG images. If a user or automated system were tricked into opening a specially crafted JPEG image, a remote attacker could cause libjpeg-turbo to crash, resulting in a denial of service, or possibly execute arbitrary code."
      },
      {
        "url": "https://usn.ubuntu.com/3706-2/",
        "title": "USN-3706-2: libjpeg-turbo vulnerabilities",
        "body": "Details USN-3706-1 fixed a vulnerability in libjpeg-turbo. This update provides the corresponding update for Ubuntu 12.04 ESM. Original advisory details: It was discovered that libjpeg-turbo incorrectly handled certain malformed JPEG images. If a user or automated system were tricked into opening a specially crafted JPEG image, a remote attacker could cause libjpeg-turbo to crash, resulting in a denial of service, or possibly execute arbitrary code."
      }
    ],
    "CVE-2014-9862": [
      {
        "url": "https://usn.ubuntu.com/4500-1/",
        "title": "USN-4500-1: bsdiff vulnerabilities",
        "body": "Details It was discovered that bsdiff mishandled certain input. If a user were tricked into opening a malicious file, an attacker could cause bsdiff to crash or potentially execute arbitrary code."
      }
    ]
  }
}