{
  "year": 2008,
  "total": 559,
  "reference": "debian.org",
  "reports": {
    "CVE-2008-0007": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1503",
        "title": "",
        "body": "Nick Piggin of SuSE discovered a number of issues in subsystems which register a fault handler for memory mapped areas. This issue can be exploited by local users to achieve a Denial of Service (DoS) and possibly execute arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1504",
        "title": "",
        "body": "Nick Piggin of SuSE discovered a number of issues in subsystems which register a fault handler for memory mapped areas. This issue can be exploited by local users to achieve a Denial of Service (DoS) and possibly execute arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1565",
        "title": "",
        "body": "Nick Piggin of SuSE discovered a number of issues in subsystems which register a fault handler for memory mapped areas. This issue can be exploited by local users to achieve a Denial of Service (DoS) and possibly execute arbitrary code."
      }
    ],
    "CVE-2008-0008": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1476",
        "title": "",
        "body": "Marcus Meissner discovered that the PulseAudio sound server performedinsufficient checks when dropping privileges, which could lead to localprivilege escalation.The old stable distribution (sarge) doesn't contain pulseaudio.For the stable distribution (etch), this problem has been fixed inversion 0.9.5-5etch1.We recommend that you upgrade your pulseaudio packages."
      }
    ],
    "CVE-2008-0010": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1494",
        "title": "",
        "body": "The vmsplice system call did not properly verify address argumentspassed by user space processes, which allowed local attackers tooverwrite arbitrary kernel memory, gaining root privileges(CVE-2008-0010,CVE-2008-0600).In the vserver-enabled kernels, a missing access check on certainsymlinks in /proc enabled local attackers to access resources in othervservers (CVE-2008-0163).The old stable distribution (sarge) is not affected by this problem.For the stable distribution (etch), this problem has been fixed in version2.6.18.dfsg.1-18etch1.In addition to these fixes, this update also incorporates changes from theupcoming point release of the stable distribution.Some architecture builds were not yet available at the time of DSA-1494-1.This update to DSA-1494 provides linux-2.6 packages for these remainingarchitectures, as well as additional binary packages that are builtfrom source code provided by linux-2.6.The unstable (sid) and testing (lenny) distributions will be fixed soon.We recommend that you upgrade your linux-2.6, fai-kernels, anduser-mode-linux packages."
      }
    ],
    "CVE-2008-0016": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1669",
        "title": "",
        "body": "Justin Schuh, Tom Cross and Peter Williams discovered a buffer overflow in the parser for UTF-8 URLs, which may lead to the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Justin Schuh, Tom Cross and Peter Williams discovered a buffer overflow in the parser for UTF-8 URLs, which may lead to the execution of arbitrary code. (MFSA 2008-37)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "Justin Schuh, Tom Cross and Peter Williams discovered a buffer overflow in the parser for UTF-8 URLs, which may lead to the execution of arbitrary code. (MFSA 2008-37)"
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1649",
        "title": "",
        "body": "Justin Schuh, Tom Cross and Peter Williams discovered a buffer overflow in the parser for UTF-8 URLs, which may lead to the execution of arbitrary code."
      }
    ],
    "CVE-2008-0017": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1669",
        "title": "",
        "body": "Justin Schuh discovered that a buffer overflow in http-index-format parser could lead to arbitrary code execution."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1671",
        "title": "",
        "body": "Justin Schuh discovered that a buffer overflow in the http-index-format parser could lead to arbitrary code execution."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Justin Schuh discovered that a buffer overflow in http-index-format parser could lead to arbitrary code execution. (MFSA 2008-54)"
      }
    ],
    "CVE-2008-0047": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1530",
        "title": "",
        "body": "Heap-based buffer overflow in CUPS, when printer sharing is enabled,allows remote attackers to execute arbitrary code via crafted searchexpressions."
      }
    ],
    "CVE-2008-0053": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1625",
        "title": "",
        "body": "Buffer overflows in the HP-GL input filter allowed to possibly run arbitrary code through crafted HP-GL files."
      }
    ],
    "CVE-2008-0062": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1524",
        "title": "",
        "body": "An unauthenticated remote attacker may cause a krb4-enabled KDC tocrash, expose information, or execute arbitrary code. Successfulexploitation of this vulnerability could compromise the Kerberos keydatabase and host security on the KDC host."
      }
    ],
    "CVE-2008-0063": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1524",
        "title": "",
        "body": "An unauthenticated remote attacker may cause a krb4-enabled KDC toexpose information. It is theoretically possible for the exposedinformation to include secret key data on some platforms."
      }
    ],
    "CVE-2008-0073": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1536",
        "title": "",
        "body": "Array index error in the sdpplin_parse function allows remote RTSP servers to execute arbitrary code via a large streamid SDP parameter."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1543",
        "title": "",
        "body": "Insufficient integer bounds checking in SDP handling allows the execution of arbitrary code through a maliciously crafted SDP stream ID parameter in an RTSP stream."
      }
    ],
    "CVE-2008-0124": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1528",
        "title": "",
        "body": "Peter Hüwe and Hanno Böck discovered that Serendipity, a weblog manager,did not properly sanitise input to several scripts which allowedcross site scripting.The old stable distribution (sarge) does not contain a serendipity package.For the stable distribution (etch), this problem has been fixed in version1.0.4-1+etch1.For the unstable distribution (sid), this problem has been fixed inversion 1.3-1.We recommend that you upgrade your serendipity package."
      }
    ],
    "CVE-2008-0162": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1500",
        "title": "",
        "body": "Mike Ashton discovered that splitvt, a utility to run two programs in asplit screen, did not drop group privileges prior to executing xprop.This could allow any local user to gain the privileges of group utmp.For the stable distribution (etch), this problem has been fixed in version1.6.5-9etch1.For the unstable distribution (sid), this problem has been fixed inversion 1.6.6-4.We recommend that you upgrade your splitvt package."
      }
    ],
    "CVE-2008-0165": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1553",
        "title": "",
        "body": "It has been discovered that ikiwiki, a Wiki implementation, does notguard password and content changes against cross-site request forgery(CSRF) attacks.For the stable distribution (etch), this problem has been fixed inversion 1.33.5.For the unstable distribution (sid), this problem has been fixed inversion 2.42.We recommend that you upgrade your ikiwiki package."
      }
    ],
    "CVE-2008-0166": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1571",
        "title": "",
        "body": "Luciano Bello discovered that the random number generator in Debian'sopenssl package is predictable. This is caused by an incorrectDebian-specific change to the openssl package (CVE-2008-0166). As aresult, cryptographic key material may be guessable.This is a Debian-specific vulnerability which does not affect otheroperating systems which are not based on Debian. However, other systemscan be indirectly affected if weak keys are imported into them.It is strongly recommended that all cryptographic key material which hasbeen generated by OpenSSL versions starting with 0.9.8c-1 on Debiansystems is recreated from scratch. Furthermore, all DSA keys ever usedon affected Debian systems for signing or authentication purposes shouldbe considered compromised; the Digital Signature Algorithm relies on asecret random value used during signature generation.The first vulnerable version, 0.9.8c-1, was uploaded to the unstabledistribution on 2006-09-17, and has since that date propagated to the testing andcurrent stable (etch) distributions. The old stable distribution(sarge) is not affected.Affected keys include SSH keys, OpenVPN keys, DNSSEC keys, and keymaterial for use in X.509 certificates and session keys used in SSL/TLSconnections. Keys generated with GnuPG or GNUTLS are not affected,though.A detector for known weak key material will be published at: http://security.debian.org/project/extra/dowkd/dowkd.pl.gz (OpenPGP signature)Instructions how to implement key rollover for various packages will bepublished at: https://www.debian.org/security/key-rollover/This web site will be continuously updated to reflect new and updatedinstructions on key rollovers for packages using SSL certificates.Popular packages not affected will also be listed.In addition to this critical change, two other vulnerabilities have beenfixed in the openssl package which were originally scheduled for releasewith the next etch point release: OpenSSL's DTLS (Datagram TLS,basically SSL over UDP) implementation did not actually implement theDTLS specification, but a potentially much weaker protocol, andcontained a vulnerability permitting arbitrary code execution(CVE-2007-4995). A side channel attack in the integer multiplicationroutines is also addressed (CVE-2007-3108).For the stable distribution (etch), these problems have been fixed inversion 0.9.8c-4etch3.For the unstable distribution (sid) and the testing distribution(lenny), these problems have been fixed in version 0.9.8g-9.We recommend that you upgrade your openssl package and subsequentlyregenerate any cryptographic material, as outlined above."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1576",
        "title": "",
        "body": "The recently announced vulnerability in Debian's openssl package(DSA-1571-1, CVE-2008-0166) indirectly affects OpenSSH. As a result,all user and host keys generated using broken versions of the opensslpackage must be considered untrustworthy, even after the openssl updatehas been applied.1. Install the security updates This update contains a dependency on the openssl update and will automatically install a corrected version of the libssl0.9.8 package, and a new package openssh-blacklist. Once the update is applied, weak user keys will be automatically rejected where possible (though they cannot be detected in all cases). If you are using such keys for user authentication, they will immediately stop working and will need to be replaced (see step 3). OpenSSH host keys can be automatically regenerated when the OpenSSH security update is applied. The update will prompt for confirmation before taking this step.2. Update OpenSSH known_hosts files The regeneration of host keys will cause a warning to be displayed when connecting to the system using SSH until the host key is updated in the known_hosts file. The warning will look like this:@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ WARNING: REMOTE HOST IDENTIFICATION HAS CHANGED! @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@IT IS POSSIBLE THAT SOMEONE IS DOING SOMETHING NASTY!Someone could be eavesdropping on you right now (man-in-the-middle attack)!It is also possible that the RSA host key has just been changed. In this case, the host key has simply been changed, and you should update the relevant known_hosts file as indicated in the error message. It is recommended that you use a trustworthy channel to exchange the server key. It is found in the file /etc/ssh/ssh_host_rsa_key.pub on the server; it's fingerprint can be printed using the command: ssh-keygen -l -f /etc/ssh/ssh_host_rsa_key.pub In addition to user-specific known_hosts files, there may be a system-wide known hosts file /etc/ssh/ssh_known_hosts. This is file is used both by the ssh client and by sshd for the hosts.equiv functionality. This file needs to be updated as well.3. Check all OpenSSH user keys The safest course of action is to regenerate all OpenSSH user keys, except where it can be established to a high degree of certainty that the key was generated on an unaffected system. Check whether your key is affected by running the ssh-vulnkey tool, included in the security update. By default, ssh-vulnkey will check the standard location for user keys (~/.ssh/id_rsa, ~/.ssh/id_dsa and ~/.ssh/identity), your authorized_keys file (~/.ssh/authorized_keys and ~/.ssh/authorized_keys2), and the system's host keys (/etc/ssh/ssh_host_dsa_key and /etc/ssh/ssh_host_rsa_key). To check all your own keys, assuming they are in the standard locations (~/.ssh/id_rsa, ~/.ssh/id_dsa, or ~/.ssh/identity): ssh-vulnkey To check all keys on your system: sudo ssh-vulnkey -a To check a key in a non-standard location: ssh-vulnkey /path/to/key If ssh-vulnkey says \"Unknown (no blacklist information)\", then it has no information about whether that key is affected. In this case, you can examine the modification time (mtime) of the file using \"ls -l\". Keys generated before September 2006 are not affected. Keep in mind that, although unlikely, backup procedures may have changed the file date back in time (or the system clock may have been incorrectly set). If in doubt, generate a new key and remove the old one from any servers.4. Regenerate any affected user keys OpenSSH keys used for user authentication must be manually regenerated, including those which may have since been transferred to a different system after being generated. New keys can be generated using ssh-keygen, e.g.: $ ssh-keygen Generating public/private rsa key pair. Enter file in which to save the key (/home/user/.ssh/id_rsa): Enter passphrase (empty for no passphrase): Enter same passphrase again: Your identification has been saved in /home/user/.ssh/id_rsa. Your public key has been saved in /home/user/.ssh/id_rsa.pub. The key fingerprint is: 00:00:00:00:00:00:00:00:00:00:00:00:00:00:00:00 user@host5. Update authorized_keys files (if necessary) Once the user keys have been regenerated, the relevant public keys must be propagated to any authorized_keys files (and authorized_keys2 files, if applicable) on remote systems. Be sure to delete the lines containing old keys from those files.In addition to countermeasures to mitigate the randomness vulnerability,this OpenSSH update fixes several other vulnerabilities:CVE-2008-1483: Timo Juhani Lindfors discovered that, when using X11 forwarding, the SSH client selects an X11 forwarding port without ensuring that it can be bound on all address families. If the system is configured with IPv6 (even if it does not have working IPv6 connectivity), this could allow a local attacker on the remote server to hijack X11 forwarding.CVE-2007-4752: Jan Pechanec discovered that ssh falls back to creating a trusted X11 cookie if creating an untrusted cookie fails, potentially exposing the local display to a malicious remote server when using X11 forwarding.For the stable distribution (etch), these problems have been fixed inversion 4.3p2-9etch1. Currently, only a subset of all supportedarchitectures have been built; further updates will be provided whenthey become available.For the unstable distribution (sid) and the testing distribution(lenny), these problems have been fixed in version 4.7p1-9.We recommend that you upgrade your openssh packages and take themeasures indicated above."
      }
    ],
    "CVE-2008-0173": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1459",
        "title": "",
        "body": "It was discovered that Gforge, a collaborative development tool, did notproperly sanitise some CGI parameters, allowing SQL injection in scriptsrelated to RSS exports.For the old stable distribution (sarge), this problem has been fixed inversion 3.1-31sarge5.For the stable distribution (etch), this problem has been fixed inversion 4.5.14-22etch4.For the unstable distribution (sid), this problem has been fixed inversion 4.6.99+svn6330-1.We recommend that you upgrade your gforge packages."
      }
    ],
    "CVE-2008-0193": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1502",
        "title": "",
        "body": "Cross-site scripting (XSS) vulnerability in wp-db-backup.php in WordPress 2.0.11 and earlier allows remote attackers to inject arbitrary web script or HTML via the backup parameter in a wp-db-backup.php action to wp-admin/edit.php."
      }
    ],
    "CVE-2008-0194": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1502",
        "title": "",
        "body": "Directory traversal vulnerability in wp-db-backup.php in WordPress 2.0.3 and earlier allows remote attackers to read arbitrary files, delete arbitrary files, and cause a denial of service via a .. (dot dot) in the backup parameter in a wp-db-backup.php action to wp-admin/edit.php."
      }
    ],
    "CVE-2008-0225": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1472",
        "title": "",
        "body": "Luigi Auriemma discovered that the Xine media player library performedinsufficient input sanitising during the handling of RTSP streams,which could lead to the execution of arbitrary code.For the old stable distribution (sarge), this problem has been fixedin version 1.0.1-1sarge6.For the stable distribution (etch), this problem has been fixed inversion 1.1.2+dfsg-5.For the testing distribution (lenny), this problem has been fixed inversion 1.1.8-3+lenny1.For the unstable distribution (sid), this problem will be fixed soon.We recommend that you upgrade your xine-lib packages."
      }
    ],
    "CVE-2008-0226": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1478",
        "title": "",
        "body": "Luigi Auriemma discovered two buffer overflows in YaSSL, an SSLimplementation included in the MySQL database package, which could leadto denial of service and possibly the execution of arbitrary code.The old stable distribution (sarge) doesn't contain mysql-dfsg-5.0.For the stable distribution (etch), these problems have been fixed inversion 5.0.32-7etch5.For the unstable distribution (sid), these problems have been fixed inversion 5.0.51-3.We recommend that you upgrade your mysql-dfsg-5.0 package."
      }
    ],
    "CVE-2008-0227": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1478",
        "title": "",
        "body": "Luigi Auriemma discovered two buffer overflows in YaSSL, an SSLimplementation included in the MySQL database package, which could leadto denial of service and possibly the execution of arbitrary code.The old stable distribution (sarge) doesn't contain mysql-dfsg-5.0.For the stable distribution (etch), these problems have been fixed inversion 5.0.32-7etch5.For the unstable distribution (sid), these problems have been fixed inversion 5.0.51-3.We recommend that you upgrade your mysql-dfsg-5.0 package."
      }
    ],
    "CVE-2008-0252": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1481",
        "title": "",
        "body": "It was discovered that a directory traversal vulnerability in CherryPy,a pythonic, object-oriented web development framework, may lead to denialof service by deleting files through malicious session IDs in cookies.The old stable distribution (sarge) doesn't contain python-cherrypy.For the stable distribution (etch), this problem has been fixed inversion 2.2.1-3etch1.We recommend that you upgrade your python-cherrypy packages."
      }
    ],
    "CVE-2008-0295": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1543",
        "title": "",
        "body": "Heap buffer overflows in RTSP stream and session description protocol (SDP) handling allow an attacker to execute arbitrary code if a maliciously crafted RTSP stream is played."
      }
    ],
    "CVE-2008-0296": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1543",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2008-0302": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1465",
        "title": "",
        "body": "Felipe Sateler discovered that apt-listchanges, a package change historynotification tool, used unsafe paths when importing its python libraries.This could allow the execution of arbitrary shell commands if the root userexecuted the command in a directory which other local users may writeto.For the old stable distribution (sarge), this problem was not present.For the stable distribution (etch), this problem has been fixed in version2.72.5etch1.For the unstable distribution (sid), this problem has been fixed in version2.82.We recommend that you upgrade your apt-listchanges package."
      }
    ],
    "CVE-2008-0304": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1621",
        "title": "",
        "body": "It was discovered that a buffer overflow in MIME decoding can lead to the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "It was discovered that a buffer overflow in MIME decoding can lead to the execution of arbitrary code. (MFSA 2008-26)"
      }
    ],
    "CVE-2008-0314": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1549",
        "title": "",
        "body": "Damian Put discovered that a buffer overflow in the handler for PeSpin binaries may lead to the execution of arbitrary code."
      }
    ],
    "CVE-2008-0318": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1497",
        "title": "",
        "body": "Silvio Cesare discovered an integer overflow in the parser for PE headers."
      }
    ],
    "CVE-2008-0320": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1547",
        "title": "",
        "body": "A bug has been discovered in the processing of OLE files that can cause a buffer overflow in the heap potentially leading to the execution of arbitrary code."
      }
    ],
    "CVE-2008-0387": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1529",
        "title": "",
        "body": "Multiple security problems have been discovered in the Firebird database,which may lead to the execution of arbitrary code or denial of service.This Debian security advisory is a bit unusual. While it's normallyour strict policy to backport security bugfixes to older releases, thisturned out to be infeasible for Firebird 1.5 due to large infrastructuralchanges necessary to fix these issues. As a consequence security supportfor Firebird 1.5 is hereby discontinued, leaving two options toadministrators running a Firebird database: Administrators running Firebird in a completely internal setup with trusted users could leave it unchanged. Everyone else should upgrade to the firebird2.0 packages available at backports.org. Version 2.0.3.12981.ds1-6~bpo40+1 fixes all known issues. Please refer to the general backports.org documentation to add the packages to your package management configuration. These packages are backported to run with Debian stable. Since firebird2.0 is not a drop-in replacement for firebird2 (which is the source package name for the Firebird 1.5 packages) these updates are not released through security.debian.org. Corrections for potential future security problems affecting Debian stable will be released through backports.org as well. Arrangements have been made to ensure that Firebird in the upcoming Debian 5.0 release will be supportable with regular backported security bugfixes again.For a more detailed description of the security problems, please referto the entries in the Debian Bug Tracking System referenced above andthe following URLs:http://www.firebirdsql.org/rlsnotes/Firebird-2.0-ReleaseNotes.pdfhttp://www.firebirdsql.org/rlsnotes/Firebird-2.0.1-ReleaseNotes.pdfhttp://www.firebirdsql.org/rlsnotes/Firebird-2.0.2-ReleaseNotes.pdf"
      }
    ],
    "CVE-2008-0411": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1510",
        "title": "",
        "body": "Chris Evans discovered a buffer overflow in the color space handlingcode of the Ghostscript PostScript/PDF interpreter, which might resultin the execution of arbitrary code if a user is tricked into processinga malformed file.For the stable distribution (etch), this problem has been fixed in version8.54.dfsg.1-5etch1 of gs-gpl and 8.15.3.dfsg.1-1etch1 of gs-esp.For the old stable distribution (sarge), this problem has been fixed inversion 8.01-6 of gs-gpl and 7.07.1-9sarge1 of gs-esp.The unstable distribution (sid) will be fixed soon.We recommend that you upgrade your gs-esp and gs-gpl packages."
      }
    ],
    "CVE-2008-0412": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1484",
        "title": "",
        "body": "Jesse Ruderman, Kai Engert, Martijn Wargers, Mats Palmgren and Paul Nickerson discovered crashes in the layout engine, which might allow the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1485",
        "title": "",
        "body": "Jesse Ruderman, Kai Engert, Martijn Wargers, Mats Palmgren and Paul Nickerson discovered crashes in the layout engine, which might allow the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1489",
        "title": "",
        "body": "Jesse Ruderman, Kai Engert, Martijn Wargers, Mats Palmgren and Paul Nickerson discovered crashes in the layout engine, which might allow the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1506",
        "title": "",
        "body": "Jesse Ruderman, Kai Engert, Martijn Wargers, Mats Palmgren and Paul Nickerson discovered crashes in the layout engine, which might allow the execution of arbitrary code."
      }
    ],
    "CVE-2008-0413": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1484",
        "title": "",
        "body": "Carsten Book, Wesley Garland, Igor Bukanov, moz_bug_r_a4, shutdown, Philip Taylor and tgirmann discovered crashes in the JavaScript engine, which might allow the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1485",
        "title": "",
        "body": "Carsten Book, Wesley Garland, Igor Bukanov, moz_bug_r_a4, shutdown, Philip Taylor and tgirmann discovered crashes in the JavaScript engine, which might allow the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1489",
        "title": "",
        "body": "Carsten Book, Wesley Garland, Igor Bukanov, moz_bug_r_a4, shutdown, Philip Taylor and tgirmann discovered crashes in the JavaScript engine, which might allow the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1506",
        "title": "",
        "body": "Carsten Book, Wesley Garland, Igor Bukanov, moz_bug_r_a4, shutdown, Philip Taylor and tgirmann discovered crashes in the Javascript engine, which might allow the execution of arbitrary code."
      }
    ],
    "CVE-2008-0414": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1484",
        "title": "",
        "body": "hong and Gregory Fleischer discovered that file input focus vulnerabilities in the file upload control could allow information disclosure of local files."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1485",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1489",
        "title": "",
        "body": "hong and Gregory Fleischer discovered that file input focus vulnerabilities in the file upload control could allow information disclosure of local files."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1506",
        "title": "",
        "body": "hong and Gregory Fleischer discovered that file input focus vulnerabilities in the file upload control could allow information disclosure of local files."
      }
    ],
    "CVE-2008-0415": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1484",
        "title": "",
        "body": "moz_bug_r_a4 and Boris Zbarsky discovered several vulnerabilities in JavaScript handling, which could allow privilege escalation."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1485",
        "title": "",
        "body": "moz_bug_r_a4 and Boris Zbarsky discovered several vulnerabilities in JavaScript handling, which could allow privilege escalation."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1489",
        "title": "",
        "body": "moz_bug_r_a4 and Boris Zbarsky discovered several vulnerabilities in JavaScript handling, which could allow privilege escalation."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1506",
        "title": "",
        "body": "moz_bug_r_a4 and Boris Zbarsky discovered several vulnerabilities in Javascript handling, which could allow privilege escalation."
      }
    ],
    "CVE-2008-0416": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1484",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1485",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1489",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2008-0417": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1484",
        "title": "",
        "body": "Justin Dolske discovered that the password storage mechanism could be abused by malicious web sites to corrupt existing saved passwords."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1485",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1489",
        "title": "",
        "body": "Justin Dolske discovered that the password storage mechanism could be abused by malicious web sites to corrupt existing saved passwords."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1506",
        "title": "",
        "body": "Justin Dolske discovered that the password storage mechanism could be abused by malicious web sites to corrupt existing saved passwords."
      }
    ],
    "CVE-2008-0418": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1484",
        "title": "",
        "body": "Gerry Eisenhaur and moz_bug_r_a4 discovered that a directory traversal vulnerability in chrome: URI handling could lead to information disclosure."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1485",
        "title": "",
        "body": "Gerry Eisenhaur and moz_bug_r_a4 discovered that a directory traversal vulnerability in chrome: URI handling could lead to information disclosure."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1489",
        "title": "",
        "body": "Gerry Eisenhaur and moz_bug_r_a4 discovered that a directory traversal vulnerability in chrome: URI handling could lead to information disclosure."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1506",
        "title": "",
        "body": "Gerry Eisenhaur and moz_bug_r_a4 discovered that a directory traversal vulnerability in chrome: URI handling could lead to information disclosure."
      }
    ],
    "CVE-2008-0419": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1484",
        "title": "",
        "body": "David Bloom discovered a race condition in the image handling of designMode elements, which could lead to information disclosure or potentially the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1485",
        "title": "",
        "body": "David Bloom discovered a race condition in the image handling of designMode elements, which can lead to information disclosure and potentially the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1489",
        "title": "",
        "body": "David Bloom discovered a race condition in the image handling of designMode elements, which can lead to information disclosure and potentially the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1506",
        "title": "",
        "body": "David Bloom discovered a race condition in the image handling of designMode elements, which can lead to information disclosure and potentially the execution of arbitrary code."
      }
    ],
    "CVE-2008-0467": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1529",
        "title": "",
        "body": "Multiple security problems have been discovered in the Firebird database,which may lead to the execution of arbitrary code or denial of service.This Debian security advisory is a bit unusual. While it's normallyour strict policy to backport security bugfixes to older releases, thisturned out to be infeasible for Firebird 1.5 due to large infrastructuralchanges necessary to fix these issues. As a consequence security supportfor Firebird 1.5 is hereby discontinued, leaving two options toadministrators running a Firebird database: Administrators running Firebird in a completely internal setup with trusted users could leave it unchanged. Everyone else should upgrade to the firebird2.0 packages available at backports.org. Version 2.0.3.12981.ds1-6~bpo40+1 fixes all known issues. Please refer to the general backports.org documentation to add the packages to your package management configuration. These packages are backported to run with Debian stable. Since firebird2.0 is not a drop-in replacement for firebird2 (which is the source package name for the Firebird 1.5 packages) these updates are not released through security.debian.org. Corrections for potential future security problems affecting Debian stable will be released through backports.org as well. Arrangements have been made to ensure that Firebird in the upcoming Debian 5.0 release will be supportable with regular backported security bugfixes again.For a more detailed description of the security problems, please referto the entries in the Debian Bug Tracking System referenced above andthe following URLs:http://www.firebirdsql.org/rlsnotes/Firebird-2.0-ReleaseNotes.pdfhttp://www.firebirdsql.org/rlsnotes/Firebird-2.0.1-ReleaseNotes.pdfhttp://www.firebirdsql.org/rlsnotes/Firebird-2.0.2-ReleaseNotes.pdf"
      }
    ],
    "CVE-2008-0471": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1488",
        "title": "",
        "body": "Private messaging allowed cross site request forgery, makingit possible to delete all private messages of a user by sendingthem to a crafted web page."
      }
    ],
    "CVE-2008-0485": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1496",
        "title": "",
        "body": "Felipe Manzano and Anibal Sacco discovered a buffer overflow in the demuxer for MOV files."
      }
    ],
    "CVE-2008-0486": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1496",
        "title": "",
        "body": "Reimar Doeffinger discovered a buffer overflow in the FLAC header parsing."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1536",
        "title": "",
        "body": "Array index vulnerability in libmpdemux/demux_audio.c might allow remote attackers to execute arbitrary code via a crafted FLAC tag, which triggers a buffer overflow (applies to etch only)."
      }
    ],
    "CVE-2008-0544": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1493",
        "title": "",
        "body": "It was discovered that a buffer overflow in IFF ILBM image parsing could result in denial of service and potentially the execution of arbitrary code."
      }
    ],
    "CVE-2008-0553": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1490",
        "title": "",
        "body": "It was discovered that a buffer overflow in the GIF image parsing codeof Tk, a cross-platform graphical toolkit, could lead to a denial ofservice and potentially the execution of arbitrary code.For the old stable distribution (sarge), this problem has been fixed inversion 8.3.5-4sarge1.For the stable distribution (etch), this problem has been fixed inversion 8.3.5-6etch2.We recommend that you upgrade your tk8.3 packages."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1491",
        "title": "",
        "body": "It was discovered that a buffer overflow in the GIF image parsing codeof Tk, a cross-platform graphical toolkit, could lead to a denial ofservice and potentially the execution of arbitrary code.For the old stable distribution (sarge), this problem has been fixed inversion 8.4.9-1sarge2.For the stable distribution (etch), this problem has been fixed inversion 8.4.12-1etch2.We recommend that you upgrade your tk8.4 packages."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1598",
        "title": "",
        "body": "It was discovered that a buffer overflow in the GIF image parsing codeof Tk, a cross-platform graphical toolkit, could lead to denial ofservice and potentially the execution of arbitrary code.For the stable distribution (etch), this problem has been fixed in version1:1.3-15etch2.For the unstable distribution (sid), this problem has been fixed inversion 1:1.3-release-7.We recommend that you upgrade your libtk-img package."
      }
    ],
    "CVE-2008-0554": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1579",
        "title": "",
        "body": "A vulnerability was discovered in the GIF reader implementation innetpbm-free, a suite of image manipulation utilities. Insufficientinput data validation could allow a maliciously-crafted GIF fileto overrun a stack buffer, potentially permitting the execution ofarbitrary code.For the stable distribution (etch), these problems have been fixed inversion 2:10.0-11.1+etch1.For the unstable distribution (sid), these problems were fixed inversion 2:10.0-11.1.We recommend that you upgrade your netpbm packages."
      }
    ],
    "CVE-2008-0593": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1484",
        "title": "",
        "body": "Martin Straka discovered that insecure stylesheet handling during redirects could lead to information disclosure."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1485",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1489",
        "title": "",
        "body": "Martin Straka discovered that insecure stylesheet handling during redirects could lead to information disclosure."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1506",
        "title": "",
        "body": "Martin Straka discovered that insecure stylesheet handling during redirects could lead to information disclosure."
      }
    ],
    "CVE-2008-0595": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1599",
        "title": "",
        "body": "Havoc Pennington discovered that DBus, a simple interprocess messagingsystem, performs insufficient validation of security policies, whichmight allow local privilege escalation.For the stable distribution (etch), this problem has been fixed inversion 1.0.2-1+etch1.For the unstable distribution (sid), this problem has been fixed inversion 1.1.20-1.We recommend that you upgrade your dbus packages."
      }
    ],
    "CVE-2008-0598": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1630",
        "title": "",
        "body": "Tavis Ormandy discovered a vulnerability that allows local users to access uninitialized kernel memory, possibly leaking sensitive data. This issue is specific to the amd64-flavour kernel images."
      }
    ],
    "CVE-2008-0600": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1494",
        "title": "",
        "body": "The vmsplice system call did not properly verify address argumentspassed by user space processes, which allowed local attackers tooverwrite arbitrary kernel memory, gaining root privileges(CVE-2008-0010,CVE-2008-0600).In the vserver-enabled kernels, a missing access check on certainsymlinks in /proc enabled local attackers to access resources in othervservers (CVE-2008-0163).The old stable distribution (sarge) is not affected by this problem.For the stable distribution (etch), this problem has been fixed in version2.6.18.dfsg.1-18etch1.In addition to these fixes, this update also incorporates changes from theupcoming point release of the stable distribution.Some architecture builds were not yet available at the time of DSA-1494-1.This update to DSA-1494 provides linux-2.6 packages for these remainingarchitectures, as well as additional binary packages that are builtfrom source code provided by linux-2.6.The unstable (sid) and testing (lenny) distributions will be fixed soon.We recommend that you upgrade your linux-2.6, fai-kernels, anduser-mode-linux packages."
      }
    ],
    "CVE-2008-0629": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1496",
        "title": "",
        "body": "Adam Bozanich discovered a buffer overflow in the CDDB access code."
      }
    ],
    "CVE-2008-0630": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1496",
        "title": "",
        "body": "Adam Bozanich discovered a buffer overflow in URL parsing."
      }
    ],
    "CVE-2008-0658": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1541",
        "title": "",
        "body": "It was discovered that a programming error in the interface to the BDB storage backend could lead to denial of service through crafted modrdn requests."
      }
    ],
    "CVE-2008-0664": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1601",
        "title": "",
        "body": "The XML-RPC implementation, when registration is enabled, allows remote attackers to edit posts of other blog users."
      }
    ],
    "CVE-2008-0668": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1546",
        "title": "",
        "body": "Thilo Pfennig and Morten Welinder discovered several integer overflowweaknesses in Gnumeric, a GNOME spreadsheet application. Thesevulnerabilities could result in the execution of arbitrary codethrough the opening of a maliciously crafted Excel spreadsheet.For the stable distribution (etch), these problems have been fixed inversion 1.6.3-5+etch1.For the unstable distribution (sid), these problems have been fixed inversion 1.8.1-1.We recommend that you upgrade your gnumeric packages."
      }
    ],
    "CVE-2008-0674": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1499",
        "title": "",
        "body": "It was discovered that specially crafted regular expressions involvingcodepoints greater than 255 could cause a buffer overflow in the PCRElibrary (CVE-2008-0674).For the old stable distribution (sarge), this problem has been fixed inversion 4.5+7.4-2.For the stable distribution (etch), this problem has been fixed inversion 6.7+7.4-3.For the unstable distribution (sid), this problem has been fixed in version7.6-1.We recommend that you upgrade your pcre3 package."
      }
    ],
    "CVE-2008-0780": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1514",
        "title": "",
        "body": "A cross-site-scripting vulnerability has been discovered in the login code."
      }
    ],
    "CVE-2008-0781": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1514",
        "title": "",
        "body": "A cross-site-scripting vulnerability has been discovered in attachment handling."
      }
    ],
    "CVE-2008-0782": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1514",
        "title": "",
        "body": "A directory traversal vulnerability in cookie handling could lead to local denial of service by overwriting files."
      }
    ],
    "CVE-2008-0783": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1569",
        "title": "",
        "body": "It was discovered that Cacti, a systems and services monitoring frontend,performed insufficient input sanitising, leading to cross site scriptingand SQL injection being possible.For the stable distribution (etch), this problem has been fixed inversion 0.8.6i-3.4.For the unstable distribution (sid), this problem has been fixed inversion 0.8.7b-1.We recommend that you upgrade your cacti package."
      }
    ],
    "CVE-2008-0785": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1569",
        "title": "",
        "body": "It was discovered that Cacti, a systems and services monitoring frontend,performed insufficient input sanitising, leading to cross site scriptingand SQL injection being possible.For the stable distribution (etch), this problem has been fixed inversion 0.8.6i-3.4.For the unstable distribution (sid), this problem has been fixed inversion 0.8.7b-1.We recommend that you upgrade your cacti package."
      }
    ],
    "CVE-2008-0807": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1507",
        "title": "",
        "body": "Peter Paul Elfferich discovered that turba2, a contact management componentfor horde framework, did not correctly check access rights before allowingusers to edit addresses. This could result in valid users being able toalter private address records.For the old stable distribution (sarge), this problem has been fixed inversion 2.0.2-1sarge1.For the stable distribution (etch), this problem has been fixed in version2.1.3-1etch1.For the unstable distribution (sid), this problem has been fixed in version2.1.7-1.We recommend that you upgrade your turba2 package."
      }
    ],
    "CVE-2008-0808": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1523",
        "title": "",
        "body": "Josh Triplett discovered that ikiwiki did not block Javascript inURLs, leading to cross-site scripting vulnerabilities (CVE-2008-0808,CVE-2008-0809).The old stable distribution (sarge) did not contain an ikiwiki package.For the stable distribution (etch), this problem has been fixed inversion 1.33.4.For the unstable distribution (sid), this problem has been fixed inversion 2.31.1.We recommend that you upgrade your ikiwiki package."
      }
    ],
    "CVE-2008-0809": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1523",
        "title": "",
        "body": "Josh Triplett discovered that ikiwiki did not block Javascript inURLs, leading to cross-site scripting vulnerabilities (CVE-2008-0808,CVE-2008-0809).The old stable distribution (sarge) did not contain an ikiwiki package.For the stable distribution (etch), this problem has been fixed inversion 1.33.4.For the unstable distribution (sid), this problem has been fixed inversion 2.31.1.We recommend that you upgrade your ikiwiki package."
      }
    ],
    "CVE-2008-0882": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1530",
        "title": "",
        "body": "Double free vulnerability in the process_browse_data function in CUPS1.3.5 allows remote attackers to cause a denial of service (daemoncrash) and possibly the execution of arbitrary code via crafted packets to thecupsd port (631/udp), related to an unspecified manipulation of aremote printer."
      }
    ],
    "CVE-2008-0888": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1522",
        "title": "",
        "body": "Tavis Ormandy discovered that unzip, when processing specially craftedZIP archives, could pass invalid pointers to the C library's freeroutine, potentially leading to arbitrary code execution(CVE-2008-0888).For the old stable distribution (sarge), this problem has been fixedin version 5.52-1sarge5.For the stable distribution (etch), this problem has been fixed inversion 5.52-9etch1.The unstable distribution (sid) will be fixed soon.We recommend that you upgrade your unzip package."
      }
    ],
    "CVE-2008-0928": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1799",
        "title": "",
        "body": "Ian Jackson discovered that range checks of file operations on emulated disk devices were insufficiently enforced."
      }
    ],
    "CVE-2008-0931": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1526",
        "title": "",
        "body": "The xwine command changes the permissions of the global WINE configuration file such that it is world-writable. This could allow local users to edit it such that arbitrary commands could be executed whenever any local user executed a program under WINE."
      }
    ],
    "CVE-2008-0932": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1508",
        "title": "",
        "body": "Dan Dennison discovered that Diatheke, a CGI program to make a biblewebsite, performs insufficient sanitising of a parameter, allowing aremote attacker to execute arbitrary shell commands as the web serveruser.For the old stable distribution (sarge), this problem has been fixed inversion 1.5.7-7sarge1.For the stable distribution (etch), this problem has been fixed in version1.5.9-2etch1.For the unstable distribution (sid), this problem has been fixed in version1.5.9-8.We recommend that you upgrade your diatheke package."
      }
    ],
    "CVE-2008-0947": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1524",
        "title": "",
        "body": "An unauthenticated remote attacker can cause memory corruption in thekadmind process, which is likely to cause kadmind to crash, resulting ina denial of service. It is at least theoretically possible for suchcorruption to result in database corruption or arbitrary code execution,though we have no such exploit and are not aware of any such exploits inuse in the wild. In versions of MIT Kerberos shipped by Debian, thisbug can only be triggered in configurations that allow large numbers ofopen file descriptors in a process."
      }
    ],
    "CVE-2008-0960": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1663",
        "title": "",
        "body": "Wes Hardaker reported that the SNMPv3 HMAC verification relies on the client to specify the HMAC length, which allows spoofing of authenticated SNMPv3 packets."
      }
    ],
    "CVE-2008-0983": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1609",
        "title": "",
        "body": "lighttpd 1.4.18, and possibly other versions before 1.5.0, does not properly calculate the size of a file descriptor array, which allows remote attackers to cause a denial of service (crash) via a large number of connections, which triggers an out-of-bounds access."
      }
    ],
    "CVE-2008-0984": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1543",
        "title": "",
        "body": "Insufficient integrity checking in the MP4 demuxer allows a remote attacker to overwrite arbitrary memory and execute arbitrary code if a maliciously crafted MP4 file is opened."
      }
    ],
    "CVE-2008-1036": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1762",
        "title": "",
        "body": "It was discovered that icu, the internal components for Unicode, didnot properly sanitise invalid encoded data, which could lead to crosssite scripting attacks.For the oldstable distribution (etch), this problem has been fixed inversion 3.6-2etch2.For the stable distribution (lenny), this problem has been fixed inversion 3.8.1-3+lenny1.For the testing distribution (squeeze) and the unstable distribution(sid), this problem has been fixed in version 4.0.1-1.We recommend that you upgrade your icu packages."
      }
    ],
    "CVE-2008-1066": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1520",
        "title": "",
        "body": "It was discovered that the regex module in Smarty, a PHP templating engine,allows attackers to call arbitrary PHP functions via templates using theregex_replace plugin by a specially crafted search string.For the old stable distribution (sarge), this problem has been fixed inversion 2.6.9-1sarge1.For the stable distribution (etch), this problem has been fixed in version2.6.14-1etch1.For the unstable distribution (sid), this problem has been fixed in version2.6.18-1.1.We recommend that you upgrade your smarty package."
      }
    ],
    "CVE-2008-1096": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1858",
        "title": "",
        "body": "The load_tile function in the XCF coder allows user-assisted remote attackers to cause a denial of service or possibly execute arbitrary code via a crafted .xcf file that triggers an out-of-bounds heap write. It affects only to oldstable (etch)."
      }
    ],
    "CVE-2008-1097": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1858",
        "title": "",
        "body": "Heap-based buffer overflow in the PCX coder allows user-assisted remote attackers to cause a denial of service or possibly execute arbitrary code via a crafted .pcx file that triggers incorrect memory allocation for the scanline array, leading to memory corruption. It affects only to oldstable (etch)."
      }
    ],
    "CVE-2008-1098": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1514",
        "title": "",
        "body": "Cross-site-scripting vulnerabilities have been discovered in the GUI editor formatter and the code to delete pages."
      }
    ],
    "CVE-2008-1099": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1514",
        "title": "",
        "body": "The macro code validates access control lists insufficiently, which could lead to information disclosure."
      }
    ],
    "CVE-2008-1100": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1549",
        "title": "",
        "body": "Alin Rad Pop discovered that a buffer overflow in the handler for Upack PE binaries may lead to the execution of arbitrary code."
      }
    ],
    "CVE-2008-1102": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1567",
        "title": "",
        "body": "Stefan Cornelius discovered a vulnerability in the Radiance HighDynamic Range (HDR) image parser in Blender, a 3D modellingapplication. The weakness could enable a stack-based buffer overflowand the execution of arbitrary code if a maliciously-crafted HDR fileis opened, or if a directory containing such a file is browsed viaBlender's image-open dialog.For the stable distribution (etch), these problems have been fixed inversion 2.42a-7.1+etch1.For the unstable distribution (sid), these problems have been fixed inversion 2.45-5.We recommend that you upgrade your blender packages."
      }
    ],
    "CVE-2008-1105": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1590",
        "title": "",
        "body": "Alin Rad Pop discovered that Samba contained a buffer overflow conditionwhen processing certain responses received while acting as a client,leading to arbitrary code execution (CVE-2008-1105).For the stable distribution (etch), this problem has been fixed in version3.0.24-6etch10.For the unstable distribution (sid), this problem has been fixed inversion 3.0.30-1.We recommend that you upgrade your samba packages."
      }
    ],
    "CVE-2008-1111": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1513",
        "title": "",
        "body": "It was discovered that lighttpd, a fast webserver with minimal memoryfootprint, would display the source to CGI scripts if their executionfailed in some circumstances.For the stable distribution (etch), this problem has been fixed in version1.4.13-4etch5.For the unstable distribution, this problem will be fixed soon.We recommend that you upgrade your lighttpd package."
      }
    ],
    "CVE-2008-1149": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1557",
        "title": "",
        "body": "Cross site scripting and SQL injection were possible by attackers that had permission to create cookies in the same cookie domain as phpMyAdmin runs in."
      }
    ],
    "CVE-2008-1161": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1536",
        "title": "",
        "body": "Buffer overflow in the Matroska demuxer allows remote attackers to cause a denial of service (crash) and possibly execute arbitrary code via a Matroska file with invalid frame sizes."
      }
    ],
    "CVE-2008-1233": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1532",
        "title": "",
        "body": "moz_bug_r_a4 discovered that variants of CVE-2007-3738 and CVE-2007-5338 allow the execution of arbitrary code through XPCNativeWrapper."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1534",
        "title": "",
        "body": "moz_bug_r_a4 discovered that variants of CVE-2007-3738 and CVE-2007-5338 allow the execution of arbitrary code through XPCNativeWrapper."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1535",
        "title": "",
        "body": "moz_bug_r_a4 discovered that variants of CVE-2007-3738 and CVE-2007-5338 allow the execution of arbitrary code through XPCNativeWrapper."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1574",
        "title": "",
        "body": "moz_bug_r_a4 discovered that variants of CVE-2007-3738 and CVE-2007-5338 allow the execution of arbitrary code through XPCNativeWrapper."
      }
    ],
    "CVE-2008-1234": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1532",
        "title": "",
        "body": "moz_bug_r_a4 discovered that insecure handling of event handlers could lead to cross-site scripting."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1534",
        "title": "",
        "body": "moz_bug_r_a4 discovered that insecure handling of event handlers could lead to cross-site scripting."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1535",
        "title": "",
        "body": "moz_bug_r_a4 discovered that insecure handling of event handlers could lead to cross-site scripting."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1574",
        "title": "",
        "body": "moz_bug_r_a4 discovered that insecure handling of event handlers could lead to cross-site scripting."
      }
    ],
    "CVE-2008-1236": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1532",
        "title": "",
        "body": "Tom Ferris, Seth Spitzer, Martin Wargers, John Daggett and Mats Palmgren discovered crashes in the layout engine, which might allow the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1534",
        "title": "",
        "body": "Tom Ferris, Seth Spitzer, Martin Wargers, John Daggett and Mats Palmgren discovered crashes in the layout engine, which might allow the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1535",
        "title": "",
        "body": "Tom Ferris, Seth Spitzer, Martin Wargers, John Daggett and Mats Palmgren discovered crashes in the layout engine, which might allow the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1574",
        "title": "",
        "body": "Tom Ferris, Seth Spitzer, Martin Wargers, John Daggett and Mats Palmgren discovered crashes in the layout engine, which might allow the execution of arbitrary code."
      }
    ],
    "CVE-2008-1237": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1532",
        "title": "",
        "body": "georgi, tgirmann and Igor Bukanov discovered crashes in the Javascript engine, which might allow the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1534",
        "title": "",
        "body": "georgi, tgirmann and Igor Bukanov discovered crashes in the Javascript engine, which might allow the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1535",
        "title": "",
        "body": "georgi, tgirmann and Igor Bukanov discovered crashes in the Javascript engine, which might allow the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1574",
        "title": "",
        "body": "georgi, tgirmann and Igor Bukanov discovered crashes in the Javascript engine, which might allow the execution of arbitrary code."
      }
    ],
    "CVE-2008-1238": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1532",
        "title": "",
        "body": "Gregory Fleischer discovered that HTTP Referrer headers were handled incorrectly in combination with URLs containing Basic Authentication credentials with empty usernames, resulting in potential Cross-Site Request Forgery attacks."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1534",
        "title": "",
        "body": "Gregory Fleischer discovered that HTTP Referrer headers were handled incorrectly in combination with URLs containing Basic Authentication credentials with empty usernames, resulting in potential Cross-Site Request Forgery attacks."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1535",
        "title": "",
        "body": "Gregory Fleischer discovered that HTTP Referrer headers were handled incorrectly in combination with URLs containing Basic Authentication credentials with empty usernames, resulting in potential Cross-Site Request Forgery attacks."
      }
    ],
    "CVE-2008-1270": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1521",
        "title": "",
        "body": "Julien Cayzac discovered that under certain circumstances lighttpd,a fast webserver with minimal memory footprint, might allow the readingof arbitrary files from the system. This problem could only occurwith a non-standard configuration.For the stable distribution (etch), this problem has been fixed inversion 1.4.13-4etch6.We recommend that you upgrade your lighttpd package."
      }
    ],
    "CVE-2008-1284": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1519",
        "title": "",
        "body": "It was discovered that the Horde web application framework permits arbitraryfile inclusion by a remote attacker through the theme preference parameter.For the old stable distribution (sarge) this problem has been fixed inversion 3.0.4-4sarge7.For the stable distribution (etch) this problem has been fixed in version3.1.3-4etch3.For the unstable distribution (sid) this problem has been fixed in version3.1.7-1.We recommend that you upgrade your horde3 package."
      }
    ],
    "CVE-2008-1293": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1561",
        "title": "",
        "body": "Christian Herzog discovered that within the Linux Terminal Server Project,it was possible to connect to X on any LTSP client from any host on thenetwork, making client windows and keystrokes visible to that host.NOTE: most ldm installs are likely to be in a chroot environment exportedover NFS, and will not be upgraded merely by upgrading the server itself.For example, on the i386 architecture, to upgrade ldm will likely require: chroot /opt/ltsp/i386 apt-get update chroot /opt/ltsp/i386 apt-get dist-upgradeFor the stable distribution (etch), this problem has been fixed inversion 0.99debian11+etch1.For the unstable distribution (sid), this problem has been fixed inversion 2:0.1~bzr20080308-1.We recommend that you upgrade your ldm package."
      }
    ],
    "CVE-2008-1294": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1565",
        "title": "",
        "body": "David Peer discovered that users could escape administrator imposed cpu time limitations (RLIMIT_CPU) by setting a limit of 0."
      }
    ],
    "CVE-2008-1332": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1525",
        "title": "",
        "body": "Jason Parker discovered that insufficient validation of From: headers inside the SIP channel driver may lead to authentication bypass and the potential external initiation of calls."
      }
    ],
    "CVE-2008-1373": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1625",
        "title": "",
        "body": "Buffer overflow in the GIF filter allowed to possibly run arbitrary code through crafted GIF files."
      }
    ],
    "CVE-2008-1377": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1595",
        "title": "",
        "body": "Lack of validation of the parameters of the SProcSecurityGenerateAuthorization and SProcRecordCreateContext functions makes it possible for a specially crafted request to trigger the swapping of bytes outside the parameter of these requests, causing memory corruption."
      }
    ],
    "CVE-2008-1379": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1595",
        "title": "",
        "body": "An integer overflow in the validation of the parameters of the ShmPutImage() request makes it possible to trigger the copy of arbitrary server memory to a pixmap that can subsequently be read by the client, to read arbitrary parts of the X server memory space."
      }
    ],
    "CVE-2008-1380": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1555",
        "title": "",
        "body": "It was discovered that crashes in the Javascript engine of Iceweasel,an unbranded version of the Firefox browser, could potentially lead tothe execution of arbitrary code.For the stable distribution (etch), this problem has been fixed inversion 2.0.0.14-0etch1.For the unstable distribution (sid), this problem has been fixed inversion 2.0.0.14-1.We recommend that you upgrade your iceweasel package."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1558",
        "title": "",
        "body": "It was discovered that crashes in the Javascript engine of xulrunner,the Gecko engine library, could potentially lead to the execution ofarbitrary code.For the stable distribution (etch), this problem has been fixed inversion 1.8.0.15~pre080323b-0etch2.For the unstable distribution (sid), this problem has been fixed inversion 1.8.1.14-1.We recommend that you upgrade your xulrunner packages."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1562",
        "title": "",
        "body": "It was discovered that crashes in the JavaScript engine of Iceape,an unbranded version of the Seamonkey internet suite couldpotentially lead to the execution of arbitrary code.For the stable distribution (etch), this problem has been fixed inversion 1.0.13~pre080323b-0etch3.For the unstable distribution (sid), this problem has been fixed inversion 1.1.9-2.We recommend that you upgrade your iceape packages."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "It was discovered that crashes in the Javascript engine could potentially lead to the execution of arbitrary code. (MFSA 2008-20)"
      }
    ],
    "CVE-2008-1382": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1750",
        "title": "",
        "body": "libpng allows context-dependent attackers to cause a denial of service (crash) and possibly execute arbitrary code via a PNG file with zero length \"unknown\" chunks, which trigger an access of uninitialized memory."
      }
    ],
    "CVE-2008-1384": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1572",
        "title": "",
        "body": "Integer overflow allows context-dependent attackers to cause a denial of service and possibly have other impact via a printf format parameter with a large width specifier."
      }
    ],
    "CVE-2008-1391": [
      {
        "url": "http://www.debian.org/security/2010/dsa-2058",
        "title": "",
        "body": "Maksymilian Arciemowicz discovered that the GNU C library did not correctly handle integer overflows in the strfmon family of functions. If a user or automated system were tricked into processing a specially crafted format string, a remote attacker could crash applications, leading to a denial of service."
      }
    ],
    "CVE-2008-1419": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1591",
        "title": "",
        "body": "libvorbis does not properly handle a zero value which allows remote attackers to cause a denial of service (crash or infinite loop) or trigger an integer overflow."
      }
    ],
    "CVE-2008-1420": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1591",
        "title": "",
        "body": "Integer overflow in libvorbis allows remote attackers to execute arbitrary code via a crafted OGG file, which triggers a heap overflow."
      }
    ],
    "CVE-2008-1423": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1591",
        "title": "",
        "body": "Integer overflow in libvorbis allows remote attackers to cause a denial of service (crash) or execute arbitrary code via a crafted OGG file which triggers a heap overflow."
      }
    ],
    "CVE-2008-1474": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1554",
        "title": "",
        "body": "Roundup, an issue tracking system, fails to properly escape HTML input,allowing an attacker to inject client-side code (typically JavaScript)into a document that may be viewed in the victim's browser.For the stable distribution (etch), this problem has been fixed in version1.2.1-5+etch2.For the unstable distribution (sid), this problem has been fixed inversion 1.3.3-3.1.We recommend that you upgrade your roundup packages."
      }
    ],
    "CVE-2008-1476": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1528",
        "title": "",
        "body": "Peter Hüwe and Hanno Böck discovered that Serendipity, a weblog manager,did not properly sanitise input to several scripts which allowedcross site scripting.The old stable distribution (sarge) does not contain a serendipity package.For the stable distribution (etch), this problem has been fixed in version1.0.4-1+etch1.For the unstable distribution (sid), this problem has been fixed inversion 1.3-1.We recommend that you upgrade your serendipity package."
      }
    ],
    "CVE-2008-1482": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1586",
        "title": "",
        "body": "Integer overflow vulnerabilities exist in xine's FLV, QuickTime, RealMedia, MVE and CAK demuxers, as well as the EBML parser used by the Matroska demuxer. These weaknesses allow an attacker to overflow heap buffers and potentially execute arbitrary code by supplying a maliciously crafted file of those types."
      }
    ],
    "CVE-2008-1483": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1576",
        "title": "",
        "body": "The recently announced vulnerability in Debian's openssl package(DSA-1571-1, CVE-2008-0166) indirectly affects OpenSSH. As a result,all user and host keys generated using broken versions of the opensslpackage must be considered untrustworthy, even after the openssl updatehas been applied.1. Install the security updates This update contains a dependency on the openssl update and will automatically install a corrected version of the libssl0.9.8 package, and a new package openssh-blacklist. Once the update is applied, weak user keys will be automatically rejected where possible (though they cannot be detected in all cases). If you are using such keys for user authentication, they will immediately stop working and will need to be replaced (see step 3). OpenSSH host keys can be automatically regenerated when the OpenSSH security update is applied. The update will prompt for confirmation before taking this step.2. Update OpenSSH known_hosts files The regeneration of host keys will cause a warning to be displayed when connecting to the system using SSH until the host key is updated in the known_hosts file. The warning will look like this:@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ WARNING: REMOTE HOST IDENTIFICATION HAS CHANGED! @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@IT IS POSSIBLE THAT SOMEONE IS DOING SOMETHING NASTY!Someone could be eavesdropping on you right now (man-in-the-middle attack)!It is also possible that the RSA host key has just been changed. In this case, the host key has simply been changed, and you should update the relevant known_hosts file as indicated in the error message. It is recommended that you use a trustworthy channel to exchange the server key. It is found in the file /etc/ssh/ssh_host_rsa_key.pub on the server; it's fingerprint can be printed using the command: ssh-keygen -l -f /etc/ssh/ssh_host_rsa_key.pub In addition to user-specific known_hosts files, there may be a system-wide known hosts file /etc/ssh/ssh_known_hosts. This is file is used both by the ssh client and by sshd for the hosts.equiv functionality. This file needs to be updated as well.3. Check all OpenSSH user keys The safest course of action is to regenerate all OpenSSH user keys, except where it can be established to a high degree of certainty that the key was generated on an unaffected system. Check whether your key is affected by running the ssh-vulnkey tool, included in the security update. By default, ssh-vulnkey will check the standard location for user keys (~/.ssh/id_rsa, ~/.ssh/id_dsa and ~/.ssh/identity), your authorized_keys file (~/.ssh/authorized_keys and ~/.ssh/authorized_keys2), and the system's host keys (/etc/ssh/ssh_host_dsa_key and /etc/ssh/ssh_host_rsa_key). To check all your own keys, assuming they are in the standard locations (~/.ssh/id_rsa, ~/.ssh/id_dsa, or ~/.ssh/identity): ssh-vulnkey To check all keys on your system: sudo ssh-vulnkey -a To check a key in a non-standard location: ssh-vulnkey /path/to/key If ssh-vulnkey says \"Unknown (no blacklist information)\", then it has no information about whether that key is affected. In this case, you can examine the modification time (mtime) of the file using \"ls -l\". Keys generated before September 2006 are not affected. Keep in mind that, although unlikely, backup procedures may have changed the file date back in time (or the system clock may have been incorrectly set). If in doubt, generate a new key and remove the old one from any servers.4. Regenerate any affected user keys OpenSSH keys used for user authentication must be manually regenerated, including those which may have since been transferred to a different system after being generated. New keys can be generated using ssh-keygen, e.g.: $ ssh-keygen Generating public/private rsa key pair. Enter file in which to save the key (/home/user/.ssh/id_rsa): Enter passphrase (empty for no passphrase): Enter same passphrase again: Your identification has been saved in /home/user/.ssh/id_rsa. Your public key has been saved in /home/user/.ssh/id_rsa.pub. The key fingerprint is: 00:00:00:00:00:00:00:00:00:00:00:00:00:00:00:00 user@host5. Update authorized_keys files (if necessary) Once the user keys have been regenerated, the relevant public keys must be propagated to any authorized_keys files (and authorized_keys2 files, if applicable) on remote systems. Be sure to delete the lines containing old keys from those files.In addition to countermeasures to mitigate the randomness vulnerability,this OpenSSH update fixes several other vulnerabilities:CVE-2008-1483: Timo Juhani Lindfors discovered that, when using X11 forwarding, the SSH client selects an X11 forwarding port without ensuring that it can be bound on all address families. If the system is configured with IPv6 (even if it does not have working IPv6 connectivity), this could allow a local attacker on the remote server to hijack X11 forwarding.CVE-2007-4752: Jan Pechanec discovered that ssh falls back to creating a trusted X11 cookie if creating an untrusted cookie fails, potentially exposing the local display to a malicious remote server when using X11 forwarding.For the stable distribution (etch), these problems have been fixed inversion 4.3p2-9etch1. Currently, only a subset of all supportedarchitectures have been built; further updates will be provided whenthey become available.For the unstable distribution (sid) and the testing distribution(lenny), these problems have been fixed in version 4.7p1-9.We recommend that you upgrade your openssh packages and take themeasures indicated above."
      }
    ],
    "CVE-2008-1489": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1543",
        "title": "",
        "body": "An integer overflow vulnerability in MP4 handling allows a remote attacker to cause a heap buffer overflow, inducing a crash and possibly the execution of arbitrary code if a maliciously crafted MP4 file is opened."
      }
    ],
    "CVE-2008-1502": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1691",
        "title": "",
        "body": "Several remote vulnerabilities have been discovered in Moodle, an onlinecourse management system. The following issues are addressed in thisupdate, ranging from cross site scripting to remote code execution.Various cross site scripting issues in the Moodle codebase(CVE-2008-3326, CVE-2008-3325, CVE-2007-3555, CVE-2008-5432,MSA-08-0021, MDL-8849, MDL-12793, MDL-11414, MDL-14806,MDL-10276).Various cross site request forgery issues in the Moodle codebase(CVE-2008-3325, MSA-08-0023).Privilege escalation bugs in the Moodle codebase (MSA-08-0001, MDL-7755).SQL injection issue in the hotpot module (MSA-08-0010).An embedded copy of Smarty had several vulnerabilities(CVE-2008-4811, CVE-2008-4810).An embedded copy of Snoopy was vulnerable to cross site scripting(CVE-2008-4796).An embedded copy of Kses was vulnerable to cross site scripting(CVE-2008-1502).For the stable distribution (etch), these problems have been fixed inversion 1.6.3-2+etch1.For the unstable distribution (sid), these problems have been fixed inversion 1.8.2.dfsg-2.We recommend that you upgrade your moodle (1.6.3-2+etch1) package."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1871",
        "title": "",
        "body": "It was discovered that the _bad_protocol_once function in KSES, as usedby wordpress, allows remote attackers to perform cross-site scriptingattacks."
      }
    ],
    "CVE-2008-1514": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1655",
        "title": "",
        "body": "Jan Kratochvil reported a local denial of service vulnerability in the ptrace interface for the s390 architecture. Local users can trigger an invalid pointer dereference, leading to a system panic."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1653",
        "title": "",
        "body": "Jan Kratochvil reported a local denial of service vulnerability in the ptrace interface for the s390 architecture. Local users can trigger an invalid pointer dereference, leading to a system panic."
      }
    ],
    "CVE-2008-1558": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1552",
        "title": "",
        "body": "It was discovered that the MPlayer movie player performs insufficientinput sanitising on SDP session data, leading to potential executionof arbitrary code through a malformed multimedia stream.For the stable distribution (etch), this problem has been fixed inversion 1.0~rc1-12etch3.For the unstable distribution (sid), this problem has been fixed inversion 1.0~rc2-10.We recommend that you upgrade your mplayer package."
      }
    ],
    "CVE-2008-1567": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1557",
        "title": "",
        "body": "The PHP session data file stored the username and password of a logged in user, which in some setups can be read by a local user."
      }
    ],
    "CVE-2008-1612": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1646",
        "title": "",
        "body": "A weakness has been discovered in squid, a caching proxy server. Theflaw was introduced upstream in response to CVE-2007-6239, andannounced by Debian in DSA-1482-1. The flaw involves anover-aggressive bounds check on an array resize, and could beexploited by an authorized client to induce a denial of servicecondition against squid.For the stable distribution (etch), these problems have been fixed inversion 2.6.5-6etch2.We recommend that you upgrade your squid packages."
      }
    ],
    "CVE-2008-1614": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1550",
        "title": "",
        "body": "It was discovered that suphp, an Apache module to run PHP scripts withowner permissions handles symlinks insecurely, which may lead toprivilege escalation by local users.For the stable distribution (etch), this problem has been fixed inversion 0.6.2-1+etch0.For the unstable distribution (sid), this problem will be fixed soon.We recommend that you upgrade your suphp packages."
      }
    ],
    "CVE-2008-1615": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1588",
        "title": "",
        "body": "Jan Kratochvil reported a local denial of service condition that permits local users on systems running the amd64 flavor kernel to cause a system crash."
      }
    ],
    "CVE-2008-1637": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1544",
        "title": "",
        "body": "Amit Klein discovered that pdns-recursor, a caching DNS resolver, uses aweak random number generator to create DNS transaction IDs and UDPsource port numbers. As a result, cache poisoning attacks weresimplified. (CVE-2008-1637and CVE-2008-3217)For the stable distribution (etch), these problems have been fixed inversion 3.1.4-1+etch2.For the unstable distribution (sid), these problems have been fixed inversion 3.1.7-1.We recommend that you upgrade your pdns-recursor package."
      }
    ],
    "CVE-2008-1648": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1600",
        "title": "",
        "body": "It was discovered that sympa, a modern mailing list manager, wouldcrash when processing certain types of malformed messages.For the stable distribution (etch), this problem has been fixed in version5.2.3-1.2+etch1.For the unstable distribution (sid), this problem has been fixed inversion 5.3.4-4.We recommend that you upgrade your sympa package."
      }
    ],
    "CVE-2008-1669": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1575",
        "title": "",
        "body": "A vulnerability has been discovered in the Linux kernel that may leadto a denial of service. The Common Vulnerabilities and Exposuresproject identifies the following problem:CVE-2008-1669 Alexander Viro discovered a race condition in the fcntl code that may permit local users on multi-processor systems to execute parallel code paths that are otherwise prohibited and gain re-ordered access to the descriptor table.For the stable distribution (etch), this problem has been fixed in version2.6.18.dfsg.1-18etch4.For the unstable distribution (sid), this problem has been fixed in version2.6.25-2.We recommend that you upgrade your linux-2.6, fai-kernels, anduser-mode-linux packages."
      }
    ],
    "CVE-2008-1673": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1592",
        "title": "",
        "body": "Wei Wang from McAfee reported a potential heap overflow in the ASN.1 decode code that is used by the SNMP NAT and CIFS subsystem. Exploitation of this issue may lead to arbitrary code execution. This issue is not believed to be exploitable with the pre-built kernel images provided by Debian, but it might be an issue for custom images built from the Debian-provided source package."
      }
    ],
    "CVE-2008-1679": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1551",
        "title": "",
        "body": ""
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1620",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2008-1686": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1584",
        "title": "",
        "body": "It was discovered that libfishsound, a simple programming interface thatwraps Xiph.Org audio codecs, didn't correctly handle negative values ina particular header field. This could allow malicious files to executearbitrary code.For the stable distribution (etch), this problem has been fixed in version0.7.0-2etch1.For the unstable distribution (sid), this problem has been fixed inversion 0.7.0-2.2.We recommend that you upgrade your libfishsound package."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1585",
        "title": "",
        "body": "It was discovered that speex, the Speex codec command line tools, didnot correctly deal with negative offsets in a particularheader field. This could allow a malicious file to execute arbitrarycode.For the stable distribution (etch), this problem has been fixed in version1.1.12-3etch1.We recommend that you upgrade your speex package."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1586",
        "title": "",
        "body": "Insufficient input validation in the Speex implementation used by this version of xine enables an invalid array access and the execution of arbitrary code by supplying a maliciously crafted Speex file."
      }
    ],
    "CVE-2008-1693": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1548",
        "title": "",
        "body": "Kees Cook discovered a vulnerability in xpdf, a set of tools fordisplay and conversion of Portable Document Format (PDF) files. TheCommon Vulnerabilities and Exposures project identifies the followingproblem:CVE-2008-1693 Xpdf's handling of embedded fonts lacks sufficient validation and type checking. If a maliciously crafted PDF file is opened, the vulnerability may allow the execution of arbitrary code with the privileges of the user running xpdf.For the stable distribution (etch), these problems have been fixed inversion 3.01-9.1+etch4.For the unstable distribution (sid), these problems have been fixed inversion 3.02-1.2.We recommend that you upgrade your xpdf package."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1606",
        "title": "",
        "body": "It was discovered that poppler, a PDF rendering library, did notproperly handle embedded fonts in PDF files, allowing attackers toexecute arbitrary code via a crafted font object.For the stable distribution (etch), this problem has been fixed in version0.4.5-5.1etch3.For the unstable distribution (sid), this problem has been fixed inversion 0.8.0-1.We recommend that you upgrade your poppler package."
      }
    ],
    "CVE-2008-1720": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1545",
        "title": "",
        "body": "Sebastian Krahmer discovered that an integer overflow in rsync's codefor handling extended attributes may lead to arbitrary code execution.For the stable distribution (etch), this problem has been fixed inversion 2.6.9-2etch2.For the unstable distribution (sid), this problem has been fixed inversion 3.0.2-1.We recommend that you upgrade your rsync package."
      }
    ],
    "CVE-2008-1721": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1551",
        "title": "",
        "body": "Justin Ferguson discovered that a buffer overflow in the zlib module may lead to the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1620",
        "title": "",
        "body": "Justin Ferguson discovered that a buffer overflow in the zlib module may lead to the execution of arbitrary code."
      }
    ],
    "CVE-2008-1722": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1625",
        "title": "",
        "body": "Integer overflows in the PNG filter allowed to possibly run arbitrary code through crafted PNG files."
      }
    ],
    "CVE-2008-1767": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1589",
        "title": "",
        "body": "It was discovered that libxslt, an XSLT processing runtime library,could be coerced into executing arbitrary code via a buffer overflowwhen an XSL style sheet file with a long XSLT \"transformation match\"condition triggered a large number of steps.For the stable distribution (etch), this problem has been fixed in version1.1.19-2.For the unstable distribution (sid), this problem has been fixed inversion 1.1.24-1.We recommend that you upgrade your libxslt package."
      }
    ],
    "CVE-2008-1771": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1597",
        "title": "",
        "body": "An integer overflow weakness in the handling of HTTP POST variables could allow a heap buffer overflow and potentially arbitrary code execution."
      }
    ],
    "CVE-2008-1801": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1573",
        "title": "",
        "body": "Remote exploitation of an integer underflow vulnerability allows attackers to execute arbitrary code with the privileges of the logged-in user."
      }
    ],
    "CVE-2008-1802": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1573",
        "title": "",
        "body": "Remote exploitation of a BSS overflow vulnerability allows attackers to execute arbitrary code with the privileges of the logged-in user."
      }
    ],
    "CVE-2008-1803": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1573",
        "title": "",
        "body": "Remote exploitation of an integer signedness vulnerability allows attackers to execute arbitrary code with the privileges of the logged-in user."
      }
    ],
    "CVE-2008-1833": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1549",
        "title": "",
        "body": "Damian Put and Thomas Pollet discovered that a buffer overflow in the handler for WWPack-compressed PE binaries may lead to the execution of arbitrary code."
      }
    ],
    "CVE-2008-1878": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1586",
        "title": "",
        "body": "Inadequate bounds checking in the NES Sound Format (NSF) demuxer enables a stack buffer overflow and the execution of arbitrary code through a maliciously crafted NSF file."
      }
    ],
    "CVE-2008-1887": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1551",
        "title": "",
        "body": "Justin Ferguson discovered that insufficient input validation in PyString_FromStringAndSize() may lead to the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1620",
        "title": "",
        "body": "Justin Ferguson discovered that insufficient input validation in PyString_FromStringAndSize() may lead to the execution of arbitrary code."
      }
    ],
    "CVE-2008-1897": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1563",
        "title": "",
        "body": "Joel R. Voss discovered that the IAX2 module of Asterisk, a freesoftware PBX and telephony toolkit performs insufficient validation ofIAX2 protocol messages, which may lead to denial of service.For the stable distribution (etch), this problem has been fixed inversion 1.2.13~dfsg-2etch4.For the unstable distribution (sid), this problem has been fixedin version 1.4.19.1~dfsg-1.We recommend that you upgrade your asterisk packages."
      }
    ],
    "CVE-2008-1924": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1557",
        "title": "",
        "body": "Attackers with CREATE table permissions were allowed to read arbitrary files readable by the webserver via a crafted HTTP POST request."
      }
    ],
    "CVE-2008-1927": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1556",
        "title": "",
        "body": "It has been discovered that the Perl interpreter may encounter a bufferoverflow condition when compiling certain regular expressions containingUnicode characters. This also happens if the offending characters arecontained in a variable reference protected by the \\Q...\\E quotingconstruct. When encountering this condition, the Perl interpretertypically crashes, but arbitrary code execution cannot be ruled out.For the stable distribution (etch), this problem has been fixed inversion 5.8.8-7etch3.The unstable distribution (sid) will be fixed soon.We recommend that you upgrade your perl packages."
      }
    ],
    "CVE-2008-1947": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1593",
        "title": "",
        "body": "It was discovered that the Host Manager web application performedinsufficient input sanitising, which could lead to cross-site scripting.For the stable distribution (etch), this problem has been fixed inversion 5.5.20-2etch3.For the unstable distribution (sid), this problem has been fixed inversion 5.5.26-3.We recommend that you upgrade your tomcat5.5 packages."
      }
    ],
    "CVE-2008-1948": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1581",
        "title": "",
        "body": "A pre-authentication heap overflow involving oversized session resumption data may lead to arbitrary code execution."
      }
    ],
    "CVE-2008-1949": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1581",
        "title": "",
        "body": "Repeated client hellos may result in a pre-authentication denial of service condition due to a null pointer dereference."
      }
    ],
    "CVE-2008-1950": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1581",
        "title": "",
        "body": "Decoding cipher padding with an invalid record length may cause GNUTLS to read memory beyond the end of the received record, leading to a pre-authentication denial of service condition."
      }
    ],
    "CVE-2008-1974": [
      {
        "url": "https://www.debian.org/security/2008/dsa-1560",
        "title": "",
        "body": "\"The-0utl4w\" discovered that the Kronolith, calendar component forthe Horde Framework, didn't properly sanitise URL input, leading toa cross-site scripting vulnerability in the add event screen.For the stable distribution (etch), this problem has been fixed in version2.1.4-1etch1.For the unstable distribution (sid), this problem has been fixed inversion 2.1.8-1.We recommend that you upgrade your kronolith2 package."
      }
    ],
    "CVE-2008-2040": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1582",
        "title": "",
        "body": "Nico Golde discovered that PeerCast, a P2P audio and video streamingserver, is vulnerable to a buffer overflow in the HTTP BasicAuthentication code, allowing a remote attacker to crash PeerCast orexecute arbitrary code.For the stable distribution (etch), this problem has been fixed inversion 0.1217.toots.20060314-1etch1.For the unstable distribution (sid), this problem has been fixed inversion 0.1218+svn20080104-1.1.We recommend that you upgrade your peercast package."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1583",
        "title": "",
        "body": "Nico Golde discovered that PeerCast, a P2P audio and video streaming server, is vulnerable to a buffer overflow in the HTTP Basic Authentication code, allowing a remote attacker to crash PeerCast or execute arbitrary code."
      }
    ],
    "CVE-2008-2050": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1572",
        "title": "",
        "body": "Stack-based buffer overflow in the FastCGI SAPI."
      }
    ],
    "CVE-2008-2079": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1608",
        "title": "",
        "body": "Sergei Golubchik discovered that MySQL, a widely-deployed databaseserver, did not properly validate optional data or index directorypaths given in a CREATE TABLE statement, nor would it (under properconditions) prevent two databases from using the same paths for dataor index files. This permits an authenticated user with authorizationto create tables in one database to read, write or delete data fromtables subsequently created in other databases, regardless of otherGRANT authorizations. The Common Vulnerabilities and Exposuresproject identifies this weakness as CVE-2008-2079.For the stable distribution (etch), this problem has been fixed inversion 5.0.32-7etch6. Note that the fix applied will have theconsequence of disallowing the selection of data or index pathsunder the database root, which on a Debian system is /var/lib/mysql;database administrators needing to control the placement of thesefiles under that location must do so through other means.We recommend that you upgrade your mysql-dfsg-5.0 packages."
      }
    ],
    "CVE-2008-2107": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1789",
        "title": "",
        "body": "The GENERATE_SEED macro has several problems that make predicting generated random numbers easier, facilitating attacks against measures that use rand() or mt_rand() as part of a protection."
      }
    ],
    "CVE-2008-2108": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1789",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2008-2136": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1588",
        "title": "",
        "body": "Paul Harks discovered a memory leak in the Simple Internet Transition (SIT) code used for IPv6 over IPv4 tunnels. This can be exploited by remote users to cause a denial of service condition."
      }
    ],
    "CVE-2008-2137": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1588",
        "title": "",
        "body": "David Miller and Jan Lieskovsky discovered issues with the virtual address range checking of mmaped regions on the sparc architecture that may be exploited by local users to cause a denial of service."
      }
    ],
    "CVE-2008-2149": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1634",
        "title": "",
        "body": "Rob Holland discovered several programming errors in WordNet, anelectronic lexical database of the English language. These flaws couldallow arbitrary code execution when used with untrusted input, forexample when WordNet is in use as a back end for a web application.For the stable distribution (etch), these problems have been fixed inversion 1:2.1-4+etch1.For the testing distribution (lenny), these problems have been fixed inversion 1:3.0-11+lenny1.For the unstable distribution (sid), these problems have been fixed inversion 1:3.0-12.We recommend that you upgrade your wordnet package."
      }
    ],
    "CVE-2008-2231": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1633",
        "title": "",
        "body": "It has been discovered that Slash, the Slashdot Like AutomatedStorytelling Homepage suffers from two vulnerabilities related toinsufficient input sanitation, leading to execution of SQL commands(CVE-2008-2231) and cross-site scripting (CVE-2008-2553).For the stable distribution (etch), these problems have been fixed inversion 2.2.6-8etch1.In the unstable distribution (sid), the slash package is currentlyuninstallable and will be removed soon.We recommend that you upgrade your slash package."
      }
    ],
    "CVE-2008-2232": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1611",
        "title": "",
        "body": "Anders Kaseorg discovered that afuse, an automounting file systemin user-space, did not properly escape meta characters in paths.This allowed a local attacker with read access to the filesystem toexecute commands as the owner of the filesystem.For the stable distribution (etch), this problem has been fixed inversion 0.1.1-1+etch1.For the unstable distribution (sid), this problem has been fixed inversion 0.2-3.We recommend that you upgrade your afuse (0.1.1-1+etch1) package."
      }
    ],
    "CVE-2008-2235": [
      {
        "url": "https://www.debian.org/security/2008/dsa-1627",
        "title": "",
        "body": "Chaskiel M Grundman discovered that opensc, a library and utilities tohandle smart cards, would initialise smart cards with the Siemens CardOS M4card operating system without proper access rights. This allowed everyoneto change the card's PIN.With this bug anyone can change a user PIN without having the PIN or PUKor the superusers PIN or PUK. However it can not be used to figure out thePIN. If the PIN on your card is still the same you always had, there's areasonable chance that this vulnerability has not been exploited.This vulnerability affects only smart cards and USB crypto tokens based onSiemens CardOS M4, and within that group only those that were initialisedwith OpenSC. Users of other smart cards and USB crypto tokens, or cardsthat have been initialised with some software other than OpenSC, are notaffected.After upgrading the package, runningpkcs15-tool -Twill show you whether the card is fine or vulnerable. If the card isvulnerable, you need to update the security setting using:pkcs15-tool -T -U.For the stable distribution (etch), this problem has been fixed inversion 0.11.1-2etch2.For the unstable distribution (sid), this problem has been fixed inversion 0.11.4-5.We recommend that you upgrade your opensc package and checkyour card(s) with the command described above."
      }
    ],
    "CVE-2008-2237": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1661",
        "title": "",
        "body": "The SureRun Security team discovered a bug in the WMF file parser that can be triggered by manipulated WMF files and can lead to heap overflows and arbitrary code execution."
      }
    ],
    "CVE-2008-2238": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1661",
        "title": "",
        "body": "An anonymous researcher working with the iDefense discovered a bug in the EMF file parser that can be triggered by manipulated EMF files and can lead to heap overflows and arbitrary code execution."
      }
    ],
    "CVE-2008-2292": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1663",
        "title": "",
        "body": "John Kortink reported a buffer overflow in the __snprint_value function in snmp_get causing a denial of service and potentially allowing the execution of arbitrary code via a large OCTETSTRING in an attribute value pair (AVP)."
      }
    ],
    "CVE-2008-2315": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1667",
        "title": "",
        "body": "David Remahl discovered several integer overflows in the stringobject, unicodeobject, bufferobject, longobject, tupleobject, stropmodule, gcmodule, and mmapmodule modules."
      }
    ],
    "CVE-2008-2327": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1632",
        "title": "",
        "body": "Drew Yao discovered that libTIFF, a library for handling the Tagged ImageFile Format, is vulnerable to a programming error allowing malformedtiff files to lead to a crash or execution of arbitrary code.For the stable distribution (etch), this problem has been fixed inversion 3.8.2-7+etch1.For the testing distribution (lenny), this problem has been fixed inversion 3.8.2-10+lenny1.The unstable distribution (sid) will be fixed soon.We recommend that you upgrade your tiff package."
      }
    ],
    "CVE-2008-2357": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1587",
        "title": "",
        "body": "Adam Zabrocki discovered that under certain circumstances mtr, a fullscreen ncurses and X11 traceroute tool, could be tricked into executingarbitrary code via overly long reverse DNS records.For the stable distribution (etch), this problem has been fixed in version0.71-2etch1.For the unstable distribution (sid), this problem has been fixed inversion 0.73-1.We recommend that you upgrade your mtr package."
      }
    ],
    "CVE-2008-2358": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1592",
        "title": "",
        "body": "Brandon Edwards of McAfee Avert labs discovered an issue in the DCCP subsystem. Due to missing feature length checks it is possible to cause an overflow that may result in remote arbitrary code execution."
      }
    ],
    "CVE-2008-2360": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1595",
        "title": "",
        "body": "An integer overflow may occur in the computation of the size of the glyph to be allocated by the AllocateGlyph() function which will cause less memory to be allocated than expected, leading to later heap overflow."
      }
    ],
    "CVE-2008-2361": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1595",
        "title": "",
        "body": "An integer overflow may occur in the computation of the size of the glyph to be allocated by the ProcRenderCreateCursor() function which will cause less memory to be allocated than expected, leading later to dereferencing un-mapped memory, causing a crash of the X server."
      }
    ],
    "CVE-2008-2362": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1595",
        "title": "",
        "body": "Integer overflows can also occur in the code validating the parameters for the SProcRenderCreateLinearGradient, SProcRenderCreateRadialGradient and SProcRenderCreateConicalGradient functions, leading to memory corruption by swapping bytes outside of the intended request parameters."
      }
    ],
    "CVE-2008-2371": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1602",
        "title": "",
        "body": "Tavis Ormandy discovered that PCRE, the Perl-Compatible RegularExpression library, may encounter a heap overflow condition whencompiling certain regular expressions involving in-pattern options andbranches, potentially leading to arbitrary code execution. For the stable distribution (etch), this problem has been fixed inversion 6.7+7.4-4.For the unstable distribution (sid), this problem will be fixed soon.We recommend that you upgrade your pcre3 packages."
      }
    ],
    "CVE-2008-2376": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1618",
        "title": "",
        "body": "It was discovered that an integer overflow in the array handling code may lead to denial of service and potentially the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1612",
        "title": "",
        "body": "It was discovered that an integer overflow in the array handling code may lead to denial of service and potentially the execution of arbitrary code."
      }
    ],
    "CVE-2008-2378": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1668",
        "title": "",
        "body": "Steve Kemp discovered that hf, an amateur-radio protocol suite usinga soundcard as a modem, insecurely tried to execute an external commandwhich could lead to the elevation of privileges for local users.For the stable distribution (etch), this problem has been fixed in version0.7.3-4etch1.For the unstable distribution (sid), this problem has been fixed inversion 0.8-8.1.We recommend that you upgrade your hf package."
      }
    ],
    "CVE-2008-2379": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1682",
        "title": "",
        "body": "Ivan Markovic discovered that SquirrelMail, a webmail application, did notsufficiently sanitise incoming HTML email, allowing an attacker to performcross site scripting through sending a malicious HTML email.For the stable distribution (etch), this problem has been fixed inversion 1.4.9a-3.For the unstable distribution (sid), this problem has been fixed inversion 1.4.15-4.We recommend that you upgrade your squirrelmail package."
      }
    ],
    "CVE-2008-2383": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1694",
        "title": "",
        "body": "Paul Szabo discovered that xterm, a terminal emulator for the X WindowSystem, places arbitrary characters into the input buffer whendisplaying certain crafted escape sequences (CVE-2008-2383).As an additional precaution, this security update also disables fontchanging, user-defined keys, and X property changes through escapesequences.For the stable distribution (etch), this problem has been fixed inversion 222-1etch3.For the unstable distribution (sid), this problem will be fixed soon.We recommend that you upgrade your xterm package."
      }
    ],
    "CVE-2008-2426": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1594",
        "title": "",
        "body": "Stefan Cornelius discovered two buffer overflows in Imlib's - a powerfulimage loading and rendering library - image loaders for PNM and XPMimages, which may result in the execution of arbitrary code.For the stable distribution (etch), this problem has been fixed inversion 1.3.0.0debian1-4+etch1.For the unstable distribution (sid), this problem has been fixed inversion 1.4.0-1.1.We recommend that you upgrade your imlib2 package."
      }
    ],
    "CVE-2008-2469": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1659",
        "title": "",
        "body": "Dan Kaminsky discovered that libspf2, an implementation of the SenderPolicy Framework (SPF) used by mail servers for mail filtering, handlesmalformed TXT records incorrectly, leading to a buffer overflowcondition (CVE-2008-2469).Note that the SPF configuration template in Debian's Exim configurationrecommends to use libmail-spf-query-perl, which does not suffer fromthis issue.For the stable distribution (etch), this problem has been fixed inversion 1.2.5-4+etch1.For the testing distribution (lenny), this problem has been fixed inversion 1.2.5.dfsg-5+lenny1.For the unstable distribution (sid), this problem will be fixed soon.We recommend that you upgrade your libspf2 package."
      }
    ],
    "CVE-2008-2553": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1633",
        "title": "",
        "body": "It has been discovered that Slash, the Slashdot Like AutomatedStorytelling Homepage suffers from two vulnerabilities related toinsufficient input sanitation, leading to execution of SQL commands(CVE-2008-2231) and cross-site scripting (CVE-2008-2553).For the stable distribution (etch), these problems have been fixed inversion 2.2.6-8etch1.In the unstable distribution (sid), the slash package is currentlyuninstallable and will be removed soon.We recommend that you upgrade your slash package."
      }
    ],
    "CVE-2008-2662": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1618",
        "title": "",
        "body": "Drew Yao discovered that multiple integer overflows in the string processing code may lead to denial of service and potentially the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1612",
        "title": "",
        "body": "Drew Yao discovered that multiple integer overflows in the string processing code may lead to denial of service and potentially the execution of arbitrary code."
      }
    ],
    "CVE-2008-2663": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1618",
        "title": "",
        "body": "Drew Yao discovered that multiple integer overflows in the string processing code may lead to denial of service and potentially the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1612",
        "title": "",
        "body": "Drew Yao discovered that multiple integer overflows in the string processing code may lead to denial of service and potentially the execution of arbitrary code."
      }
    ],
    "CVE-2008-2664": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1618",
        "title": "",
        "body": "Drew Yao discovered that a programming error in the string processing code may lead to denial of service and potentially the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1612",
        "title": "",
        "body": "Drew Yao discovered that a programming error in the string processing code may lead to denial of service and potentially the execution of arbitrary code."
      }
    ],
    "CVE-2008-2713": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1616",
        "title": "",
        "body": "Damian Put discovered a vulnerability in the ClamAV anti-virustoolkit's parsing of Petite-packed Win32 executables. The weaknessleads to an invalid memory access, and could enable an attacker tocrash clamav by supplying a maliciously crafted Petite-compressedbinary for scanning. In some configurations, such as when clamavis used in combination with mail servers, this could cause a systemto fail open, facilitating a follow-on viral attack.A previous version of this advisory referenced packages that werebuilt incorrectly and omitted the intended correction. Thisissue was fixed in packages referenced by the -2 revision of theadvisory.The Common Vulnerabilities and Exposures project identifies thisweakness as CVE-2008-2713and CVE-2008-3215.For the stable distribution (etch), this problem has been fixed inversion 0.90.1dfsg-3.1+etch14.For the unstable distribution (sid), this problem has been fixed inversion 0.93.1.dfsg-1.1.We recommend that you upgrade your clamav packages."
      }
    ],
    "CVE-2008-2717": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1596",
        "title": "",
        "body": "Several remote vulnerabilities have been discovered in the TYPO3 contentmanagement framework.Because of a not sufficiently secure default value of the TYPO3configuration variable fileDenyPattern, authenticated backend userscould upload files that allowed to execute arbitrary code as thewebserver user.User input processed by fe_adminlib.inc is not being properly filteredto prevent Cross Site Scripting (XSS) attacks, which is exposed whenspecific plugins are in use.For the stable distribution (etch), these problems have been fixed in version4.0.2+debian-5.For the unstable distribution (sid), these problems have been fixed inversion 4.1.7-1.We recommend that you upgrade your typo3 package."
      }
    ],
    "CVE-2008-2718": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1596",
        "title": "",
        "body": "Several remote vulnerabilities have been discovered in the TYPO3 contentmanagement framework.Because of a not sufficiently secure default value of the TYPO3configuration variable fileDenyPattern, authenticated backend userscould upload files that allowed to execute arbitrary code as thewebserver user.User input processed by fe_adminlib.inc is not being properly filteredto prevent Cross Site Scripting (XSS) attacks, which is exposed whenspecific plugins are in use.For the stable distribution (etch), these problems have been fixed in version4.0.2+debian-5.For the unstable distribution (sid), these problems have been fixed inversion 4.1.7-1.We recommend that you upgrade your typo3 package."
      }
    ],
    "CVE-2008-2725": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1612",
        "title": "",
        "body": "Drew Yao discovered that an integer overflow in the array handling code may lead to denial of service and potentially the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1618",
        "title": "",
        "body": "Drew Yao discovered that an integer overflow in the array handling code may lead to denial of service and potentially the execution of arbitrary code."
      }
    ],
    "CVE-2008-2726": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1612",
        "title": "",
        "body": "Drew Yao discovered that an integer overflow in the array handling code may lead to denial of service and potentially the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1618",
        "title": "",
        "body": "Drew Yao discovered that an integer overflow in the array handling code may lead to denial of service and potentially the execution of arbitrary code."
      }
    ],
    "CVE-2008-2729": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1630",
        "title": "",
        "body": "Andi Kleen discovered an issue where uninitialized kernel memory was being leaked to userspace during an exception. This issue may allow local users to gain access to sensitive data. Only the amd64-flavour Debian kernel images are affected."
      }
    ],
    "CVE-2008-2785": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1615",
        "title": "",
        "body": "It was discovered that missing boundary checks on a reference counter for CSS objects can lead to the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1621",
        "title": "",
        "body": "It was discovered that missing boundary checks on a reference counter for CSS objects can lead to the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1614",
        "title": "",
        "body": "It was discovered that missing boundary checks on a reference counter for CSS objects can lead to the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "It was discovered that missing boundary checks on a reference counter for CSS objects can lead to the execution of arbitrary code. (MFSA 2008-34)"
      }
    ],
    "CVE-2008-2798": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1621",
        "title": "",
        "body": "Devon Hubbard, Jesse Ruderman and Martijn Wargers discovered crashes in the layout engine, which might allow the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1607",
        "title": "",
        "body": "Devon Hubbard, Jesse Ruderman and Martijn Wargers discovered crashes in the layout engine, which might allow the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1615",
        "title": "",
        "body": "Devon Hubbard, Jesse Ruderman and Martijn Wargers discovered crashes in the layout engine, which might allow the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Devon Hubbard, Jesse Ruderman and Martijn Wargers discovered crashes in the layout engine, which might allow the execution of arbitrary code. (MFSA 2008-21)"
      }
    ],
    "CVE-2008-2799": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1621",
        "title": "",
        "body": "Igor Bukanov, Jesse Ruderman and Gary Kwong discovered crashes in the Javascript engine, which might allow the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1615",
        "title": "",
        "body": "Igor Bukanov, Jesse Ruderman and Gary Kwong discovered crashes in the Javascript engine, which might allow the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1607",
        "title": "",
        "body": "Igor Bukanov, Jesse Ruderman and Gary Kwong discovered crashes in the Javascript engine, which might allow the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Igor Bukanov, Jesse Ruderman and Gary Kwong discovered crashes in the Javascript engine, which might allow the execution of arbitrary code. (MFSA 2008-21)"
      }
    ],
    "CVE-2008-2800": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1607",
        "title": "",
        "body": "\"moz_bug_r_a4\" discovered several cross-site scripting vulnerabilities."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1615",
        "title": "",
        "body": "moz_bug_r_a4 discovered several cross-site scripting vulnerabilities."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "\"moz_bug_r_a4\" discovered several cross-site scripting vulnerabilities. (MFSA 2008-22)"
      }
    ],
    "CVE-2008-2801": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1615",
        "title": "",
        "body": "Collin Jackson and Adam Barth discovered that Javascript code could be executed in the context of signed JAR archives."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1607",
        "title": "",
        "body": "Collin Jackson and Adam Barth discovered that Javascript code could be executed in the context of signed JAR archives."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Collin Jackson and Adam Barth discovered that Javascript code could be executed in the context or signed JAR archives. (MFSA 2008-23)"
      }
    ],
    "CVE-2008-2802": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1615",
        "title": "",
        "body": "moz_bug_r_a4 discovered that XUL documents can escalate privileges by accessing the pre-compiled fastload file."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1621",
        "title": "",
        "body": "\"moz_bug_r_a4\" discovered that XUL documents can escalate privileges by accessing the pre-compiled \"fastload\" file."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1607",
        "title": "",
        "body": "\"moz_bug_r_a4\" discovered that XUL documents can escalate privileges by accessing the pre-compiled \"fastload\" file."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "\"moz_bug_r_a4\" discovered that XUL documements can escalate privileges by accessing the pre-compiled \"fastload\" file. (MFSA 2008-24)"
      }
    ],
    "CVE-2008-2803": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1607",
        "title": "",
        "body": "\"moz_bug_r_a4\" discovered that missing input sanitising in the mozIJSSubScriptLoader.loadSubScript() function could lead to the execution of arbitrary code. Iceweasel itself is not affected, but some addons are."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1621",
        "title": "",
        "body": "\"moz_bug_r_a4\" discovered that missing input sanitising in the mozIJSSubScriptLoader.loadSubScript() function could lead to the execution of arbitrary code. Iceweasel itself is not affected, but some addons are."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1615",
        "title": "",
        "body": "moz_bug_r_a4 discovered that missing input sanitising in the mozIJSSubScriptLoader.loadSubScript() function could lead to the execution of arbitrary code. Iceweasel itself is not affected, but some addons are."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "\"moz_bug_r_a4\" discovered that missing input sanitising in the mozIJSSubScriptLoader.loadSubScript() function could lead to the execution of arbitrary code. Iceape itself is not affected, but some addons are. (MFSA 2008-25)"
      }
    ],
    "CVE-2008-2805": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1607",
        "title": "",
        "body": "Claudio Santambrogio discovered that missing access validation in DOM parsing allows malicious web sites to force the browser to upload local files to the server, which could lead to information disclosure."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1615",
        "title": "",
        "body": "Claudio Santambrogio discovered that missing access validation in DOM parsing allows malicious web sites to force the browser to upload local files to the server, which could lead to information disclosure."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Claudio Santambrogio discovered that missing access validation in DOM parsing allows malicious web sites to force the browser to upload local files to the server, which could lead to information disclosure. (MFSA 2008-27)"
      }
    ],
    "CVE-2008-2807": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1615",
        "title": "",
        "body": "Daniel Glazman discovered that a programming error in the code for parsing .properties files could lead to memory content being exposed to addons, which could lead to information disclosure."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1621",
        "title": "",
        "body": "Daniel Glazman discovered that a programming error in the code for parsing .properties files could lead to memory content being exposed to addons, which could lead to information disclosure."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1607",
        "title": "",
        "body": "Daniel Glazman discovered that a programming error in the code for parsing .properties files could lead to memory content being exposed to addons, which could lead to information disclosure."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Daniel Glazman discovered that a programming error in the code for parsing .properties files could lead to memory content being exposed to addons, which could lead to information disclosure. (MFSA 2008-29)"
      }
    ],
    "CVE-2008-2808": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1607",
        "title": "",
        "body": "Masahiro Yamada discovered that file URLS in directory listings were insufficiently escaped."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1615",
        "title": "",
        "body": "Masahiro Yamada discovered that file URLs in directory listings were insufficiently escaped."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Masahiro Yamada discovered that file URLs in directory listings were insufficiently escaped. (MFSA 2008-30)"
      }
    ],
    "CVE-2008-2809": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1607",
        "title": "",
        "body": "John G. Myers, Frank Benkstein and Nils Toedtmann discovered that alternate names on self-signed certificates were handled insufficiently, which could lead to spoofings secure connections."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1615",
        "title": "",
        "body": "John G. Myers, Frank Benkstein and Nils Toedtmann discovered that alternate names on self-signed certificates were handled insufficiently, which could lead to spoofing of secure connections."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1621",
        "title": "",
        "body": "John G. Myers, Frank Benkstein and Nils Toedtmann discovered that alternate names on self-signed certificates were handled insufficiently, which could lead to spoofings secure connections."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "John G. Myers, Frank Benkstein and Nils Toedtmann discovered that alternate names on self-signed certificates were handled insufficiently, which could lead to spoofings of secure connections. (MFSA 2008-31)"
      }
    ],
    "CVE-2008-2810": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "It was discovered that URL shortcut files could be used to bypass the same-origin restrictions. This issue does not affect current Iceape, but might occur with additional extensions installed. (MFSA 2008-32)"
      }
    ],
    "CVE-2008-2811": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1607",
        "title": "",
        "body": "Greg McManus discovered a crash in the block reflow code, which might allow the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1621",
        "title": "",
        "body": "Greg McManus discovered discovered a crash in the block reflow code, which might allow the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1615",
        "title": "",
        "body": "Greg McManus discovered a crash in the block reflow code, which might allow the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Greg McManus discovered a crash in the block reflow code, which might allow the execution of arbitrary code. (MFSA 2008-33)"
      }
    ],
    "CVE-2008-2812": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1630",
        "title": "",
        "body": "Alan Cox discovered an issue in multiple tty drivers that allows local users to trigger a denial of service (NULL pointer dereference) and possibly obtain elevated privileges."
      }
    ],
    "CVE-2008-2826": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1630",
        "title": "",
        "body": "Gabriel Campana discovered an integer overflow in the sctp code that can be exploited by local users to cause a denial of service."
      }
    ],
    "CVE-2008-2927": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1610",
        "title": "",
        "body": "It was discovered that gaim, an multi-protocol instant messaging client,was vulnerable to several integer overflows in its MSN protocol handlers.These could allow a remote attacker to execute arbitrary code.For the stable distribution (etch), this problem has been fixed in version1:2.0.0+beta5-10etch1.For the unstable distribution (sid), this package is not present.We recommend that you upgrade your gaim package."
      }
    ],
    "CVE-2008-2931": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1630",
        "title": "",
        "body": "Miklos Szeredi reported a missing privilege check in the do_change_type() function. This allows local, unprivileged users to change the properties of mount points."
      }
    ],
    "CVE-2008-2933": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1614",
        "title": "",
        "body": "Billy Rios discovered that passing an URL containing a pipe symbol to Iceweasel can lead to Chrome privilege escalation."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1615",
        "title": "",
        "body": "Billy Rios discovered that passing an URL containing a pipe symbol to Iceweasel can lead to Chrome privilege escalation."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Billy Rios discovered that passing an URL containing a pipe symbol to Iceape can lead to Chrome privilege escalation. (MFSA 2008-35)"
      }
    ],
    "CVE-2008-2935": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1624",
        "title": "",
        "body": "Chris Evans discovered that a buffer overflow in the RC4 functions oflibexslt may lead to the execution of arbitrary code.For the stable distribution (etch), this problem has been fixed inversion 1.1.19-3.For the unstable distribution (sid), this problem will be fixed soon.We recommend that you upgrade your libxslt packages."
      }
    ],
    "CVE-2008-2936": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1629",
        "title": "",
        "body": "Sebastian Krahmer discovered that Postfix, a mail transfer agent,incorrectly checks the ownership of a mailbox. In some configurations,this allows for appending data to arbitrary files as root.Note that only specific configurations are vulnerable; the defaultDebian installation is not affected. Only a configuration meetingthe following requirements is vulnerable: The mail delivery style is mailbox, with the Postfix built-in local(8) or virtual(8) delivery agents. The mail spool directory (/var/spool/mail) is user-writeable. The user can create hardlinks pointing to root-owned symlinks located in other directories.For a detailed treating of the issue, please refer to the upstreamauthor's announcement.For the stable distribution (etch), this problem has been fixed inversion 2.3.8-2+etch1.For the testing distribution (lenny), this problem has been fixed inversion 2.5.2-2lenny1.For the unstable distribution (sid), this problem has been fixedin version 2.5.4-1.We recommend that you upgrade your postfix package."
      }
    ],
    "CVE-2008-2952": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1650",
        "title": "",
        "body": "Cameron Hotchkies discovered that the OpenLDAP server slapd, a freeimplementation of the Lightweight Directory Access Protocol, could becrashed by sending malformed ASN1 requests.For the stable distribution (etch), this problem has been fixed inversion 2.3.30-5+etch2.For the unstable distribution (sid), this problem has been fixed inversion 2.4.10-3 of the openldap package.We recommend that you upgrade your openldap2.3 packages."
      }
    ],
    "CVE-2008-3137": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1673",
        "title": "",
        "body": "The GSM SMS dissector is vulnerable to denial of service."
      }
    ],
    "CVE-2008-3138": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1673",
        "title": "",
        "body": "The PANA and KISMET dissectors are vulnerable to denial of service."
      }
    ],
    "CVE-2008-3141": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1673",
        "title": "",
        "body": "The RMI dissector could disclose system memory."
      }
    ],
    "CVE-2008-3142": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1667",
        "title": "",
        "body": "Justin Ferguson discovered that incorrect memory allocation in the unicode_resize() function can lead to buffer overflows."
      }
    ],
    "CVE-2008-3143": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1667",
        "title": "",
        "body": "Several integer overflows were discovered in various Python core modules."
      }
    ],
    "CVE-2008-3144": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1667",
        "title": "",
        "body": "Several integer overflows were discovered in the PyOS_vsnprintf() function."
      }
    ],
    "CVE-2008-3145": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1673",
        "title": "",
        "body": "The packet reassembling module is vulnerable to denial of service."
      }
    ],
    "CVE-2008-3162": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1781",
        "title": "",
        "body": "It was discovered that using a crafted STR file can lead to theexecution of arbitrary code."
      }
    ],
    "CVE-2008-3197": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1641",
        "title": "",
        "body": "Cross site request forgery allowed remote attackers to create a new database, but not perform any other action on it."
      }
    ],
    "CVE-2008-3252": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1622",
        "title": "",
        "body": "It was discovered that newsx, an NNTP news exchange utility, was affectedby a buffer overflow allowing remote attackers to execute arbitrary codevia a news article containing a large number of lines starting with a period.For the stable distribution (etch), this problem has been fixed in version1.6-2etch1.For the testing (lenny) and unstable distribution (sid), this problem hasbeen fixed in version 1.6-3.We recommend that you upgrade your newsx package."
      }
    ],
    "CVE-2008-3272": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1636",
        "title": "",
        "body": "Tobias Klein reported a locally exploitable data leak in the snd_seq_oss_synth_make_info() function. This may allow local users to gain access to sensitive information."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1630",
        "title": "",
        "body": "Tobias Klein reported a locally exploitable data leak in the snd_seq_oss_synth_make_info() function. This may allow local users to gain access to sensitive information."
      }
    ],
    "CVE-2008-3276": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1636",
        "title": "",
        "body": "Eugene Teo reported an integer overflow in the DCCP subsystem that may allow remote attackers to cause a denial of service in the form of a kernel panic."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1653",
        "title": "",
        "body": "Eugene Teo reported an integer overflow in the DCCP subsystem that may allow remote attackers to cause a denial of service in the form of a kernel panic."
      }
    ],
    "CVE-2008-3281": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1631",
        "title": "",
        "body": "Andreas Solberg discovered that libxml2, the GNOME XML library,could be forced to recursively evaluate entities, until availableCPU and memory resources were exhausted.For the stable distribution (etch), this problem has been fixed in version2.6.27.dfsg-4.For the unstable distribution (sid), this problem has been fixed inversion 2.6.32.dfsg-3.We recommend that you upgrade your libxml2 package."
      }
    ],
    "CVE-2008-3325": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1691",
        "title": "",
        "body": "Several remote vulnerabilities have been discovered in Moodle, an onlinecourse management system. The following issues are addressed in thisupdate, ranging from cross site scripting to remote code execution.Various cross site scripting issues in the Moodle codebase(CVE-2008-3326, CVE-2008-3325, CVE-2007-3555, CVE-2008-5432,MSA-08-0021, MDL-8849, MDL-12793, MDL-11414, MDL-14806,MDL-10276).Various cross site request forgery issues in the Moodle codebase(CVE-2008-3325, MSA-08-0023).Privilege escalation bugs in the Moodle codebase (MSA-08-0001, MDL-7755).SQL injection issue in the hotpot module (MSA-08-0010).An embedded copy of Smarty had several vulnerabilities(CVE-2008-4811, CVE-2008-4810).An embedded copy of Snoopy was vulnerable to cross site scripting(CVE-2008-4796).An embedded copy of Kses was vulnerable to cross site scripting(CVE-2008-1502).For the stable distribution (etch), these problems have been fixed inversion 1.6.3-2+etch1.For the unstable distribution (sid), these problems have been fixed inversion 1.8.2.dfsg-2.We recommend that you upgrade your moodle (1.6.3-2+etch1) package."
      }
    ],
    "CVE-2008-3326": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1691",
        "title": "",
        "body": "Several remote vulnerabilities have been discovered in Moodle, an onlinecourse management system. The following issues are addressed in thisupdate, ranging from cross site scripting to remote code execution.Various cross site scripting issues in the Moodle codebase(CVE-2008-3326, CVE-2008-3325, CVE-2007-3555, CVE-2008-5432,MSA-08-0021, MDL-8849, MDL-12793, MDL-11414, MDL-14806,MDL-10276).Various cross site request forgery issues in the Moodle codebase(CVE-2008-3325, MSA-08-0023).Privilege escalation bugs in the Moodle codebase (MSA-08-0001, MDL-7755).SQL injection issue in the hotpot module (MSA-08-0010).An embedded copy of Smarty had several vulnerabilities(CVE-2008-4811, CVE-2008-4810).An embedded copy of Snoopy was vulnerable to cross site scripting(CVE-2008-4796).An embedded copy of Kses was vulnerable to cross site scripting(CVE-2008-1502).For the stable distribution (etch), these problems have been fixed inversion 1.6.3-2+etch1.For the unstable distribution (sid), these problems have been fixed inversion 1.8.2.dfsg-2.We recommend that you upgrade your moodle (1.6.3-2+etch1) package."
      }
    ],
    "CVE-2008-3337": [
      {
        "url": "https://www.debian.org/security/2008/dsa-1628",
        "title": "",
        "body": "Brian Dowling discovered that the PowerDNS authoritative name serverdoes not respond to DNS queries which contain certain characters,increasing the risk of successful DNS spoofing (CVE-2008-3337). Thisupdate changes PowerDNS to respond with SERVFAIL responses instead.For the stable distribution (etch), this problem has been fixed in version2.9.20-8+etch1.For the unstable distribution (sid), this problem has been fixed inversion 2.9.21.1-1.We recommend that you upgrade your pdns package."
      }
    ],
    "CVE-2008-3429": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1626",
        "title": "",
        "body": "Joan Calvet discovered that httrack, a utility to create local copies ofwebsites, is vulnerable to a buffer overflow potentially allowing toexecute arbitrary code when passed excessively long URLs.For the stable distribution (etch), this problem has been fixed inversion 3.40.4-3.1+etch1.For the testing (lenny) and unstable distribution (sid), this problem hasbeen fixed in version 3.42.3-1.We recommend that you upgrade your httrack package."
      }
    ],
    "CVE-2008-3443": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1695",
        "title": "",
        "body": "The regular expression engine of Ruby, a scripting language, contains amemory leak which can be triggered remotely under certain circumstances,leading to a denial of service condition (CVE-2008-3443).In addition, this security update addresses a regression in the REXMLXML parser of the ruby1.8 package; the regression was introduced inDSA-1651-1.For the stable distribution (etch), this problem has been fixed in version1.8.5-4etch4 of the ruby1.8 package, and version 1.9.0+20060609-1etch4of the ruby1.9 package.For the unstable distribution (sid), this problem has been fixed inversion 1.8.7.72-1 of the ruby1.8 package. The ruby1.9 package will befixed soon.We recommend that you upgrade your Ruby packages."
      }
    ],
    "CVE-2008-3457": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1641",
        "title": "",
        "body": "Cross site scripting through the setup script was possible in rare circumstances."
      }
    ],
    "CVE-2008-3525": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1655",
        "title": "",
        "body": "Eugene Teo reported a lack of capability checks in the kernel driver for Granch SBNI12 leased line adapters (sbni), allowing local users to perform privileged operations."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1653",
        "title": "",
        "body": "Eugene Teo reported a lack of capability checks in the kernel driver for Granch SBNI12 leased line adapters (sbni), allowing local users to perform privileged operations."
      }
    ],
    "CVE-2008-3526": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1636",
        "title": "",
        "body": "Eugene Teo reported a missing bounds check in the SCTP subsystem. By exploiting an integer overflow in the SCTP_AUTH_KEY handling code, remote attackers may be able to cause a denial of service in the form of a kernel panic."
      }
    ],
    "CVE-2008-3527": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1687",
        "title": "",
        "body": "Tavis Ormandy reported a local DoS and potential privilege escalation in the Virtual Dynamic Shared Objects (vDSO) implementation."
      }
    ],
    "CVE-2008-3528": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1687",
        "title": "",
        "body": "Eugene Teo reported a local DoS issue in the ext2 and ext3 filesystems. Local users who have been granted the privileges necessary to mount a filesystem would be able to craft a corrupted filesystem that causes the kernel to output error messages in an infinite loop."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1681",
        "title": "",
        "body": "Eugene Teo reported a local DoS issue in the ext2 and ext3 filesystems. Local users who have been granted the privileges necessary to mount a filesystem would be able to craft a corrupted filesystem that causes the kernel to output error messages in an infinite loop."
      }
    ],
    "CVE-2008-3529": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1654",
        "title": "",
        "body": "It was discovered that libxml2, the GNOME XML library, didn't correctlyhandle long entity names. This could allow the execution of arbitrarycode via a malicious XML file.For the stable distribution (etch), this problem has been fixed in version2.6.27.dfsg-5.For the unstable distribution (sid), this problem has been fixed inversion 2.6.32.dfsg-4.We recommend that you upgrade your libxml2 package."
      }
    ],
    "CVE-2008-3546": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1637",
        "title": "",
        "body": "Multiple vulnerabilities have been identified in git-core, the core ofthe git distributed revision control system. Improper path lengthlimitations in git's diff and grep functions, in combination withmaliciously crafted repositories or changes, could enable a stackbuffer overflow and potentially the execution of arbitrary code.The Common Vulnerabilities and Exposures project identifies thisvulnerability as CVE-2008-3546.For the stable distribution (etch), this problem has been fixed inversion 1.4.4.4-2.1+etch1.For the unstable distribution (sid), this problem has been fixed inversion 1.5.6.5-1.We recommend that you upgrade your git-core packages."
      }
    ],
    "CVE-2008-3639": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1656",
        "title": "",
        "body": "It was discovered that insufficient bounds checking in the SGI image filter may lead to the execution of arbitrary code."
      }
    ],
    "CVE-2008-3640": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1656",
        "title": "",
        "body": "It was discovered that an integer overflow in the Postscript conversion tool texttops may lead to the execution of arbitrary code."
      }
    ],
    "CVE-2008-3641": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1656",
        "title": "",
        "body": "It was discovered that insufficient bounds checking in the HPGL filter may lead to the execution of arbitrary code."
      }
    ],
    "CVE-2008-3655": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1651",
        "title": "",
        "body": "Keita Yamaguchi discovered that several safe level restrictions are insufficiently enforced."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1652",
        "title": "",
        "body": "Keita Yamaguchi discovered that several safe level restrictions are insufficiently enforced."
      }
    ],
    "CVE-2008-3656": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1652",
        "title": "",
        "body": "Christian Neukirchen discovered that the WebRick module uses inefficient algorithms for HTTP header splitting, resulting in denial of service through resource exhaustion."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1651",
        "title": "",
        "body": "Christian Neukirchen discovered that the WebRick module uses inefficient algorithms for HTTP header splitting, resulting in denial of service through resource exhaustion."
      }
    ],
    "CVE-2008-3657": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1652",
        "title": "",
        "body": "It was discovered that the dl module doesn't perform taintness checks."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1651",
        "title": "",
        "body": "It was discovered that the dl module doesn't perform taintness checks."
      }
    ],
    "CVE-2008-3658": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1647",
        "title": "",
        "body": "Buffer overflow in the imageloadfont function allows a denial of service or code execution through a crafted font file."
      }
    ],
    "CVE-2008-3659": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1647",
        "title": "",
        "body": "Buffer overflow in the memnstr function allows a denial of service or code execution via a crafted delimiter parameter to the explode function."
      }
    ],
    "CVE-2008-3660": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1647",
        "title": "",
        "body": "Denial of service is possible in the FastCGI module by a remote attacker by making a request with multiple dots before the extension."
      }
    ],
    "CVE-2008-3714": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1679",
        "title": "",
        "body": "Morgan Todd discovered a cross-site scripting vulnerability in awstats,a log file analyzer, involving the \"config\" request parameter (andpossibly others; CVE-2008-3714).For the stable distribution (etch), this problem has been fixed in version6.5+dfsg-1+etch1.The unstable (sid) and testing (lenny) distribution will be fixed soon.We recommend that you upgrade your awstats package."
      }
    ],
    "CVE-2008-3790": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1652",
        "title": "",
        "body": "Luka Treiber and Mitja Kolsek discovered that recursively nested XML entities can lead to denial of service through resource exhaustion in rexml."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1651",
        "title": "",
        "body": "Luka Treiber and Mitja Kolsek discovered that recursively nested XML entities can lead to denial of service through resource exhaustion in rexml."
      }
    ],
    "CVE-2008-3823": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1642",
        "title": "",
        "body": "Will Drewry discovered that Horde allows remote attackers to sendan email with a crafted MIME attachment filename attribute to performcross site scripting.For the stable distribution (etch), this problem has been fixed inversion 3.1.3-4etch4.For the testing distribution (lenny), this problem has been fixed inversion 3.2.1+debian0-2+lenny1.For the unstable distribution (sid), this problem will be fixed soon.We recommend that you upgrade your horde3 package."
      }
    ],
    "CVE-2008-3827": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1644",
        "title": "",
        "body": "Felipe Andres Manzano discovered that mplayer, a multimedia player, isvulnerable to several integer overflows in the Real video streamdemuxing code. These flaws could allow an attacker to cause a denialof service (a crash) or potentially execution of arbitrary code bysupplying a maliciously crafted video file.For the stable distribution (etch), these problems have been fixed inversion 1.0~rc1-12etch5.For the unstable distribution (sid), these problems have been fixed inversion 1.0~rc2-18.We recommend that you upgrade your mplayer packages."
      }
    ],
    "CVE-2008-3831": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1655",
        "title": "",
        "body": "Olaf Kirch discovered an issue with the i915 driver that may allow local users to cause memory corruption by use of an ioctl with insufficient privilege restrictions."
      }
    ],
    "CVE-2008-3833": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1653",
        "title": "",
        "body": "The S_ISUID/S_ISGID bits were not being cleared during an inode splice, which, under certain conditions, can be exploited by local users to obtain the privileges of a group for which they are not a member. Mark Fasheh reported this issue."
      }
    ],
    "CVE-2008-3834": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1658",
        "title": "",
        "body": "Colin Walters discovered that the dbus_signature_validate function indbus, a simple interprocess messaging system, is prone to a denial ofservice attack.For the stable distribution (etch), this problem has been fixed inversion 1.0.2-1+etch2.For the testing distribution (lenny) and unstable distribution (sid)this problem will be fixed soon.We recommend that you upgrade your dbus package."
      }
    ],
    "CVE-2008-3835": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1669",
        "title": "",
        "body": "\"moz_bug_r_a4\" discovered that the same-origin check in nsXMLDocument::OnChannelRedirect() could by bypassed."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "\"moz_bug_r_a4\" discovered that the same-origin check in nsXMLDocument::OnChannelRedirect() could be bypassed. (MFSA 2008-38)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "\"moz_bug_r_a4\" discovered that the same-origin check in nsXMLDocument::OnChannelRedirect() could be bypassed. (MFSA 2008-38)"
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1649",
        "title": "",
        "body": "moz_bug_r_a4 discovered that the same-origin check in nsXMLDocument::OnChannelRedirect() could by bypassed."
      }
    ],
    "CVE-2008-3836": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1669",
        "title": "",
        "body": "\"moz_bug_r_a4\" discovered that several vulnerabilities in feedWriter could lead to Chrome privilege escalation."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "\"moz_bug_r_a4\" discovered that several vulnerabilities in feedWriter could lead to Chrome privilege escalation. (MFSA 2008-39)"
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1649",
        "title": "",
        "body": "moz_bug_r_a4 discovered that several vulnerabilities in feedWriter could lead to Chrome privilege escalation."
      }
    ],
    "CVE-2008-3863": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1670",
        "title": "",
        "body": "Ulf Harnhammer discovered that a buffer overflow may lead to the execution of arbitrary code."
      }
    ],
    "CVE-2008-3903": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1952",
        "title": "",
        "body": "It is possible to determine a valid SIP username, when Digestauthentication and authalwaysreject are enabled (AST-2009-003)."
      }
    ],
    "CVE-2008-3905": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1652",
        "title": "",
        "body": "Tanaka Akira discovered that the resolv module uses sequential transaction IDs and a fixed source port for DNS queries, which makes it more vulnerable to DNS spoofing attacks."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1651",
        "title": "",
        "body": "Tanaka Akira discovered that the resolv module uses sequential transaction IDs and a fixed source port for DNS queries, which makes it more vulnerable to DNS spoofing attacks."
      }
    ],
    "CVE-2008-3909": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1640",
        "title": "",
        "body": "Simon Willison discovered that in Django, a Python web framework, thefeature to retain HTTP POST data during user reauthentication alloweda remote attacker to perform unauthorized modification of data throughcross site request forgery. This is possible regardless of the Djangoplugin to prevent cross site request forgery being enabled. The CommonVulnerabilities and Exposures project identifies this issue asCVE-2008-3909.In this update the affected feature is disabled; this is in accordancewith upstream's preferred solution for this situation.This update takes the opportunity to also include a relatively minordenial of service attack in the internationalisation framework, knownas CVE-2007-5712.For the stable distribution (etch), these problems have been fixed inversion 0.95.1-1etch2.For the unstable distribution (sid), these problems have been fixed inversion 1.0-1.We recommend that you upgrade your python-django package."
      }
    ],
    "CVE-2008-3912": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1660",
        "title": "",
        "body": "Several denial-of-service vulnerabilities have been discovered inthe ClamAV anti-virus toolkit:Insufficient checking for out-of-memory conditions results in nullpointer dereferences (CVE-2008-3912).Incorrect error handling logic leads to memory leaks (CVE-2008-3913)and file descriptor leaks (CVE-2008-3914).For the stable distribution (etch), these problems have been fixed inversion 0.90.1dfsg-4etch15.For the unstable distribution (sid) and the testing distribution(lenny), these problems have been fixed in version 0.94.dfsg-1.We recommend that you upgrade your clamav package."
      }
    ],
    "CVE-2008-3914": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1660",
        "title": "",
        "body": "Several denial-of-service vulnerabilities have been discovered inthe ClamAV anti-virus toolkit:Insufficient checking for out-of-memory conditions results in nullpointer dereferences (CVE-2008-3912).Incorrect error handling logic leads to memory leaks (CVE-2008-3913)and file descriptor leaks (CVE-2008-3914).For the stable distribution (etch), these problems have been fixed inversion 0.90.1dfsg-4etch15.For the unstable distribution (sid) and the testing distribution(lenny), these problems have been fixed in version 0.94.dfsg-1.We recommend that you upgrade your clamav package."
      }
    ],
    "CVE-2008-3915": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1636",
        "title": "",
        "body": "Johann Dahm and David Richter reported an issue in the nfsd subsystem that may allow remote attackers to cause a denial of service via a buffer overflow."
      }
    ],
    "CVE-2008-3933": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1673",
        "title": "",
        "body": "The zlib uncompression module is vulnerable to denial of service."
      }
    ],
    "CVE-2008-4058": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1669",
        "title": "",
        "body": "\"moz_bug_r_a4\" discovered a vulnerability which can result in Chrome privilege escalation through XPCNativeWrappers."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "\"moz_bug_r_a4\" discovered a vulnerability which can result in Chrome privilege escalation through XPCNativeWrappers. (MFSA 2008-41)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "\"moz_bug_r_a4\" discovered a vulnerability which can result in Chrome privilege escalation through XPCNativeWrappers. (MFSA 2008-41)"
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1649",
        "title": "",
        "body": "moz_bug_r_a4 discovered a vulnerability which can result in Chrome privilege escalation through XPCNativeWrappers."
      }
    ],
    "CVE-2008-4059": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1669",
        "title": "",
        "body": "\"moz_bug_r_a4\" discovered a vulnerability which can result in Chrome privilege escalation through XPCNativeWrappers."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "\"moz_bug_r_a4\" discovered a vulnerability which can result in Chrome privilege escalation through XPCNativeWrappers. (MFSA 2008-41)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "\"moz_bug_r_a4\" discovered a vulnerability which can result in Chrome privilege escalation through XPCNativeWrappers. (MFSA 2008-41)"
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1649",
        "title": "",
        "body": "moz_bug_r_a4 discovered a vulnerability which can result in Chrome privilege escalation through XPCNativeWrappers."
      }
    ],
    "CVE-2008-4060": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1669",
        "title": "",
        "body": "Olli Pettay and \"moz_bug_r_a4\" discovered a Chrome privilege escalation vulnerability in XSLT handling."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Olli Pettay and \"moz_bug_r_a4\" discovered a Chrome privilege escalation vulnerability in XSLT handling. (MFSA 2008-41)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "Olli Pettay and \"moz_bug_r_a4\" discovered a Chrome privilege escalation vulnerability in XSLT handling. (MFSA 2008-41)"
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1649",
        "title": "",
        "body": "Olli Pettay and moz_bug_r_a4 discovered a Chrome privilege escalation vulnerability in XSLT handling."
      }
    ],
    "CVE-2008-4061": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1669",
        "title": "",
        "body": "Jesse Ruderman discovered a crash in the layout engine, which might allow the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Jesse Ruderman discovered a crash in the layout engine, which might allow the execution of arbitrary code. (MFSA 2008-42)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "Jesse Ruderman discovered a crash in the layout engine, which might allow the execution of arbitrary code. (MFSA 2008-42)"
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1649",
        "title": "",
        "body": "Jesse Ruderman discovered a crash in the layout engine, which might allow the execution of arbitrary code."
      }
    ],
    "CVE-2008-4062": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1669",
        "title": "",
        "body": "Igor Bukanov, Philip Taylor, Georgi Guninski and Antoine Labour discovered crashes in the Javascript engine, which might allow the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Igor Bukanov, Philip Taylor, Georgi Guninski and Antoine Labour discovered crashes in the Javascript engine, which might allow the execution of arbitrary code. (MFSA 2008-42)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "Igor Bukanov, Philip Taylor, Georgi Guninski and Antoine Labour discovered crashes in the Javascript engine, which might allow the execution of arbitrary code. (MFSA 2008-42)"
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1649",
        "title": "",
        "body": "Igor Bukanov, Philip Taylor, Georgi Guninski and Antoine Labour discovered crashes in the Javascript engine, which might allow the execution of arbitrary code."
      }
    ],
    "CVE-2008-4065": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1669",
        "title": "",
        "body": "Dave Reed discovered that some Unicode byte order marks are stripped from Javascript code before execution, which can result in code being executed, which were otherwise part of a quoted string."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Dave Reed discovered that some Unicode byte order marks are stripped from Javascript code before execution, which can result in code being executed, which were otherwise part of a quoted string. (MFSA 2008-43)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "Dave Reed discovered that some Unicode byte order marks are stripped from Javascript code before execution, which can result in code being executed, which were otherwise part of a quoted string. (MFSA 2008-43)"
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1649",
        "title": "",
        "body": "Dave Reed discovered that some Unicode byte order marks are stripped from Javascript code before execution, which can result in code being executed, which were otherwise part of a quoted string."
      }
    ],
    "CVE-2008-4066": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1669",
        "title": "",
        "body": "Gareth Heyes discovered that some Unicode surrogate characters are ignored by the HTML parser."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1649",
        "title": "",
        "body": "Gareth Heyes discovered that some Unicode surrogate characters are ignored by the HTML parser."
      }
    ],
    "CVE-2008-4067": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1669",
        "title": "",
        "body": "Boris Zbarsky discovered that resource: URls allow directory traversal when using URL-encoded slashes."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Boris Zbarsky discovered that resource: URLs allow directory traversal when using URL-encoded slashes. (MFSA 2008-44)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "It was discovered that a directory traversal allows attackers to read arbitrary files via a certain character. (MFSA 2008-44)"
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1649",
        "title": "",
        "body": "Boris Zbarsky discovered that resource: URLs allow directory traversal when using URL-encoded slashes."
      }
    ],
    "CVE-2008-4068": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1669",
        "title": "",
        "body": "Georgi Guninski discovered that resource: URLs could bypass local access restrictions."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Georgi Guninski discovered that resource: URLs could bypass local access restrictions. (MFSA 2008-44)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "It was discovered that a directory traversal allows attackers to bypass security restrictions and obtain sensitive information. (MFSA 2008-44)"
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1649",
        "title": "",
        "body": "Georgi Guninski discovered that resource: URLs could bypass local access restrictions."
      }
    ],
    "CVE-2008-4069": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1669",
        "title": "",
        "body": "Billy Hoffman discovered that the XBM decoder could reveal uninitialised memory."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Billy Hoffman discovered that the XBM decoder could reveal uninitialised memory. (MFSA 2008-45)"
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1649",
        "title": "",
        "body": "Billy Hoffman discovered that the XBM decoder could reveal uninitialised memory."
      }
    ],
    "CVE-2008-4070": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "It was discovered that a buffer overflow could be triggered via a long header in a news article, which could lead to arbitrary code execution. (MFSA 2008-46)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "It was discovered that a buffer overflow could be triggered via a long header in a news article, which could lead to arbitrary code execution. (MFSA 2008-46)"
      }
    ],
    "CVE-2008-4096": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1641",
        "title": "",
        "body": "Remote authenticated users could execute arbitrary code on the host running phpMyAdmin through manipulation of a script parameter."
      }
    ],
    "CVE-2008-4106": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1871",
        "title": "",
        "body": "It was discovered that wordpress lacks certain checks around userinformation, which could be used by attackers to change the password ofa user."
      }
    ],
    "CVE-2008-4109": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1638",
        "title": "",
        "body": "It has been discovered that the signal handler implementing the logintimeout in Debian's version of the OpenSSH server uses functions whichare not async-signal-safe, leading to a denial of servicevulnerability (CVE-2008-4109).The problem was originally corrected in OpenSSH 4.4p1 (CVE-2006-5051),but the patch backported to the version released with etch wasincorrect.Systems affected by this issue suffer from lots of zombie sshdprocesses. Processes stuck with a \"[net]\" process title have also beenobserved. Over time, a sufficient number of processes may accumulatesuch that further login attempts are impossible. Presence of theseprocesses does not indicate active exploitation of this vulnerability.It is possible to trigger this denial of service condition by accident.For the stable distribution (etch), this problem has been fixed inversion 4.3p2-9etch3.For the unstable distribution (sid) and the testing distribution(lenny), this problem has been fixed in version 4.6p1-1.We recommend that you upgrade your openssh packages."
      }
    ],
    "CVE-2008-4113": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1655",
        "title": "",
        "body": "Eugene Teo discovered two issues in the SCTP subsystem which allow local users to obtain access to sensitive memory when the SCTP-AUTH extension is enabled."
      }
    ],
    "CVE-2008-4182": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1770",
        "title": "",
        "body": "It was discovered that imp4 suffers from a cross-site scripting (XSS)attack via the user field in an IMAP session, which allows attackers toinject arbitrary HTML code."
      }
    ],
    "CVE-2008-4210": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1653",
        "title": "",
        "body": "David Watson reported an issue in the open()/creat() system calls which, under certain conditions, can be exploited by local users to obtain the privileges of a group for which they are not a member."
      }
    ],
    "CVE-2008-4225": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1666",
        "title": "",
        "body": "Drew Yao discovered that missing input sanitising in the xmlBufferResize() function may lead to an infinite loop, resulting in denial of service."
      }
    ],
    "CVE-2008-4226": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1666",
        "title": "",
        "body": "Drew Yao discovered that an integer overflow in the xmlSAX2Characters() function may lead to denial of service or the execution of arbitrary code."
      }
    ],
    "CVE-2008-4242": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1689",
        "title": "",
        "body": "Maksymilian Arciemowicz of securityreason.com reported that ProFTPD isvulnerable to cross-site request forgery (CSRF) attacks and executesarbitrary FTP commands via a long ftp:// URI that leverages anexisting session from the FTP client implementation in a web browser.For the stable distribution (etch) this problem has been fixed inversion 1.3.0-19etch2 and in version 1.3.1-15~bpo40+1 for backports.For the testing (lenny) and unstable (sid) distributions this problemhas been fixed in version 1.3.1-15.We recommend that you upgrade your proftpd-dfsg package."
      }
    ],
    "CVE-2008-4298": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1645",
        "title": "",
        "body": "A memory leak in the http_request_parse function could be used by remote attackers to cause lighttpd to consume memory, and cause a denial of service attack."
      }
    ],
    "CVE-2008-4302": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1653",
        "title": "",
        "body": "A coding error in the splice subsystem allows local users to attempt to unlock a page structure that has not been locked, resulting in a system crash."
      }
    ],
    "CVE-2008-4306": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1670",
        "title": "",
        "body": "Kees Cook and Tomas Hoger discovered that several buffer overflows may lead to the execution of arbitrary code."
      }
    ],
    "CVE-2008-4309": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1663",
        "title": "",
        "body": "It was reported that an integer overflow in the netsnmp_create_subtree_cache function in agent/snmp_agent.c allows remote attackers to cause a denial of service attack via a crafted SNMP GETBULK request."
      }
    ],
    "CVE-2008-4316": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1747",
        "title": "",
        "body": "Diego Pettenò discovered that glib2.0, the GLib library of C routines,handles large strings insecurely via its Base64 encoding functions. Thiscould possible lead to the execution of arbitrary code.For the stable distribution (lenny), this problem has been fixed inversion 2.16.6-1+lenny1.For the oldstable distribution (etch), this problem has been fixed inversion 2.12.4-2+etch1.For the testing distribution (squeeze), this problem will be fixed soon.For the unstable distribution (sid), this problem has been fixed inversion 2.20.0-1.We recommend that you upgrade your glib2.0 packages."
      }
    ],
    "CVE-2008-4326": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1675",
        "title": "",
        "body": "Masako Oono discovered that phpMyAdmin, a web-based administrationinterface for MySQL, insufficiently sanitises input allowing aremote attacker to gather sensitive data through cross site scripting,provided that the user uses the Internet Explorer web browser.This update also fixes a regression introduced in DSA 1641, thatbroke changing of the language and encoding in the login screen.For the stable distribution (etch), these problems have been fixed inversion 4:2.9.1.1-9.For the unstable distribution (sid), these problems have been fixed inversion 4:2.11.8.1-3.We recommend that you upgrade your phpmyadmin package."
      }
    ],
    "CVE-2008-4359": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1645",
        "title": "",
        "body": "Inconsistant handling of URL patterns could lead to the disclosure of resources a server administrator did not anticipate when using rewritten URLs."
      }
    ],
    "CVE-2008-4360": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1645",
        "title": "",
        "body": "Upon filesystems which don't handle case-insensitive paths differently it might be possible that unanticipated resources could be made available by mod_userdir."
      }
    ],
    "CVE-2008-4445": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1655",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2008-4456": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1783",
        "title": "",
        "body": "Thomas Henlich reported that the MySQL commandline client application did not encode HTML special characters when run in HTML output mode (that is, \"mysql --html ...\"). This could potentially lead to cross-site scripting or unintended script privilege escalation if the resulting output is viewed in a browser or incorporated into a web site."
      }
    ],
    "CVE-2008-4539": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1799",
        "title": "",
        "body": "A buffer overflow has been found in the emulation of the Cirrus graphics adaptor."
      }
    ],
    "CVE-2008-4554": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1687",
        "title": "",
        "body": "Milos Szeredi reported that the usage of splice() on files opened with O_APPEND allows users to write to the file at arbitrary offsets, enabling a bypass of possible assumed semantics of the O_APPEND flag."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1681",
        "title": "",
        "body": "Milos Szeredi reported that the usage of splice() on files opened with O_APPEND allows users to write to the file at arbitrary offsets, enabling a bypass of possible assumed semantics of the O_APPEND flag."
      }
    ],
    "CVE-2008-4576": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1687",
        "title": "",
        "body": "Vlad Yasevich reported an issue in the SCTP subsystem that may allow remote users to cause a local DoS by triggering a kernel oops."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1681",
        "title": "",
        "body": "Vlad Yasevich reported an issue in the SCTP subsystem that may allow remote users to cause a local DoS by triggering a kernel oops."
      }
    ],
    "CVE-2008-4582": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1669",
        "title": "",
        "body": "Liu Die Yu discovered an information leak through local shortcut files."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1671",
        "title": "",
        "body": "Liu Die Yu discovered an information leak through local shortcut files."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Liu Die Yu discovered an information leak through local shortcut files. (MFSA 2008-59)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "Liu Die Yu and Boris Zbarsky discovered an information leak through local shortcut files. (MFSA 2008-47, MFSA 2008-59)"
      }
    ],
    "CVE-2008-4618": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1681",
        "title": "",
        "body": "Wei Yongjun reported an issue in the SCTP subsystem that may allow remote users to cause a local DoS by triggering a kernel panic."
      }
    ],
    "CVE-2008-4683": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1673",
        "title": "",
        "body": "The Bluetooth ACL dissector is vulnerable to denial of service."
      }
    ],
    "CVE-2008-4684": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1673",
        "title": "",
        "body": "The PRP and MATE dissectors are vulnerable to denial of service."
      }
    ],
    "CVE-2008-4685": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1673",
        "title": "",
        "body": "The Q931 dissector is vulnerable to denial of service."
      }
    ],
    "CVE-2008-4769": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1871",
        "title": "",
        "body": "It was discovered that the get_category_template function is prone to adirectory traversal vulnerability, which could lead to the execution ofarbitrary code."
      }
    ],
    "CVE-2008-4776": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1664",
        "title": "",
        "body": "It was discovered that ekg, a console Gadu Gadu client performsinsufficient input sanitising in the code to parse contact descriptions,which may result in denial of service.For the stable distribution (etch), this problem has been fixed inversion 1:1.7~rc2-1etch2.For the unstable distribution (sid) and the upcoming stable distribution(lenny), this problem has been fixed in version 1:1.8~rc1-2 of libgadu.We recommend that you upgrade your ekg package."
      }
    ],
    "CVE-2008-4796": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1691",
        "title": "",
        "body": "Several remote vulnerabilities have been discovered in Moodle, an onlinecourse management system. The following issues are addressed in thisupdate, ranging from cross site scripting to remote code execution.Various cross site scripting issues in the Moodle codebase(CVE-2008-3326, CVE-2008-3325, CVE-2007-3555, CVE-2008-5432,MSA-08-0021, MDL-8849, MDL-12793, MDL-11414, MDL-14806,MDL-10276).Various cross site request forgery issues in the Moodle codebase(CVE-2008-3325, MSA-08-0023).Privilege escalation bugs in the Moodle codebase (MSA-08-0001, MDL-7755).SQL injection issue in the hotpot module (MSA-08-0010).An embedded copy of Smarty had several vulnerabilities(CVE-2008-4811, CVE-2008-4810).An embedded copy of Snoopy was vulnerable to cross site scripting(CVE-2008-4796).An embedded copy of Kses was vulnerable to cross site scripting(CVE-2008-1502).For the stable distribution (etch), these problems have been fixed inversion 1.6.3-2+etch1.For the unstable distribution (sid), these problems have been fixed inversion 1.8.2.dfsg-2.We recommend that you upgrade your moodle (1.6.3-2+etch1) package."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1871",
        "title": "",
        "body": "It was discovered that the _httpsrequest function in the embedded snoopyversion is prone to the execution of arbitrary commands via shellmetacharacters in https URLs."
      }
    ],
    "CVE-2008-4810": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1691",
        "title": "",
        "body": "Several remote vulnerabilities have been discovered in Moodle, an onlinecourse management system. The following issues are addressed in thisupdate, ranging from cross site scripting to remote code execution.Various cross site scripting issues in the Moodle codebase(CVE-2008-3326, CVE-2008-3325, CVE-2007-3555, CVE-2008-5432,MSA-08-0021, MDL-8849, MDL-12793, MDL-11414, MDL-14806,MDL-10276).Various cross site request forgery issues in the Moodle codebase(CVE-2008-3325, MSA-08-0023).Privilege escalation bugs in the Moodle codebase (MSA-08-0001, MDL-7755).SQL injection issue in the hotpot module (MSA-08-0010).An embedded copy of Smarty had several vulnerabilities(CVE-2008-4811, CVE-2008-4810).An embedded copy of Snoopy was vulnerable to cross site scripting(CVE-2008-4796).An embedded copy of Kses was vulnerable to cross site scripting(CVE-2008-1502).For the stable distribution (etch), these problems have been fixed inversion 1.6.3-2+etch1.For the unstable distribution (sid), these problems have been fixed inversion 1.8.2.dfsg-2.We recommend that you upgrade your moodle (1.6.3-2+etch1) package."
      }
    ],
    "CVE-2008-4811": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1691",
        "title": "",
        "body": "Several remote vulnerabilities have been discovered in Moodle, an onlinecourse management system. The following issues are addressed in thisupdate, ranging from cross site scripting to remote code execution.Various cross site scripting issues in the Moodle codebase(CVE-2008-3326, CVE-2008-3325, CVE-2007-3555, CVE-2008-5432,MSA-08-0021, MDL-8849, MDL-12793, MDL-11414, MDL-14806,MDL-10276).Various cross site request forgery issues in the Moodle codebase(CVE-2008-3325, MSA-08-0023).Privilege escalation bugs in the Moodle codebase (MSA-08-0001, MDL-7755).SQL injection issue in the hotpot module (MSA-08-0010).An embedded copy of Smarty had several vulnerabilities(CVE-2008-4811, CVE-2008-4810).An embedded copy of Snoopy was vulnerable to cross site scripting(CVE-2008-4796).An embedded copy of Kses was vulnerable to cross site scripting(CVE-2008-1502).For the stable distribution (etch), these problems have been fixed inversion 1.6.3-2+etch1.For the unstable distribution (sid), these problems have been fixed inversion 1.8.2.dfsg-2.We recommend that you upgrade your moodle (1.6.3-2+etch1) package."
      }
    ],
    "CVE-2008-4829": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1683",
        "title": "",
        "body": "Multiple buffer overflows involving HTTP header and playlist parsinghave been discovered in streamripper (CVE-2007-4337, CVE-2008-4829).For the stable distribution (etch), these problems have been fixed inversion 1.61.27-1+etch1.For the unstable distribution (sid) and the testing distribution(lenny), these problems have been fixed in version 1.63.5-2.We recommend that you upgrade your streamripper package."
      }
    ],
    "CVE-2008-4866": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1782",
        "title": "",
        "body": "It was discovered that multiple buffer overflows could lead to theexecution of arbitrary code."
      }
    ],
    "CVE-2008-4933": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1687",
        "title": "",
        "body": "Eric Sesterhenn reported a local DoS issue in the hfsplus filesystem. Local users who have been granted the privileges necessary to mount a filesystem would be able to craft a corrupted filesystem that causes the kernel to overrun a buffer, resulting in a system oops or memory corruption."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1681",
        "title": "",
        "body": "Eric Sesterhenn reported a local DoS issue in the hfsplus filesystem. Local users who have been granted the privileges necessary to mount a filesystem would be able to craft a corrupted filesystem that causes the kernel to overrun a buffer, resulting in a system oops or memory corruption."
      }
    ],
    "CVE-2008-4934": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1687",
        "title": "",
        "body": "Eric Sesterhenn reported a local DoS issue in the hfsplus filesystem. Local users who have been granted the privileges necessary to mount a filesystem would be able to craft a corrupted filesystem that results in a kernel oops due to an unchecked return value."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1681",
        "title": "",
        "body": "Eric Sesterhenn reported a local DoS issue in the hfsplus filesystem. Local users who have been granted the privileges necessary to mount a filesystem would be able to craft a corrupted filesystem that results in a kernel oops due to an unchecked return value."
      }
    ],
    "CVE-2008-5005": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1685",
        "title": "",
        "body": "Two vulnerabilities have been found in uw-imap, an IMAPimplementation. The Common Vulnerabilities and Exposures projectidentifies the following problems:It was discovered that several buffer overflows can be triggered via along folder extension argument to the tmail or dmail program. Thiscould lead to arbitrary code execution (CVE-2008-5005).It was discovered that a NULL pointer dereference could be triggered bya malicious response to the QUIT command leading to a denial of service(CVE-2008-5006).For the stable distribution (etch), these problems have been fixed inversion 2002edebian1-13.1+etch1.For the unstable distribution (sid) and the testing distribution(lenny), these problems have been fixed in version 2007d~dfsg-1.We recommend that you upgrade your uw-imap packages."
      }
    ],
    "CVE-2008-5006": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1685",
        "title": "",
        "body": "Two vulnerabilities have been found in uw-imap, an IMAPimplementation. The Common Vulnerabilities and Exposures projectidentifies the following problems:It was discovered that several buffer overflows can be triggered via along folder extension argument to the tmail or dmail program. Thiscould lead to arbitrary code execution (CVE-2008-5005).It was discovered that a NULL pointer dereference could be triggered bya malicious response to the QUIT command leading to a denial of service(CVE-2008-5006).For the stable distribution (etch), these problems have been fixed inversion 2002edebian1-13.1+etch1.For the unstable distribution (sid) and the testing distribution(lenny), these problems have been fixed in version 2007d~dfsg-1.We recommend that you upgrade your uw-imap packages."
      }
    ],
    "CVE-2008-5012": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1669",
        "title": "",
        "body": "Georgi Guninski, Michal Zalewski and Chris Evan discovered that the canvas element could be used to bypass same-origin restrictions."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1671",
        "title": "",
        "body": "Georgi Guninski, Michal Zalewski and Chris Evan discovered that the canvas element could be used to bypass same-origin restrictions."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Georgi Guninski, Michal Zalewski and Chris Evan discovered that the canvas element could be used to bypass same-origin restrictions. (MFSA 2008-48)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "Georgi Guninski, Michal Zalewski and Chris Evan discovered that the canvas element could be used to bypass same-origin restrictions. (MFSA 2008-48)"
      }
    ],
    "CVE-2008-5013": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1669",
        "title": "",
        "body": "It was discovered that insufficient checks in the Flash plugin glue code could lead to arbitrary code execution."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1671",
        "title": "",
        "body": "It was discovered that insufficient checks in the Flash plugin glue code could lead to arbitrary code execution."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "It was discovered that insufficient checks in the Flash plugin glue code could lead to arbitrary code execution. (MFSA 2008-49)"
      }
    ],
    "CVE-2008-5014": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1669",
        "title": "",
        "body": "Jesse Ruderman discovered that a programming error in the window.__proto__.__proto__ object could lead to arbitrary code execution."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1671",
        "title": "",
        "body": "Jesse Ruderman discovered that a programming error in the window.__proto__.__proto__ object could lead to arbitrary code execution."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Jesse Ruderman discovered that a programming error in the window.__proto__.__proto__ object could lead to arbitrary code execution. (MFSA 2008-50)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "Jesse Ruderman discovered that a programming error in the window.__proto__.__proto__ object could lead to arbitrary code execution. (MFSA 2008-50)"
      }
    ],
    "CVE-2008-5017": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1669",
        "title": "",
        "body": "It was discovered that crashes in the layout engine could lead to arbitrary code execution."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1671",
        "title": "",
        "body": "It was discovered that crashes in the layout engine could lead to arbitrary code execution."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "It was discovered that crashes in the layout engine could lead to arbitrary code execution. (MFSA 2008-52)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "It was discovered that crashes in the layout engine could lead to arbitrary code execution. (MFSA 2008-52)"
      }
    ],
    "CVE-2008-5018": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1669",
        "title": "",
        "body": "It was discovered that crashes in the Javascript engine could lead to arbitrary code execution."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1671",
        "title": "",
        "body": "It was discovered that crashes in the Javascript engine could lead to arbitrary code execution."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "It was discovered that crashes in the Javascript engine could lead to arbitrary code execution. (MFSA 2008-52)"
      }
    ],
    "CVE-2008-5021": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1669",
        "title": "",
        "body": "It was discovered that a crash in the nsFrameManager might lead to the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1671",
        "title": "",
        "body": "It was discovered that a crash in the nsFrameManager might lead to the execution of arbitrary code."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "It was discovered that a crash in the nsFrameManager might lead to the execution of arbitrary code. (MFSA 2008-55)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "It was discovered that a crash in the nsFrameManager might lead to the execution of arbitrary code. (MFSA 2008-55)"
      }
    ],
    "CVE-2008-5022": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1669",
        "title": "",
        "body": "\"moz_bug_r_a4\" discovered that the same-origin check in nsXMLHttpRequest::NotifyEventListeners() could be bypassed."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1671",
        "title": "",
        "body": "moz_bug_r_a4 discovered that the same-origin check in nsXMLHttpRequest::NotifyEventListeners() could be bypassed."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "\"moz_bug_r_a4\" discovered that the same-origin check in nsXMLHttpRequest::NotifyEventListeners() could be bypassed. (MFSA 2008-56)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "\"moz_bug_r_a4\" discovered that the same-origin check in nsXMLHttpRequest::NotifyEventListeners() could be bypassed. (MFSA 2008-56)"
      }
    ],
    "CVE-2008-5023": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1669",
        "title": "",
        "body": "Collin Jackson discovered that the -moz-binding property bypasses security checks on codebase principals."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1671",
        "title": "",
        "body": "Collin Jackson discovered that the -moz-binding property bypasses security checks on codebase principals."
      }
    ],
    "CVE-2008-5025": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1687",
        "title": "",
        "body": "Eric Sesterhenn reported a local DoS issue in the hfs filesystem. Local users who have been granted the privileges necessary to mount a filesystem would be able to craft a filesystem with a corrupted catalog name length, resulting in a system oops or memory corruption."
      },
      {
        "url": "http://www.debian.org/security/2008/dsa-1681",
        "title": "",
        "body": "Eric Sesterhenn reported a local DoS issue in the hfs filesystem. Local users who have been granted the privileges necessary to mount a filesystem would be able to craft a filesystem with a corrupted catalog name length, resulting in a system oops or memory corruption."
      }
    ],
    "CVE-2008-5030": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1665",
        "title": "",
        "body": "It was discovered that a heap overflow in the CDDB retrieval code oflibcdaudio, a library for controlling a CD-ROM when playing audio CDs,may result in the execution of arbitrary code.For the stable distribution (etch), this problem has been fixed inversion 0.99.12p2-2+etch1. A package for hppa will be provided later.For the upcoming stable distribution (lenny) and the unstabledistribution (sid), this problem has been fixed in version 0.99.12p2-7.We recommend that you upgrade your libcdaudio packages."
      }
    ],
    "CVE-2008-5050": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1680",
        "title": "",
        "body": "Moritz Jodeit discovered that ClamAV, an anti-virus solution, suffersfrom an off-by-one-error in its VBA project file processing, leading toa heap-based buffer overflow and potentially arbitrary code execution(CVE-2008-5050).Ilja van Sprundel discovered that ClamAV contains a denial of servicecondition in its JPEG file processing because it does not limit therecursion depth when processing JPEG thumbnails (CVE-2008-5314).For the stable distribution (etch), these problems have been fixed inversion 0.90.1dfsg-4etch16.For the unstable distribution (sid), these problems have been fixed inversion 0.94.dfsg.2-1.The testing distribution (lenny) will be fixed soon.We recommend that you upgrade your clamav packages."
      }
    ],
    "CVE-2008-5079": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1787",
        "title": "",
        "body": "Hugo Dias reported a DoS condition in the ATM subsystem that can be triggered by a local user by calling the svc_listen function twice on the same socket and reading /proc/net/atm/*vc."
      }
    ],
    "CVE-2008-5081": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1690",
        "title": "",
        "body": "Two denial of service conditions were discovered in avahi, a MulticastDNS implementation.Huge Dias discovered that the avahi daemon aborts with an assert errorif it encounters a UDP packet with source port 0 (CVE-2008-5081).It was discovered that the avahi daemon aborts with an assert error ifit receives an empty TXT record over D-Bus (CVE-2007-3372).For the stable distribution (etch), these problems have been fixed inversion 0.6.16-3etch2.For the unstable distribution (sid), these problems have been fixed inversion 0.6.23-3.We recommend that you upgrade your avahi packages."
      }
    ],
    "CVE-2008-5113": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1871",
        "title": "",
        "body": "It was discovered that wordpress relies on the REQUEST superglobal arrayin certain dangerous situations, which makes it easier to performattacks via crafted cookies."
      }
    ],
    "CVE-2008-5134": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1681",
        "title": "",
        "body": "Johannes Berg reported a remote DoS issue in the libertas wireless driver, which can be triggered by a specially crafted beacon/probe response."
      }
    ],
    "CVE-2008-5183": [
      {
        "url": "http://www.debian.org/security/2011/dsa-2176",
        "title": "",
        "body": "A null pointer dereference in RSS job completion notifications could lead to denial of service."
      }
    ],
    "CVE-2008-5187": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1672",
        "title": "",
        "body": "Julien Danjou and Peter De Wachter discovered that a buffer overflowin the XPM loader of Imlib2, a powerful image loading and renderinglibrary, might lead to arbitrary code execution.For the stable distribution (etch), this problem has been fixed inversion 1.3.0.0debian1-4+etch2.For the upcoming stable distribution (lenny) and the unstabledistribution (sid), this problem has been fixed in version 1.4.0-1.2.We recommend that you upgrade your imlib2 packages."
      }
    ],
    "CVE-2008-5249": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1901",
        "title": "",
        "body": "David Remahl discovered that mediawiki1.7 is prone to a cross-site scripting attack."
      }
    ],
    "CVE-2008-5250": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1901",
        "title": "",
        "body": "David Remahl discovered that mediawiki1.7, when Internet Explorer is used anduploads are enabled, or an SVG scripting browser is used and SVG uploads areenabled, allows remote authenticated users to inject arbitrary web script orHTML by editing a wiki page."
      }
    ],
    "CVE-2008-5252": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1901",
        "title": "",
        "body": "David Remahl discovered that mediawiki1.7 is prone to a cross-site requestforgery vulnerability in the Special:Import feature."
      }
    ],
    "CVE-2008-5262": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1717",
        "title": "",
        "body": "Stefan Cornelius discovered a buffer overflow in devil, a cross-platformimage loading and manipulation toolkit, which could be triggered via acrafted Radiance RGBE file. This could potentially lead to the executionof arbitrary code.For the stable distribution (etch), this problem has been fixed inversion 1.6.7-5+etch1.For the testing distribution (lenny), this problem has been fixed inversion 1.6.8-rc2-3+lenny1.For the unstable distribution (sid), this problem has been fixed inversion 1.7.5-4.We recommend that you upgrade your devil package."
      }
    ],
    "CVE-2008-5286": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1677",
        "title": "",
        "body": "An integer overflow has been discovered in the image validation codeof cupsys, the Common UNIX Printing System. An attacker could triggerthis bug by supplying a malicious graphic that could lead to theexecution of arbitrary code.For the stable distribution (etch) this problem has been fixed inversion 1.2.7-4etch6.For testing distribution (lenny) this issue will be fixed soon.For the unstable distribution (sid) this problem has been fixed inversion 1.3.8-1lenny4.We recommend that you upgrade your cupsys packages."
      }
    ],
    "CVE-2008-5297": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1686",
        "title": "",
        "body": "A buffer overflow has been discovered in the HTTP parser of the No-IP.comDynamic DNS update client, which may result in the execution of arbitrarycode.For the stable distribution (etch), this problem has been fixed inversion 2.1.1-4+etch1.For the upcoming stable distribution (lenny) and the unstable distribution(sid), this problem has been fixed in version 2.1.7-11.We recommend that you upgrade your no-ip package."
      }
    ],
    "CVE-2008-5300": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1681",
        "title": "",
        "body": "Dann Frazier reported a DoS condition that allows local users to cause the out of memory handler to kill off privileged processes or trigger soft lockups due to a starvation issue in the unix socket subsystem."
      }
    ],
    "CVE-2008-5314": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1680",
        "title": "",
        "body": "Moritz Jodeit discovered that ClamAV, an anti-virus solution, suffersfrom an off-by-one-error in its VBA project file processing, leading toa heap-based buffer overflow and potentially arbitrary code execution(CVE-2008-5050).Ilja van Sprundel discovered that ClamAV contains a denial of servicecondition in its JPEG file processing because it does not limit therecursion depth when processing JPEG thumbnails (CVE-2008-5314).For the stable distribution (etch), these problems have been fixed inversion 0.90.1dfsg-4etch16.For the unstable distribution (sid), these problems have been fixed inversion 0.94.dfsg.2-1.The testing distribution (lenny) will be fixed soon.We recommend that you upgrade your clamav packages."
      }
    ],
    "CVE-2008-5316": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1684",
        "title": "",
        "body": "Inadequate enforcement of fixed-length buffer limits allows an attacker to overflow a buffer on the stack, potentially enabling the execution of arbitrary code when a maliciously-crafted image is opened."
      }
    ],
    "CVE-2008-5317": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1684",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2008-5395": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1787",
        "title": "",
        "body": "Helge Deller discovered a denial of service condition that allows local users on PA-RISC systems to crash a system by attempting to unwind a stack containing userspace addresses."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1794",
        "title": "",
        "body": "Helge Deller discovered a denial of service condition that allows local users on PA-RISC to crash the system by attempting to unwind a stack containing userspace addresses."
      }
    ],
    "CVE-2008-5432": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1691",
        "title": "",
        "body": "Several remote vulnerabilities have been discovered in Moodle, an onlinecourse management system. The following issues are addressed in thisupdate, ranging from cross site scripting to remote code execution.Various cross site scripting issues in the Moodle codebase(CVE-2008-3326, CVE-2008-3325, CVE-2007-3555, CVE-2008-5432,MSA-08-0021, MDL-8849, MDL-12793, MDL-11414, MDL-14806,MDL-10276).Various cross site request forgery issues in the Moodle codebase(CVE-2008-3325, MSA-08-0023).Privilege escalation bugs in the Moodle codebase (MSA-08-0001, MDL-7755).SQL injection issue in the hotpot module (MSA-08-0010).An embedded copy of Smarty had several vulnerabilities(CVE-2008-4811, CVE-2008-4810).An embedded copy of Snoopy was vulnerable to cross site scripting(CVE-2008-4796).An embedded copy of Kses was vulnerable to cross site scripting(CVE-2008-1502).For the stable distribution (etch), these problems have been fixed inversion 1.6.3-2+etch1.For the unstable distribution (sid), these problems have been fixed inversion 1.8.2.dfsg-2.We recommend that you upgrade your moodle (1.6.3-2+etch1) package."
      }
    ],
    "CVE-2008-5500": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Jesse Ruderman discovered that the layout engine is vulnerable to DoS attacks that might trigger memory corruption and an integer overflow. (MFSA 2008-60)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1704",
        "title": "",
        "body": "Jesse Ruderman discovered that the layout engine is vulnerable to DoS attacks that might trigger memory corruption and an integer overflow. (MFSA 2008-60)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1707",
        "title": "",
        "body": "Jesse Ruderman discovered that the layout engine is vulnerable to DoS attacks that might trigger memory corruption and an integer overflow. (MFSA 2008-60)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "Jesse Ruderman discovered that the layout engine is vulnerable to DoS attacks that might trigger memory corruption and an integer overflow. (MFSA 2008-60)"
      }
    ],
    "CVE-2008-5504": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1707",
        "title": "",
        "body": "It was discovered that attackers could run arbitrary JavaScript with chrome privileges via vectors related to the feed preview. (MFSA 2008-62)"
      }
    ],
    "CVE-2008-5506": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Marius Schilder discovered that it is possible to obtain sensible data via a XMLHttpRequest. (MFSA 2008-64)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1704",
        "title": "",
        "body": "Marius Schilder discovered that it is possible to obtain sensible data via a XMLHttpRequest. (MFSA 2008-64)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1707",
        "title": "",
        "body": "Marius Schilder discovered that it is possible to obtain sensible data via a XMLHttpRequest. (MFSA 2008-64)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "Marius Schilder discovered that it is possible to obtain sensible data via a XMLHttpRequest. (MFSA 2008-64)"
      }
    ],
    "CVE-2008-5507": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Chris Evans discovered that it is possible to obtain sensible data via a JavaScript URL. (MFSA 2008-65)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1704",
        "title": "",
        "body": "Chris Evans discovered that it is possible to obtain sensible data via a JavaScript URL. (MFSA 2008-65)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1707",
        "title": "",
        "body": "Chris Evans discovered that it is possible to obtain sensible data via a JavaScript URL. (MFSA 2008-65)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "Chris Evans discovered that it is possible to obtain sensible data via a JavaScript URL. (MFSA 2008-65)"
      }
    ],
    "CVE-2008-5508": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "Chip Salzenberg discovered possible phishing attacks via URLs with leading whitespaces or control characters. (MFSA 2008-66)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1707",
        "title": "",
        "body": "Chip Salzenberg discovered possible phishing attacks via URLs with leading whitespaces or control characters. (MFSA 2008-66)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1704",
        "title": "",
        "body": "Chip Salzenberg discovered possible phishing attacks via URLs with leading whitespaces or control characters. (MFSA 2008-66)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "Chip Salzenberg discovered possible phishing attacks via URLs with leading whitespaces or control characters. (MFSA 2008-66)"
      }
    ],
    "CVE-2008-5511": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "It was discovered that it is possible to perform cross-site scripting attacks via an XBL binding to an \"unloaded document.\" (MFSA 2008-68)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1704",
        "title": "",
        "body": "It was discovered that it is possible to perform cross-site scripting attacks via an XBL binding to an \"unloaded document.\" (MFSA 2008-68)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1707",
        "title": "",
        "body": "It was discovered that it is possible to perform cross-site scripting attacks via an XBL binding to an \"unloaded document.\" (MFSA 2008-68)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "It was discovered that it is possible to perform cross-site scripting attacks via an XBL binding to an \"unloaded document.\" (MFSA 2008-68)"
      }
    ],
    "CVE-2008-5512": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1697",
        "title": "",
        "body": "It was discovered that it is possible to run arbitrary JavaScript with chrome privileges via unknown vectors. (MFSA 2008-68)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1704",
        "title": "",
        "body": "It was discovered that it is possible to run arbitrary JavaScript with chrome privileges via unknown vectors. (MFSA 2008-68)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1707",
        "title": "",
        "body": "It was discovered that it is possible to run arbitrary JavaScript with chrome privileges via unknown vectors. (MFSA 2008-68)"
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1696",
        "title": "",
        "body": "It was discovered that it is possible to run arbitrary JavaScript with chrome privileges via unknown vectors. (MFSA 2008-68)"
      }
    ],
    "CVE-2008-5513": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1707",
        "title": "",
        "body": "moz_bug_r_a4 discovered that the session-restore feature does not properly sanitise input leading to arbitrary injections. This issue could be used to perform an XSS attack or run arbitrary JavaScript with chrome privileges. (MFSA 2008-69)"
      }
    ],
    "CVE-2008-5515": [
      {
        "url": "http://www.debian.org/security/2011/dsa-2207",
        "title": "",
        "body": "Various vulnerabilities have been discovered in the Tomcat Servlet andJSP engine, resulting in denial of service, cross-site scripting,information disclosure and WAR file traversal. Further details on theindividual security issues can be found on the ApacheTomcat 5 vulnerabilities page.For the oldstable distribution (lenny), this problem has been fixed inversion 5.5.26-5lenny2.The stable distribution (squeeze) no longer contains tomcat5.5. tomcat6is already fixed.The unstable distribution (sid) no longer contains tomcat5.5. tomcat6is already fixed.We recommend that you upgrade your tomcat5.5 packages."
      }
    ],
    "CVE-2008-5516": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1708",
        "title": "",
        "body": "It was discovered that gitweb, the web interface for the Git versioncontrol system, contained several vulnerabilities:Remote attackers could use crafted requests to execute shell commands onthe web server, using the snapshot generation and pickaxe searchfunctionality (CVE-2008-5916).Local users with write access to the configuration of a Git repositoryserved by gitweb could cause gitweb to execute arbitrary shell commandswith the permission of the web server (CVE-2008-5516, CVE-2008-5517).For the stable distribution (etch), these problems have been fixed inversion 1.4.4.4-4+etch1.For the unstable distribution (sid) and testing distribution (lenny),the remote shell command injection issue (CVE-2008-5516) has been fixedin version 1.5.6-1. The other issue will be fixed soon.We recommend that you upgrade your Git packages."
      }
    ],
    "CVE-2008-5517": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1708",
        "title": "",
        "body": "It was discovered that gitweb, the web interface for the Git versioncontrol system, contained several vulnerabilities:Remote attackers could use crafted requests to execute shell commands onthe web server, using the snapshot generation and pickaxe searchfunctionality (CVE-2008-5916).Local users with write access to the configuration of a Git repositoryserved by gitweb could cause gitweb to execute arbitrary shell commandswith the permission of the web server (CVE-2008-5516, CVE-2008-5517).For the stable distribution (etch), these problems have been fixed inversion 1.4.4.4-4+etch1.For the unstable distribution (sid) and testing distribution (lenny),the remote shell command injection issue (CVE-2008-5516) has been fixedin version 1.5.6-1. The other issue will be fixed soon.We recommend that you upgrade your Git packages."
      }
    ],
    "CVE-2008-5519": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1810",
        "title": "",
        "body": "An information disclosure flaw was found in mod_jk, the Tomcat Connectormodule for Apache. If a buggy client included the \"Content-Length\" headerwithout providing request body data, or if a client sent repeatedrequests very quickly, one client could obtain a response intended foranother client.The oldstable distribution (etch), this problem has been fixed inversion 1:1.2.18-3etch2.For the stable distribution (lenny), this problem has been fixed inversion 1:1.2.26-2+lenny1.For the testing distribution (squeeze) and the unstable distribution(sid), this problem has been fixed in version 1:1.2.26-2.1.We recommend that you upgrade your libapache-mod-jk packages."
      }
    ],
    "CVE-2008-5557": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1789",
        "title": "",
        "body": "A buffer overflow in the mbstring extension allows attackers to execute arbitrary code via a crafted string containing an HTML entity."
      }
    ],
    "CVE-2008-5587": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1693",
        "title": "",
        "body": "Directory traversal vulnerability allows remote attackers to read arbitrary files via _language parameter."
      }
    ],
    "CVE-2008-5616": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1782",
        "title": "",
        "body": "It was discovered that watching a malformed TwinVQ file could lead tothe execution of arbitrary code."
      }
    ],
    "CVE-2008-5621": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1723",
        "title": "",
        "body": "Michael Brooks discovered that phpMyAdmin, a tool to administrate MySQLover the web, performs insufficient input sanitising allowing a userassisted remote attacker to execute code on the webserver.For the stable distribution (etch), this problem has been fixed in version2.9.1.1-10.For the testing distribution (lenny) and unstable distribution (sid), thisproblem has been fixed in version 2.11.8.1-5.We recommend that you upgrade your phpmyadmin package."
      }
    ],
    "CVE-2008-5624": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1789",
        "title": "",
        "body": "The page_uid and page_gid variables are not correctly set, allowing use of some functionality intended to be restricted to root."
      }
    ],
    "CVE-2008-5658": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1789",
        "title": "",
        "body": "Directory traversal vulnerability in the ZipArchive::extractTo function allows attackers to write arbitrary files via a ZIP file with a file whose name contains .. (dot dot) sequences."
      }
    ],
    "CVE-2008-5700": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1787",
        "title": "",
        "body": "Alan Cox discovered a lack of minimum timeouts on SG_IO requests, which allows local users of systems using ATA to cause a denial of service by forcing drives into PIO mode."
      }
    ],
    "CVE-2008-5701": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1787",
        "title": "",
        "body": "Vlad Malov reported an issue on 64-bit MIPS systems where a local user could cause a system crash by crafing a malicious binary which makes o32 syscalls with a number less than 4000."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1794",
        "title": "",
        "body": "Vlad Malov reported an issue on 64-bit MIPS where a local user could cause a system crash by crafting a malicious binary which makes o32 syscalls with a number less than 4000."
      }
    ],
    "CVE-2008-5702": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1787",
        "title": "",
        "body": "Zvonimir Rakamaric reported an off-by-one error in the ib700wdt watchdog driver which allows local users to cause a buffer underflow by making a specially crafted WDIOC_SETTIMEOUT ioctl call."
      },
      {
        "url": "http://www.debian.org/security/2009/dsa-1794",
        "title": "",
        "body": "Zvonimir Rakamaric reported an off-by-one error in the ib700wdt watchdog driver which allows local users to cause a buffer underflow by making a specially crafted WDIOC_SETTIMEOUT ioctl call."
      }
    ],
    "CVE-2008-5713": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1794",
        "title": "",
        "body": "Flavio Leitner discovered that a local user can cause a denial of service by generating large amounts of traffic on a large SMP system, resulting in soft lockups."
      }
    ],
    "CVE-2008-5718": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1705",
        "title": "",
        "body": "It was discovered that netatalk, an implementation of the AppleTalksuite, is affected by a command injection vulnerability when processingPostScript streams via papd. This could lead to the execution ofarbitrary code. Please note that this only affects installations that areconfigured to use a pipe command in combination with wildcard symbolssubstituted with values of the printed job.For the stable distribution (etch) this problem has been fixed inversion 2.0.3-4+etch1.For the upcoming stable distribution (lenny) this problem has been fixedin version 2.0.3-11+lenny1.For the unstable distribution (sid) this problem has been fixed inversion 2.0.4~beta2-1.We recommend that you upgrade your netatalk package."
      }
    ],
    "CVE-2008-5814": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1789",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2008-6124": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1691",
        "title": "",
        "body": "Several remote vulnerabilities have been discovered in Moodle, an onlinecourse management system. The following issues are addressed in thisupdate, ranging from cross site scripting to remote code execution.Various cross site scripting issues in the Moodle codebase(CVE-2008-3326, CVE-2008-3325, CVE-2007-3555, CVE-2008-5432,MSA-08-0021, MDL-8849, MDL-12793, MDL-11414, MDL-14806,MDL-10276).Various cross site request forgery issues in the Moodle codebase(CVE-2008-3325, MSA-08-0023).Privilege escalation bugs in the Moodle codebase (MSA-08-0001, MDL-7755).SQL injection issue in the hotpot module (MSA-08-0010).An embedded copy of Smarty had several vulnerabilities(CVE-2008-4811, CVE-2008-4810).An embedded copy of Snoopy was vulnerable to cross site scripting(CVE-2008-4796).An embedded copy of Kses was vulnerable to cross site scripting(CVE-2008-1502).For the stable distribution (etch), these problems have been fixed inversion 1.6.3-2+etch1.For the unstable distribution (sid), these problems have been fixed inversion 1.8.2.dfsg-2.We recommend that you upgrade your moodle (1.6.3-2+etch1) package."
      }
    ],
    "CVE-2008-6125": [
      {
        "url": "http://www.debian.org/security/2008/dsa-1691",
        "title": "",
        "body": "Several remote vulnerabilities have been discovered in Moodle, an onlinecourse management system. The following issues are addressed in thisupdate, ranging from cross site scripting to remote code execution.Various cross site scripting issues in the Moodle codebase(CVE-2008-3326, CVE-2008-3325, CVE-2007-3555, CVE-2008-5432,MSA-08-0021, MDL-8849, MDL-12793, MDL-11414, MDL-14806,MDL-10276).Various cross site request forgery issues in the Moodle codebase(CVE-2008-3325, MSA-08-0023).Privilege escalation bugs in the Moodle codebase (MSA-08-0001, MDL-7755).SQL injection issue in the hotpot module (MSA-08-0010).An embedded copy of Smarty had several vulnerabilities(CVE-2008-4811, CVE-2008-4810).An embedded copy of Snoopy was vulnerable to cross site scripting(CVE-2008-4796).An embedded copy of Kses was vulnerable to cross site scripting(CVE-2008-1502).For the stable distribution (etch), these problems have been fixed inversion 1.6.3-2+etch1.For the unstable distribution (sid), these problems have been fixed inversion 1.8.2.dfsg-2.We recommend that you upgrade your moodle (1.6.3-2+etch1) package."
      }
    ],
    "CVE-2008-6218": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1750",
        "title": "",
        "body": "A memory leak in the png_handle_tEXt function allows context-dependent attackers to cause a denial of service (memory exhaustion) via a crafted PNG file."
      }
    ],
    "CVE-2008-6393": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1741",
        "title": "",
        "body": "Jesus Olmos Gonzalez discovered that an integer overflow in the PSIJabber client may lead to remote denial of service.The old stable distribution (etch) is not affected.For the stable distribution (lenny), this problem has been fixed inversion 0.11-9.For the unstable distribution (sid), this problem has been fixed inversion 0.12.1-1.We recommend that you upgrade your psi package."
      }
    ],
    "CVE-2008-6680": [
      {
        "url": "http://www.debian.org/security/2009/dsa-1771",
        "title": "",
        "body": "Attackers can cause a denial of service (crash) via a crafted EXE file that triggers a divide-by-zero error."
      }
    ],
    "CVE-2008-7251": [
      {
        "url": "http://www.debian.org/security/2010/dsa-2034",
        "title": "",
        "body": "phpMyAdmin may create a temporary directory, if the configured directory does not exist yet, with insecure filesystem permissions."
      }
    ],
    "CVE-2008-7252": [
      {
        "url": "http://www.debian.org/security/2010/dsa-2034",
        "title": "",
        "body": "phpMyAdmin uses predictable filenames for temporary files, which may lead to a local denial of service attack or privilege escalation."
      }
    ],
    "CVE-2008-7265": [
      {
        "url": "http://www.debian.org/security/2011/dsa-2191",
        "title": "",
        "body": "Incorrect handling of the ABOR command could lead to denial of service through elevated CPU consumption."
      }
    ]
  }
}