{
  "year": 2008,
  "total": 1,
  "reference": "docs.microsoft.com",
  "reports": {
    "CVE-2008-3466": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2008/ms08-059",
        "title": "Vulnerability in Host Integration Server RPC Service Could Allow Remote Code Execution (956695)",
        "body": "V1.2 (October 29, 2008): Corrected the impact of the workaround that deals with disabling the SNA RPC Service.",
        "extra": "Affected and Non-Affected Software The following software have been tested to determine which versions or editions are affected. Other versions or editions are either past their support life cycle or are not affected. To determine the support life cycle for your software version or edition, visit Microsoft Support Lifecycle. Affected Software SoftwareMaximum Security ImpactAggregate Severity RatingBulletins Replaced by this UpdateMicrosoft Host Integration Server 2000 Service Pack 2 (Server)Remote Code ExecutionCriticalNoneMicrosoft Host Integration Server 2000 Administrator ClientRemote Code ExecutionCriticalNoneMicrosoft Host Integration Server 2004 (Server)Remote Code ExecutionCriticalNoneMicrosoft Host Integration Server 2004 Service Pack 1 (Server)Remote Code ExecutionCriticalNoneMicrosoft Host Integration Server 2004 (Client)Remote Code ExecutionCriticalNoneMicrosoft Host Integration Server 2004 Service Pack 1 (Client)Remote Code ExecutionCriticalNoneMicrosoft Host Integration Server 2006 for 32-bit systemsRemote Code ExecutionCriticalNoneMicrosoft Host Integration Server 2006 for x64-based systemsRemote Code ExecutionCriticalNone Frequently Asked Questions (FAQ) Related to This Security Update Where are the file information details?The file information details can be found in Microsoft Knowledge Base Article 956695. I am using an older release of the software discussed in this security bulletin. What should I do?The affected software listed in this bulletin have been tested to determine which releases are affected. Other releases are past their support life cycle. To determine the support life cycle for your software release, visit Microsoft Support Lifecycle. It should be a priority for customers who have older releases of the software to migrate to supported releases to prevent potential exposure to vulnerabilities. For more information about the Windows Product Lifecycle, visit Microsoft Support Lifecycle. For more information about the extended security update support period for these software versions or editions, visit Microsoft Product Support Services. Customers who require custom support for older releases must contact their Microsoft account team representative, their Technical Account Manager, or the appropriate Microsoft partner representative for custom support options. Customers without an Alliance, Premier, or Authorized Contract can contact their local Microsoft sales office. For contact information, visit Microsoft Worldwide Information, select the country, and then click Go to see a list of telephone numbers. When you call, ask to speak with the local Premier Support sales manager. For more information, see the Windows Operating System Product Support Lifecycle FAQ. Vulnerability Information Severity Ratings and Vulnerability Identifiers Vulnerability Severity Rating and Maximum Security Impact by Affected SoftwareAffected SoftwareHIS Command Execution Vulnerability - CVE- 2008-3466Aggregate Severity RatingMicrosoft Host Integration Server 2000 Service Pack 2CriticalRemote Code ExecutionCriticalMicrosoft Host Integration Server 2000 Administrator ClientCriticalRemote Code ExecutionCriticalMicrosoft Host Integration Server 2004CriticalRemote Code ExecutionCriticalMicrosoft Host Integration Server 2004 Service Pack 1CriticalRemote Code ExecutionCriticalMicrosoft Host Integration Server 2006CriticalRemote Code ExecutionCritical HIS Command Execution Vulnerability - CVE- 2008-3466 ---------------------------------------------------- A remote code execution vulnerability exists in the SNA Remote Procedure Call (RPC) service for Host Integration Server. An attacker could exploit the vulnerability by constructing a specially crafted RPC request. The vulnerability could allow remote code execution. An attacker who successfully exploited this vulnerability could take complete control of an affected system. To view this vulnerability as a standard entry in the Common Vulnerabilities and Exposures list, see [CVE-2008-3466](http://www.cve.mitre.org/cgi-bin/cvename.cgi?name=cve-2008-3466). #### Mitigating Factors for HIS Command Execution Vulnerability - CVE- 2008-3466 Mitigation refers to a setting, common configuration, or general best-practice, existing in a default state, that could reduce the severity of exploitation of a vulnerability. The following mitigating factors may be helpful in your situation: - An attacker who successfully exploited this vulnerability could gain the same user rights as the SNA service account as specified during the install of Host Integration Server. Customers who follow best practices and configure the SNA RPC service account to have fewer user rights on the system could be less impacted than customers who configure the SNA service account to have administrative user rights. - For systems with Microsoft Host Integration Server 2000 Administrator Client or the Microsoft Host Integration Server 2004 Client, the default installation does not create or start the SNA Remote Procedure Call (RPC) service where the vulnerability exists. However; the files are installed by default and can be started therefore we highly recommend that customers apply the update if they have a vulnerable version of the product. #### Workarounds for HIS Command Execution Vulnerability - CVE- 2008-3466 Workaround refers to a setting or configuration change that does not correct the underlying vulnerability but would help block known attack vectors before you apply the update. Microsoft has tested the following workarounds and states in the discussion whether a workaround reduces functionality: - For Host Integration Server 2004 and Host Integration Server 2006, do not configure the HIS/SNA service to run with an Administrator Account. - When first installing Host Integration Server, administrators are prompted for an account to run the SNA RPC service with. Customers should follow best practices and select an account with non-administrative privileges. - The SNA service can be configured to use a lower privileged account through the Configuration Tool under the Host Integration Server folder in the Start menu. **Note** This workaround is not available for Host Integration Server 2000. **Impact of workaround.** None. Following best practices, the SNA service should be run with an account with non-administrative privileges. - For Host Integration Server 2000, Host Integration Server 2004 and Host Integration Server 2006, disable the SNA RPC Service. 1. To disable the affected service change the SnaRpcService service to disabled. This service is used to add performance counters and refresh the bindings when adding link services or additional SNA Server services to a server. 2. Once these configuration tasks are completed, disable the SNA RPC service. **Impact of workaround.** Normal runtime operation and additional configuration changes, such as adding connections, are not dependent on the SNA RPC service. However, if link services or nodes are added while this service is disabled, the associated performance counters will not be added and the SNA MngAgent service will need to be recycled for the configuration changes to be reflected in the SNA Manager. The collection of performance data is not impacted when the SNA RPC service is disabled. #### FAQ for HIS Command Execution Vulnerability - CVE- 2008-3466 **What is the scope of the vulnerability?** This is a remote code execution vulnerability. An attacker who successfully exploited this vulnerability could take complete control of an affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. **What causes the vulnerability?** Specially crafted RPC requests allow remote unauthenticated users to bypass authentication within the SNA RPC service. **What is RPC?** Remote Procedure Call (RPC) is a protocol that a program can use to request a service from a program located on another computer in a network. RPC helps with interoperability because the program using RPC does not have to understand the network protocols that are supporting communication. In RPC, the requesting program is the client and the service-providing program is the server. **What might an attacker use the vulnerability to do?** An attacker who successfully exploited this vulnerability could take complete control of the affected system. An attacker could then install programs; view, change, or delete data; or create new accounts with full user rights. **How could an attacker exploit the vulnerability?** An attacker could try to exploit the vulnerability by creating a specially crafted RPC message and sending the message to an affected system over the RPC TCP/UDP port which is dynamically assigned by Host Integration Server. **What systems are primarily at risk from the vulnerability?** All systems that have the affected Microsoft Host Integration Server installed are at risk from this vulnerability. **What does the update do?** This update removes the vulnerability by restricting access to the administrative functions exposed by RPC. **When this security bulletin was issued, had this vulnerability been publicly disclosed?** No. Microsoft received information about this vulnerability through responsible disclosure. Microsoft had not received any information to indicate that this vulnerability had been publicly disclosed when this security bulletin was originally issued. **When this security bulletin was issued, had Microsoft received any reports that this vulnerability was being exploited?** No. Microsoft had not received any information to indicate that this vulnerability had been publicly used to attack customers and had not seen any examples of proof of concept code published when this security bulletin was originally issued. ### Update Information Detection and Deployment Tools and Guidance ------------------------------------------- Manage the software and security updates you need to deploy to the servers, desktop, and mobile systems in your organization. For more information see the [TechNet Update Management Center](http://go.microsoft.com/fwlink/?linkid=69903). The [Microsoft TechNet Security Web site](http://go.microsoft.com/fwlink/?linkid=21132) provides additional information about security in Microsoft products. Security updates are available from [Microsoft Update](http://go.microsoft.com/fwlink/?linkid=40747), [Windows Update](http://go.microsoft.com/fwlink/?linkid=21130), and [Office Update](http://go.microsoft.com/fwlink/?linkid=21135). Security updates are also available from the [Microsoft Download Center](http://go.microsoft.com/fwlink/?linkid=21129). You can find them most easily by doing a keyword search for \"security update.\" Finally, security updates can be downloaded from the [Microsoft Update Catalog](http://go.microsoft.com/fwlink/?linkid=96155). The Microsoft Update Catalog provides a searchable catalog of content made available through Windows Update and Microsoft Update, including security updates, drivers and service packs. By searching using the security bulletin number (such as, “MS07-036”), you can add all of the applicable updates to your basket (including different languages for an update), and download to the folder of your choosing. For more information about the Microsoft Update Catalog, see the [Microsoft Update Catalog FAQ](http://go.microsoft.com/fwlink/?linkid=97900). **Detection and Deployment Guidance** Microsoft has provided detection and deployment guidance for this month’s security updates. This guidance will also help IT professionals understand how they can use various tools to help deploy the security update, such as Windows Update, Microsoft Update, Office Update, the Microsoft Baseline Security Analyzer (MBSA), the Office Detection Tool, Microsoft Systems Management Server (SMS), and the Extended Security Update Inventory Tool. For more information, see [Microsoft Knowledge Base Article 910723](http://support.microsoft.com/kb/910723). **Microsoft Baseline Security Analyzer** Microsoft Baseline Security Analyzer (MBSA) allows administrators to scan local and remote systems for missing security updates as well as common security misconfigurations. For more information about MBSA, visit [Microsoft Baseline Security Analyzer](http://www.microsoft.com/technet/security/tools/mbsahome.mspx). The following table provides the MBSA detection summary for this security update. | Software | MBSA 2.1 | |-------------------------------------------------------------|----------| | Microsoft Host Integration Server 2000 Service Pack 2 | Yes | | Microsoft Host Integration Server 2000 Administrator Client | Yes | | Microsoft Host Integration Server 2004 | Yes | | Microsoft Host Integration Server 2004 Service Pack 1 | Yes | | Microsoft Host Integration Server 2006 | Yes | For more information about MBSA 2.1, see [MBSA 2.1 Frequently Asked Questions](http://www.microsoft.com/technet/security/tools/mbsa2/qa.mspx). **Windows Server Update Services** By using Windows Server Update Services (WSUS), administrators can deploy the latest critical updates and security updates for Windows 2000 operating systems and later, Office XP and later, Exchange Server 2003, and SQL Server 2000. For more information about how to deploy this security update using Windows Server Update Services, visit the [Windows Server Update Services Web site](http://go.microsoft.com/fwlink/?linkid=50120). **Systems Management Server** The following table provides the SMS detection and deployment summary for this security update. | Software | SMS 2.0 | SMS 2003 with SUSFP | SMS 2003 with ITMU | Configuration Manager 2007 | |-------------------------------------------------------------|---------|---------------------|--------------------|----------------------------| | Microsoft Host Integration Server 2000 Service Pack 2 | No | No | Yes | Yes | | Microsoft Host Integration Server 2000 Administrator Client | No | No | Yes | Yes | | Microsoft Host Integration Server 2004 | No | No | Yes | Yes | | Microsoft Host Integration Server 2004 Service Pack 1 | No | No | Yes | Yes | | Microsoft Host Integration Server 2006 | No | No | Yes | Yes | For SMS 2.0 and SMS 2003, the SMS SUS Feature Pack (SUSFP), which includes the Security Update Inventory Tool (SUIT), can be used by SMS to detect security updates. See also [Downloads for Systems Management Server 2.0](http://technet.microsoft.com/en-us/sms/bb676799.aspx). For SMS 2003, the SMS 2003 Inventory Tool for Microsoft Updates (ITMU) can be used by SMS to detect security updates that are offered by [Microsoft Update](http://update.microsoft.com/microsoftupdate) and that are supported by [Windows Server Update Services](http://go.microsoft.com/fwlink/?linkid=50120). For more information about the SMS 2003 ITMU, see [SMS 2003 Inventory Tool for Microsoft Updates](http://technet.microsoft.com/en-us/sms/bb676783.aspx). SMS 2003 can also use the Microsoft Office Inventory Tool to detect required updates for Microsoft Office applications. For more information about the Office Inventory Tool and other scanning tools, see [SMS 2003 Software Update Scanning Tools](http://technet.microsoft.com/en-us/sms/bb676786.aspx). See also [Downloads for Systems Management Server 2003](http://technet.microsoft.com/en-us/sms/bb676766.aspx). System Center Configuration Manager 2007 uses WSUS 3.0 for detection of updates. For more information about Configuration Manager 2007 Software Update Management, visit [System Center Configuration Manager 2007](http://technet.microsoft.com/en-us/library/bb735860.aspx). For more information about SMS, visit the [SMS Web site](http://go.microsoft.com/fwlink/?linkid=21158). For more detailed information, see [Microsoft Knowledge Base Article 910723](http://support.microsoft.com/kb/910723): Summary list of monthly detection and deployment guidance articles. **Update Compatibility Evaluator and Application Compatibility Toolkit** Updates often write to the same files and registry settings required for your applications to run. This can trigger incompatibilities and increase the time it takes to deploy security updates. You can streamline testing and validating Windows updates against installed applications with the [Update Compatibility Evaluator](http://technet2.microsoft.com/windowsvista/en/library/4279e239-37a4-44aa-aec5-4e70fe39f9de1033.mspx?mfr=true) components included with [Application Compatibility Toolkit 5.0](https://www.microsoft.com/download/details.aspx?familyid=24da89e9-b581-47b0-b45e-492dd6da2971&displaylang=en). The Application Compatibility Toolkit (ACT) contains the necessary tools and documentation to evaluate and mitigate application compatibility issues before deploying Microsoft Windows Vista, a Windows Update, a Microsoft Security Update, or a new version of Windows Internet Explorer in your environment. Security Update Deployment -------------------------- **Affected Software** For information about the specific security update for your affected software, click the appropriate link: #### Microsoft Host Integration Server 2000 (all editions) **Reference Table** The following table contains the security update information for this software. You can find additional information in the subsection, **Deployment Information**, in this section. Inclusion in Future Service PacksThe update for this issue may be included in a future update rollupDeploymentInstalling without user interventionFor Microsoft Host Integration Server 2000 Service Pack 2:HIS2000-KB956695-SRV-SP2-ENU /quiet For Microsoft Host Integration Server 2000 Administrator Client:HIS2000-KB956695-ADM-SP2-ENU /quietInstalling without restartingFor Microsoft Host Integration Server 2000 Service Pack 2:HIS2000-KB956695-SRV-SP2-ENU /norestartFor Microsoft Host Integration Server 2000 Administrator Client:HIS2000-KB956695-ADM-SP2-ENU /norestartFurther informationSee the subsection, Detection and Deployment Tools and GuidanceRestart RequirementRestart required?To help reduce the chance that a restart will be required, stop all affected services and close all applications that may use the affected files prior to installing the security update. For more information about the reasons why you may be prompted to restart, see Microsoft Knowledge Base Article 887012.HotPatchingThis security update does not support HotPatching. For more information about HotPatching, see Microsoft Knowledge Base Article 897341.Removal InformationUse Add or Remove Programs tool in Control Panel.Note When you remove this update, you may be prompted to insert the Microsoft Host Integration Server 2000 CD in the CD drive. Additionally, you may not have the option to uninstall the update from the Add or Remove Programs tool in Control Panel. There are several possible causes for this issue. There are several possible causes for this issue. For more information about the removal, see Microsoft Knowledge Base Article 268800.File InformationSee Microsoft Knowledge Base Article 956695Registry Key VerificationMicrosoft Host Integration Server 2000 Service Pack 2:HKEY_LOCAL_MACHINE\\ SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Uninstall\\Microsoft Host Integration Server 2000 Hotfix [See KB article 956695 for details] Deployment Information Installing the Update When you install this security update, the installer checks whether one or more of the files that are being updated on your system have previously been updated by a Microsoft hotfix. If you have previously installed a hotfix to update one of these files, the installer copies the RTMQFE, SP1QFE, or SP2QFE files to your system. Otherwise, the installer copies the RTMGDR, SP1GDR, or SP2GDR files to your system. Security updates may not contain all variations of these files. For more information about this behavior, see Microsoft Knowledge Base Article 824994. For more information about the installer, visit the Microsoft TechNet Web site. For more information about the terminology that appears in this bulletin, such as hotfix, see Microsoft Knowledge Base Article 824684. This security update supports the following setup switches. Supported Setup.exe Installation SwitchesSwitchDescription**/help** or **/h** or **/?**Help and quick reference option.Setup Modes**/passive** or **/s**Passive Installation. Only progress bar will be displayed.**/quiet**Silent installation.**/u**Uninstall.Restart Options**/norestart**Supress restart.**/forcerestart**Always restart after installation.**/promptrestart**Prompts before restarting. This option cannot be used with the /quiet option.**/warnrestart\\[:x\\]**Warns the user that a reboot is going to happen in 30 seconds. Default number of second can be changed via the command line (i.e. /warnrestart:60).Special Options**/log** ***logfile***Writes logging information into a logfile at the specified path. Always uses verbose MSI logging and appends to existing file.**/w**Turn wizard off. **Note** You can combine these switches into one command. Removing the Update This security update supports the /u setup switch for uninstalling. Verifying That the Update Has Been Applied Microsoft Baseline Security AnalyzerTo verify that a security update has been applied to an affected system, you may be able to use the Microsoft Baseline Security Analyzer (MBSA) tool. See the section, Detection and Deployment Tools and Guidance, earlier in this bulletin for more information.File Version VerificationBecause there are several editions of Microsoft Windows, the following steps may be different on your system. If they are, see your product documentation to complete these steps.Click Start, and then click Search.In the Search Results pane, click All files and folders under Search Companion.In the All or part of the file name box, type a file name from the appropriate file information table, and then click Search.In the list of files, right-click a file name from the appropriate file information table, and then click Properties.Note Depending on the edition of the operating system, or the programs that are installed on your system, some of the files that are listed in the file information table may not be installed.On the Version tab, determine the version of the file that is installed on your system by comparing it to the version that is documented in the appropriate file information table.Note Attributes other than the file version may change during installation. Comparing other file attributes to the information in the file information table is not a supported method of verifying that the update has been applied. Also, in certain cases, files may be renamed during installation. If the file or version information is not present, use one of the other available methods to verify update installation.Registry Key VerificationYou may also be able to verify the files that this security update has installed by reviewing the registry keys listed in the Reference Table in this section.These registry keys may not contain a complete list of installed files. Also, these registry keys may not be created correctly when an administrator or an OEM integrates or slipstreams this security update into the Windows installation source files. Microsoft Host Integration Server 2004 (all editions) Reference Table The following table contains the security update information for this software. You can find additional information in the subsection, Deployment Information, in this section. Inclusion in Future Service PacksThe update for this issue will be included in a future service pack or update rollupDeploymentInstalling without user interventionFor Microsoft Host Integration Server 2004 (Server):HIS2004-KB956695-SRV-ENU /quietFor Microsoft Host Integration Server 2004 Service Pack 1 (Server):HIS2004-KB956695-SRV-SP1-ENU /quietFor Microsoft Host Integration Server 2004 (Client):HIS2004-KB956695-CLI-ENU /quietFor Microsoft Host Integration Server 2004 Service Pack 1 (Client):HIS2004-KB956695-CLI-SP1 /quietInstalling without restartingFor Microsoft Host Integration Server 2004 (Server):HIS2004-KB956695-SRV-ENU /norestartFor Microsoft Host Integration Server 2004 Service Pack 1 (Server):HIS2004-KB956695-SRV-SP1-ENU /norestartFor Microsoft Host Integration Server 2004 (Client):HIS2004-KB956695-CLI-ENU /norestartFor Microsoft Host Integration Server 2004 Service Pack 1 (Client):HIS2004-KB956695-CLI-SP1 /norestartFurther informationSee the subsection, Detection and Deployment Tools and GuidanceRestart RequirementRestart required?To help reduce the chance that a restart will be required, stop all affected services and close all applications that may use the affected files prior to installing the security update. For more information about the reasons why you may be prompted to restart, see Microsoft Knowledge Base Article 887012.HotPatchingThis security update does not support HotPatching. For more information about HotPatching, see Microsoft Knowledge Base Article 897341.Removal InformationUse Add or Remove Programs tool in Control Panel.Note When you remove this update, you may be prompted to insert the Microsoft Host Integration Server 2004 CD in the CD drive. Additionally, you may not have the option to uninstall the update from the Add or Remove Programs tool in Control Panel. There are several possible causes for this issue. There are several possible causes for this issue. For more information about the removal, see Microsoft Knowledge Base Article 268800.File InformationSee Microsoft Knowledge Base Article 956695Registry Key VerificationMicrosoft Host Integration Server 2004 (Server):HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Uninstall\\Microsoft Host Integration Server 2004 Hotfix [Pre-SP1]Microsoft Host Integration Server 2004 Service Pack 1 (Server):HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Uninstall\\Microsoft Host Integration Server 2004 SP1 Hotfix [See KB article 956695 for details]Microsoft Host Integration Server 2004 (Client):HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Uninstall\\Microsoft Host Integration Server 2004 Hotfix [See KB article 956695 for details]Microsoft Host Integration Server 2004 Service Pack 1 (Client):HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Uninstall\\Microsoft Host Integration Server 2004 SP1 Hotfix [See KB article 956695 for details] Deployment Information Installing the Update When you install this security update, the installer checks whether one or more of the files that are being updated on your system have previously been updated by a Microsoft hotfix. If you have previously installed a hotfix to update one of these files, the installer copies the RTMQFE, SP1QFE, or SP2QFE files to your system. Otherwise, the installer copies the RTMGDR, SP1GDR, or SP2GDR files to your system. Security updates may not contain all variations of these files. For more information about this behavior, see Microsoft Knowledge Base Article 824994. For more information about the installer, visit the Microsoft TechNet Web site. For more information about the terminology that appears in this bulletin, such as hotfix, see Microsoft Knowledge Base Article 824684. This security update supports the following setup switches. Supported Setup.exe Installation SwitchesSwitchDescription**/help** or **/h** or **/?**Help and quick reference option.Setup Modes**/passive** or **/s**Passive Installation. Only progress bar will be displayed.**/quiet**Silent installation.**/u**Uninstall.Restart Options**/norestart**Supress restart.**/forcerestart**Always restart after installation.**/promptrestart**Prompts before restarting. This option cannot be used with the /quiet option.**/warnrestart\\[:x\\]**Warns the user that a reboot is going to happen in 30 seconds. Default number of second can be changed via the command line (i.e. /warnrestart:60).Special Options**/log** ***logfile***Writes logging information into a logfile at the specified path. Always uses verbose MSI logging and appends to existing file.**/w**Turn wizard off. **Note** You can combine these switches into one command. Removing the Update This security update supports the /u setup switch for uninstalling. Verifying That the Update Has Been Applied Microsoft Baseline Security AnalyzerTo verify that a security update has been applied to an affected system, you may be able to use the Microsoft Baseline Security Analyzer (MBSA) tool. See the section, Detection and Deployment Tools and Guidance, earlier in this bulletin for more information.File Version VerificationBecause there are several editions of Microsoft Windows, the following steps may be different on your system. If they are, see your product documentation to complete these steps.Click Start, and then click Search.In the Search Results pane, click All files and folders under Search Companion.In the All or part of the file name box, type a file name from the appropriate file information table, and then click Search.In the list of files, right-click a file name from the appropriate file information table, and then click Properties.Note Depending on the edition of the operating system, or the programs that are installed on your system, some of the files that are listed in the file information table may not be installed.On the Version tab, determine the version of the file that is installed on your system by comparing it to the version that is documented in the appropriate file information table.Note Attributes other than the file version may change during installation. Comparing other file attributes to the information in the file information table is not a supported method of verifying that the update has been applied. Also, in certain cases, files may be renamed during installation. If the file or version information is not present, use one of the other available methods to verify update installation.Registry Key VerificationYou may also be able to verify the files that this security update has installed by reviewing the registry keys listed in the Reference Table in this section.These registry keys may not contain a complete list of installed files. Also, these registry keys may not be created correctly when an administrator or an OEM integrates or slipstreams this security update into the Windows installation source files. Microsoft Host Integration Server 2006 (all editions) Reference Table The following table contains the security update information for this software. You can find additional information in the subsection, Deployment Information, in this section. Inclusion in Future Service PacksThe update for this issue will be included in a future service pack or update rollupDeploymentInstalling without user interventionFor Microsoft Host Integration Server 2006 x86 Editions:HIS2006-KB956695-x86-ENU /quietFor Microsoft Host Integration Server 2006 x64 Editions:HIS2006-KB956695-x64-ENU /quietInstalling without restartingFor Microsoft Host Integration Server 2006 x86 Editions:HIS2006-KB956695-x86-ENU /norestartFor Microsoft Host Integration Server 2006 x64 Editions:HIS2006-KB956695-x64-ENU /norestartFurther informationSee the subsection, Detection and Deployment Tools and GuidanceRestart RequirementRestart required?To help reduce the chance that a restart will be required, stop all affected services and close all applications that may use the affected files prior to installing the security update. For more information about the reasons why you may be prompted to restart, see Microsoft Knowledge Base Article 887012.HotPatchingThis security update does not support HotPatching. For more information about HotPatching, see Microsoft Knowledge Base Article 897341.Removal InformationUse Add or Remove Programs tool in Control Panel.Note When you remove this update, you may be prompted to insert the Microsoft Host Integration Server 2006 CD in the CD drive. Additionally, you may not have the option to uninstall the update from the Add or Remove Programs tool in Control Panel. There are several possible causes for this issue. There are several possible causes for this issue. For more information about the removal, see Microsoft Knowledge Base Article 268800.File InformationSee Microsoft Knowledge Base Article 956695Registry Key VerificationHKEY_LOCAL_MACHINE\\SOFTWARE\\Windows\\CurrentVersion\\Uninstall\\Microsoft Host Integration Server 2006 Hotfix [See KB article 956695 for details] #### Deployment Information **Installing the Update** When you install this security update, the installer checks to see if one or more of the files that are being updated on your system have previously been updated by a Microsoft hotfix. If you have previously installed a hotfix to update one of these files, the installer copies the RTMQFE, SP1QFE, or SP2QFE files to your system. Otherwise, the installer copies the RTMGDR, SP1GDR, or SP2GDR files to your system. Security updates may not contain all variations of these files. For more information about this behavior, see [Microsoft Knowledge Base Article 824994](http://support.microsoft.com/kb/824994). For more information about the installer, visit the [Microsoft TechNet Web site](http://go.microsoft.com/fwlink/?linkid=38951). For more information about the terminology that appears in this bulletin, such as *hotfix*, see [Microsoft Knowledge Base Article 824684](http://support.microsoft.com/kb/824684). This security update supports the following setup switches. Supported Setup.exe Installation Switches Switch Description **/help** or **/h** or **/?**Help and quick reference option.Setup Modes**/passive** or **/s**Passive Installation. Only progress bar will be displayed.**/quiet**Silent installation.**/u**Uninstall.Restart Options**/norestart**Supress restart.**/forcerestart**Always restart after installation.**/promptrestart**Prompts before restarting. This option cannot be used with the /quiet option.**/warnrestart\\[:x\\]**Warns the user that a reboot is going to happen in 30 seconds. Default number of second can be changed via the command line (i.e. /warnrestart:60).Special Options**/log** ***logfile***Writes logging information into a logfile at the specified path. Always uses verbose MSI logging and appends to existing file.**/w**Turn wizard off. **Note** You can combine these switches into one command. Removing the Update This security update supports the /u setup switch for uninstalling. Verifying that the Update Has Been Applied Microsoft Baseline Security AnalyzerTo verify that a security update has been applied to an affected system, you may be able to use the Microsoft Baseline Security Analyzer (MBSA) tool. See the section, Detection and Deployment Tools and Guidance, earlier in this bulletin for more information.File Version VerificationBecause there are several editions of Microsoft Windows, the following steps may be different on your system. If they are, see your product documentation to complete these steps.Click Start, and then click Search.In the Search Results pane, click All files and folders under Search Companion.In the All or part of the file name box, type a file name from the appropriate file information table, and then click Search.In the list of files, right-click a file name from the appropriate file information table, and then click Properties.Note Depending on the edition of the operating system, or the programs that are installed on your system, some of the files that are listed in the file information table may not be installed.On the Version tab, determine the version of the file that is installed on your system by comparing it to the version that is documented in the appropriate file information table.Note Attributes other than the file version may change during installation. Comparing other file attributes to the information in the file information table is not a supported method of verifying that the update has been applied. Also, in certain cases, files may be renamed during installation. If the file or version information is not present, use one of the other available methods to verify update installation.Registry Key VerificationYou may also be able to verify the files that this security update has installed by reviewing the registry keys listed in the Reference Table in this section.These registry keys may not contain a complete list of installed files. Also, these registry keys may not be created correctly when an administrator or an OEM integrates or slipstreams this security update into the Windows installation source files. Other Information Acknowledgments Microsoft thanks the following for working with us to help protect customers: Stephen Fewer of Harmony Security, working with iDefense VCP, for reporting the HIS Command Execution Vulnerability - (CVE- 2008-3466) Support Customers in the U.S. and Canada can receive technical support from Microsoft Product Support Services at 1-866-PCSAFETY. There is no charge for support calls that are associated with security updates.International customers can receive support from their local Microsoft subsidiaries. There is no charge for support that is associated with security updates. For more information about how to contact Microsoft for support issues, visit the International Support Web site. Disclaimer The information provided in the Microsoft Knowledge Base is provided \"as is\" without warranty of any kind. Microsoft disclaims all warranties, either express or implied, including the warranties of merchantability and fitness for a particular purpose. In no event shall Microsoft Corporation or its suppliers be liable for any damages whatsoever including direct, indirect, incidental, consequential, loss of business profits or special damages, even if Microsoft Corporation or its suppliers have been advised of the possibility of such damages. Some states do not allow the exclusion or limitation of liability for consequential or incidental damages so the foregoing limitation may not apply. Revisions V1.0 (October 14, 2008): Bulletin published.V1.1 (October 15, 2008): Added reference to Microsoft Knowledge Base Article 956695 to Known Issues in the Executive Summary section. Also, corrected the title of the HIS Command Execution Vulnerability (CVE- 2008-3466) in the Acknowledgments section.V1.2 (October 29, 2008): Corrected the impact of the workaround that deals with disabling the SNA RPC Service. Built at 2014-04-18T13:49:36Z-07:00 </content>"
      }
    ]
  }
}