{
  "year": 2015,
  "total": 148,
  "reference": "exchange.xforce.ibmcloud.com",
  "reports": {
    "CVE-2015-0001": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99514",
        "title": "Microsoft Knowledge Base Article 3004365 is not installed",
        "body": "Microsoft Knowledge Base Article 3004365 update is not installed on the system, which could allow an attacker to exploit the following vulnerability: Microsoft Windows Error Reporting (WER) could allow a local attacker to bypass security restrictions, caused by improper handling of process memory. An attacker could exploit this vulnerability to access the memory of processes normally protected by \"Protected Process Light\". Note: The local attacker must have administrator privileges to exploit this vulnerability.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS15-006. See References."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99513",
        "title": "Microsoft Windows Error Reporting security bypass",
        "body": "Microsoft Windows Error Reporting (WER) could allow a local attacker to bypass security restrictions, caused by improper handling of process memory. An attacker could exploit this vulnerability to access the memory of processes normally protected by \"Protected Process Light\". Note: The local attacker must have administrator privileges to exploit this vulnerability.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS15-006. See References."
      }
    ],
    "CVE-2015-0002": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99524",
        "title": "Microsoft Knowledge Base Article 3023266 is not installed",
        "body": "Microsoft Knowledge Base Article 3023266 update is not installed on the system, which could allow an attacker to exploit the following vulnerability: Microsoft Windows Application Compatibility Infrastructure (AppCompat) could allow a local authenticated attacker to gain elevated privileges on the system, caused by improper validation of authorization to write to the AppCompat cache. By inserting a specially crafted entry into the AppCompat cache, an authenticated attacker could exploit this vulnerability to execute a privileged application.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS15-001. See References."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99523",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-0003": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100430",
        "title": "Microsoft Windows kernel mode driver privilege escalation",
        "body": "Microsoft Windows kernel mode driver (win32k.sys) could allow a local authenticated attacker to gain elevated privileges on the system, caused by improper handling of objects in memory. An authenticated attacker could exploit this vulnerability to run scripts with elevated privileges.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS15-010. See References."
      }
    ],
    "CVE-2015-0004": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99520",
        "title": "Microsoft Knowledge Base Article 3021674 is not installed",
        "body": "Microsoft Knowledge Base Article 3021674 update is not installed on the system, which could allow an attacker to exploit the following vulnerability: Microsoft Windows User Profile Service (ProfSvc) could allow a local authenticated attacker to gain elevated privileges on the system, caused by improper validation of user privilege. By executing a specially crafted program, a local authenticated attacker could exploit this vulnerability to load other user's registry hives and possibly execute arbitrary code with elevated privileges.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS15-003. See References."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99519",
        "title": "Microsoft Windows User Profile Service privilege escalation",
        "body": "Microsoft Windows User Profile Service (ProfSvc) could allow a local authenticated attacker to gain elevated privileges on the system, caused by improper validation of user privilege. By executing a specially crafted program, a local authenticated attacker could exploit this vulnerability to load other user's registry hives and possibly execute arbitrary code with elevated privileges.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS15-003. See References."
      }
    ],
    "CVE-2015-0006": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99522",
        "title": "Microsoft Knowledge Base Article 3022777 is not installed",
        "body": "Microsoft Knowledge Base Article 3022777 update is not installed on the system, which could allow an attacker to exploit the following vulnerability: Microsoft Network Location Awareness (NLA) could allow a remote attacker to bypass security restrictions, caused by the NLA service improperly validating if a domain-connected system is connected to the domain or an untrusted network . By sending specially-crafted DNS or LDAP responses to a victim on the same network, an attacker could exploit this vulnerability to apply a domain profile to systems on an untrusted network and relax the firewall policy and/or configuration of certain services.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS15-005. See References."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99521",
        "title": "Microsoft Network Location Awareness security bypass",
        "body": "Microsoft Network Location Awareness (NLA) could allow a remote attacker to bypass security restrictions, caused by the NLA service improperly validating if a domain-connected system is connected to the domain or an untrusted network . By sending specially-crafted DNS or LDAP responses to a victim on the same network, an attacker could exploit this vulnerability to apply a domain profile to systems on an untrusted network and relax the firewall policy and/or configuration of certain services.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS15-005. See References."
      }
    ],
    "CVE-2015-0011": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99527",
        "title": "Microsoft WebDAV privilege escalation",
        "body": "Microsoft WebDAV kernel-mode driver (mrxdav.sys) could allow a local authenticated attacker to gain elevated privileges on the system, caused by improper validation and enforcement of impersonation levels. By running a specially crafted program, an authenticated local attacker could exploit this vulnerability to intercept WebDAV file requests from any server and return any file the attacker chooses.Apply the appropriate patch for your system, as listed in the latest Microsoft Security Bulletin. See References. — OR — Use Microsoft Automatic Update if it is supported by your operating system. The original bulletin issued by Microsoft has been superseded."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99526",
        "title": "Microsoft Knowledge Base Article 3019215 is not installed",
        "body": "Microsoft Knowledge Base Article 3019215 update is not installed on the system, which could allow an attacker to exploit the following vulnerability: Microsoft WebDAV kernel-mode driver (mrxdav.sys) could allow a local authenticated attacker to gain elevated privileges on the system, caused by improper validation and enforcement of impersonation levels. By running a specially crafted program, an authenticated local attacker could exploit this vulnerability to intercept WebDAV file requests from any server and return any file the attacker chooses.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS15-008. See References."
      }
    ],
    "CVE-2015-0012": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100428",
        "title": "Microsoft Virtual Machine Manager privilege escalation",
        "body": "Microsoft Virtual Machine Manager (VMM) could allow a local authenticated attacker to gain elevated privileges on the system, caused by improper validation of user roles. By executing a specially crafted application, an authenticated attacker could exploit this vulnerability to take complete control of the system.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS15-017. See References."
      }
    ],
    "CVE-2015-0014": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99518",
        "title": "Microsoft Knowledge Base Article 3020393 is not installed",
        "body": "Microsoft Knowledge Base Article 3020393 update is not installed on the system, which could allow an attacker to exploit the following vulnerability: Microsoft Telnet could allow a remote attacker to execute arbitrary code on the system, caused by improper validation of user input. By sending a specially-crafted packet to a Windows server that has the telnet service installed, an attacker could exploit this vulnerability to overflow a memory buffer and execute arbitrary code on the system.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS15-002. See References."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99517",
        "title": "Microsoft Telnet buffer overflow code execution",
        "body": "Microsoft Telnet could allow a remote attacker to execute arbitrary code on the system, caused by improper validation of user input. By sending a specially-crafted packet to a Windows server that has the telnet service installed, an attacker could exploit this vulnerability to overflow a memory buffer and execute arbitrary code on the system.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS15-002. See References."
      }
    ],
    "CVE-2015-0016": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99516",
        "title": "",
        "body": ""
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99515",
        "title": "Microsoft Windows Components privilege escalation",
        "body": "Microsoft Windows Components could allow a remote unauthenticated attacker to gain elevated privileges on the system, caused by improper santizing of file paths. By convincing the victim to download a specially crafted application and exploiting another vulnerability to run arbitrary code, an attacker could exploit this vulnerability to gain the same system rights as the victim.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS15-004. See References."
      }
    ],
    "CVE-2015-0057": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100431",
        "title": "Microsoft Windows kernel mode driver privilege escalation",
        "body": "Microsoft Windows kernel mode driver (Win32k.sys) could allow a remote authenticated attacker to gain elevated privileges on the system, caused by improper handling of objects in memory. By executing a specially crafted program, an authenticated attacker could exploit this vulnerability to read arbitrary amounts of kernel memory.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS15-010. See References."
      }
    ],
    "CVE-2015-0059": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100433",
        "title": "Microsoft Windows kernel mode driver TrueType font code execution",
        "body": "Microsoft Windows kernel mode driver (Win32k.sys) could allow a remote attacker to execute arbitrary code on the system, caused by improper handling of TrueType font error checking. By persuading a victim to open a specially-crafted file or website, an attacker could exploit this vulnerability to execute arbitrary code on the system in kernel mode.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS15-010. See References."
      }
    ],
    "CVE-2015-0061": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100436",
        "title": "Microsoft Knowledge Base Article 3029944 is not installed",
        "body": "Microsoft Knowledge Base Article 3029944 update is not installed on the system, which could allow an attacker to exploit the following vulnerability: Microsoft Windows could allow a remote attacker to obtain sensitive information, caused by improper handling of uninitialized memory when parsing TIFF image files. By persuading a victim to open a specially crafted TIFF image, a remote attacker could exploit this vulnerability to read data not intended for disclosure and then use this information to launch further attacks against the affected system.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS15-016. See References."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100435",
        "title": "Microsoft Windows TIFF information disclosure",
        "body": "Microsoft Windows could allow a remote attacker to obtain sensitive information, caused by improper handling of uninitialized memory when parsing TIFF image files. By persuading a victim to open a specially crafted TIFF image, a remote attacker could exploit this vulnerability to read data not intended for disclosure and then use this information to launch further attacks against the affected system.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS15-016. See References."
      }
    ],
    "CVE-2015-0062": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100438",
        "title": "",
        "body": ""
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100437",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-0063": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100439",
        "title": "Microsoft Excel code execution",
        "body": "Microsoft Excel could allow a remote attacker to execute arbitrary code on the system, caused by improper handling of objects in memory. By persuading a victim to open a specially-crafted file, an attacker could exploit this vulnerability to corrupt system memory and execute arbitrary code on the system in the context of the victim.Apply the appropriate patch for your system, as listed in Microsoft Security Bulletin MS15-012. See References."
      }
    ],
    "CVE-2015-0072": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100606",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-0108": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99605",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-0109": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99606",
        "title": "IBM Tivoli Service Automation Manager cross-site scripting",
        "body": "IBM Tivoli Service Automation Manager is vulnerable to cross-site scripting, caused by improper validation of user-supplied input. A remote attacker could exploit this vulnerability a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0151": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/110584",
        "title": "D-Link DIR-815 administration UI cross-site request forgery",
        "body": "D-Link DIR-815 is vulnerable to cross-site request forgery, caused by improper validation of user-supplied input. By persuading an authenticated user to visit a malicious Web site, a remote attacker could send a malformed HTTP request to store requests to the remote administration UI. An attacker could exploit this vulnerability to perform cross-site scripting attacks, Web cache poisoning, and other malicious activities.Refer to D-Link Web site for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0152": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/110585",
        "title": "D-Link DIR-815 administrative password information disclosure",
        "body": "D-Link DIR-815 could allow a remote attacker to obtain sensitive information, caused by the storing of the administrative password in clear text. An attacker could exploit this vulnerability to obtain sensitive information.Refer to D-Link Web site for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0162": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100865",
        "title": "IBM SiteProtector privilege escalation",
        "body": "IBM SiteProtector could allow a local attacker to gain elevated privileges on the system, caused by an unquoted Windows search path vulnerability. An attacker could exploit this vulnerability using a Trojan horse application to inject arbitrary code into the root path and gain elevated privileges on the system.Refer to IBM Security Bulletin 1700012 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0167": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100929",
        "title": "textAngular textAngular-sanitize.js cross-site scripting",
        "body": "textAngular is vulnerable to cross-site scripting, caused by improper validation of user-supplied input. A remote attacker could exploit this vulnerability using a specially-crafted URL to inject and execute script in a victim's Web browser within the security context of the hosting Web site, once the page is viewed. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Upgrade to the latest version of textAngular (1.3.7 or later), available from the textAngular Web site. See References."
      }
    ],
    "CVE-2015-0204": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99707",
        "title": "OpenSSL ssl3_get_key_exchange RSA-to-EXPORT_RSA downgrade",
        "body": "A vulnerability in the OpenSSL ssl3_get_key_exchange function could allow a remote attacker to downgrade the security of certain TLS connections. An OpenSSL client accepts the use of an RSA temporary key in a non-export RSA key exchange ciphersuite. This could allow a remote attacker using man-in-the-middle techniques to facilitate brute-force decryption of TLS/SSL traffic between vulnerable clients and servers. This vulnerability is also known as the FREAK attack.Refer to OpenSSL Security Advisory [08 Jan 2015] for patch, upgrade or suggested workaround information. See References. For IBM products: Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2015-0205": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99708",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-0206": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99704",
        "title": "OpenSSL dtls1_buffer_record denial of service",
        "body": "OpenSSL is vulnerable to a denial of service, caused by a memory leak in the dtls1_buffer_record function. By sending repeated DTLS records with the same sequence number, a remote attacker could exploit this vulnerability to exhaust all available memory resources.Refer to OpenSSL Security Advisory [08 Jan 2015] for patch, upgrade or suggested workaround information. See References. For IBM products: Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2015-0227": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100837",
        "title": "Apache WSS4J security bypass",
        "body": "Apache WSS4J could allow a remote attacker to bypass security restrictions, caused by the failure to properly enforce the requireSignedEncryptedDataElements property. An attacker could exploit this vulnerability using various types of wrapping attacks to bypass security restrictions and perform unauthorized actions.Upgrade to the latest version of WSS4J (1.6.17 or 2.0.2 or later), available from the Apache Web site. See References."
      }
    ],
    "CVE-2015-0247": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100740",
        "title": "e2fsprogs libext2fs buffer overflow",
        "body": "e2fsprogs is vulnerable to a heap-based buffer overflow, caused by improper bounds checking by the libext2fs library. A local attacker could overflow a buffer and execute arbitrary code on the system or cause a denial of service.Upgrade to the latest version of e2fsprogs (1.42.12 or later), available from the e2fsprogs GIT Repository. See References."
      }
    ],
    "CVE-2015-0260": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100888",
        "title": "Kallithea get_repo API method information disclosure",
        "body": "Kallithea could allow a remote authenticated attacker to obtain sensitive information, caused by improper validation of get_repo API method. A remote authenticated attacker could exploit this vulnerability to obtain sensitive information.Apply the patch for this vulnerability (cve-2015-0260.patch), available from the kallithea-scm Web site. See References."
      }
    ],
    "CVE-2015-0268": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100868",
        "title": "Xen GICD.SGIR denial of service",
        "body": "Xen, on ARM-based systems, is vulnerable to a denial of service, caused by an error when decoding a guest write to a specific register in the virtual interrupt controller. By writing an invalid value to the GICD.SGIR register, a local attacker could exploit this vulnerability to cause the host system to crash.Refer to Xen Security Advisory XSA-117 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0301": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99981",
        "title": "Adobe Flash Player unspecified",
        "body": "An unspecified error in Adobe Flash Player, as bundled in multiple products, related to an improper file validation issue has an unknown impact and attack vector.Refer to Adobe Security Bulletin APSB15-01 for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2015-0304": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99985",
        "title": "Adobe Flash Player buffer overflow",
        "body": "Adobe Flash Player, as bundled in multiple products are vulnerable to a heap-based buffer overflow. By persuading a victim to visit a specially-crafted Web site, a remote attacker could overflow a buffer and execute arbitrary code on the system with the privileges of the victim or cause the application to crash.Refer to Adobe Security Bulletin APSB15-01 for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2015-0307": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99988",
        "title": "Adobe Flash Player information disclosure",
        "body": "Adobe Flash Player, as bundled in multiple products, could allow a remote attacker to obtain sensitive information, caused by an out-of-bounds read error. By persuading a victim to visit a specially-crafted Web site, a remote attacker could exploit this vulnerability to obtain sensitive information.Refer to Adobe Security Bulletin APSB15-01 for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2015-0309": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99986",
        "title": "Adobe Flash Player buffer overflow",
        "body": "Adobe Flash Player, as bundled in multiple products are vulnerable to a heap-based buffer overflow. By persuading a victim to visit a specially-crafted Web site, a remote attacker could overflow a buffer and execute arbitrary code on the system with the privileges of the victim or cause the application to crash.Refer to Adobe Security Bulletin APSB15-01 for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2015-0323": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100708",
        "title": "Adobe Flash Player buffer overflow",
        "body": "Adobe Flash Player is vulnerable to a heap-based buffer overflow. By persuading a victim to visit a specially-crafted Web site, a remote attacker could overflow a buffer and execute arbitrary code on the system or cause the application to crash.Refer to Adobe Security Bulletin APSB15-04 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0324": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100710",
        "title": "Adobe Flash Player buffer overflow",
        "body": "Adobe Flash Player is vulnerable to a buffer overflow. By persuading a victim to visit a specially-crafted Web site, a remote attacker could overflow a buffer and execute arbitrary code on the system or cause the application to crash.Refer to Adobe Security Bulletin APSB15-04 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0327": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100709",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-0517": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100874",
        "title": "EMC Documentum D2 D2-API information disclosure",
        "body": "EMC Documentum D2 could allow a remote authenticated attacker to obtain sensitive information, caused by the logging of the MD5 hash of a passphrase used to protect D2 sensitive system and user credentials to log files by the D2-API component. An attacker could exploit this vulnerability to obtain sensitive information.Refer to EMC Security Advisory ESA-2015-010 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0518": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100875",
        "title": "EMC Documentum D2 D2FS web service privilege escalation",
        "body": "EMC Documentum D2 could allow a remote authenticated attacker to gain elevated privileges on the system, caused by an error in a method in the Properties service of the D2FS web service component. An attacker could exploit this vulnerability to manipulate group permissions and gain elevated privileges on the system.Refer to EMC Security Advisory ESA-2015-010 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0519": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100748",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-0577": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100556",
        "title": "Multiple Cisco Products IronPort Spam Quarantine cross-site scripting",
        "body": "Multiple Cisco Products are vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the IronPort Spam Quarantine web page. A remote attacker could exploit this vulnerability using multiple parameters in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Refer to Cisco Security Notice for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0578": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100549",
        "title": "Cisco Adaptive Security Appliance DHCP relay function denial of service",
        "body": "Cisco Adaptive Security Appliance is vulnerable to a denial of service, caused by an error in the DHCP relay function. A remote attacker could exploit this vulnerability using specially-crafted DHCP packets to cause the device to reload.Refer to Cisco Security Notice for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0580": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100812",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-0582": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99995",
        "title": "Cisco NX-OS on MDS 9000 denial of service",
        "body": "Cisco NX-OS on MDS 9000 is vulnerable to a denial of service, caused by an error in the High Availability (HA) subsystem. A remote attacker could exploit this vulnerability using specially-crafted traffic to cause a denial of service.Refer to Cisco Security Notice for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0583": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100565",
        "title": "Cisco WebEx Meeting Center information disclosure",
        "body": "Cisco WebEx Meeting Center could allow a remote attacker to obtain sensitive information. By viewing the application URL requests, remote attacker could exploit this vulnerability to obtain sensitive information.Refer to Cisco Security Notice for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0586": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100660",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-0588": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100657",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-0589": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100719",
        "title": "Cisco WebEx Meetings Server web interface command execution",
        "body": "Cisco WebEx Meetings Server could allow a remote authenticated attacker to execute arbitrary commands on the system, caused by an error in the administrative web interface. By sending specially-crafted data, an attacker could exploit this vulnerability to inject and execute arbitrary commands on the system with root privileges.Refer to cisco-sa-20150204-wbx for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0590": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100576",
        "title": "Cisco WebEx Meeting Center information disclosure",
        "body": "Cisco WebEx Meeting Center could allow a remote attacker to obtain sensitive information. By sending specially-crafted requests, a remote attacker could exploit this vulnerability using various parameters to enable meeting features and obtain sensitive information.Refer to Cisco Security Notice for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0591": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100661",
        "title": "Cisco Unified Communications Domain Manager (UCDM) Admin GUI denial of service",
        "body": "Cisco Unified Communications Domain Manager (UCDM) is vulnerable to a denial of service, caused by an error in Admin GUI. A remote attacker could exploit this vulnerability to cause the application to stop responding.Refer to Cisco Security Notice for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0592": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100758",
        "title": "Cisco IOS kernel timers denial of service",
        "body": "Cisco IOS is vulnerable to a denial of service, caused by the improper management of kernel timers. By sending specially-crafted traffic through the firewall feature, a remote attacker could exploit this vulnerability to cause a denial of service.Refer to Cisco Security Notice for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0593": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100757",
        "title": "Cisco IOS Zone-Based Firewall feature denial of service",
        "body": "Cisco IOS is vulnerable to a denial of service, caused by the improper management of specific internal structures linked to firewall session objects by the Zone-Based Firewall feature. By sending specially-crafted traffic through the firewall feature, a remote attacker could exploit this vulnerability to cause a denial of service.Refer to Cisco Security Notice for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0595": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100667",
        "title": "Cisco WebEx Meetings Server XML API information disclosure",
        "body": "Cisco WebEx Meetings Server could allow a remote attacker to obtain sensitive information, caused by the failure to validate return messages in the XML API. A remote attacker could exploit this vulnerability to obtain sensitive information.Refer to Cisco Security Notice for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0596": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100665",
        "title": "Cisco WebEx Meetings Server cross-site request forgery",
        "body": "Cisco WebEx Meetings Server is vulnerable to cross-site request forgery, caused by improper validation of user-supplied input. By persuading an authenticated user to visit a malicious Web site, a remote attacker could send a malformed HTTP request. An attacker could exploit this vulnerability to perform cross-site scripting attacks, Web cache poisoning, and other malicious activities.Refer to Cisco Security Notice for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0597": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100658",
        "title": "Cisco WebEx Meetings Server information disclosure",
        "body": "Cisco WebEx Meetings Server could allow a remote attacker to obtain sensitive information, caused by an error in the Forgot Password process. By sending specially-crafted packets, a remote attacker could exploit this vulnerability to enumerate valid administrator accounts.Refer to Cisco Security Notice for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0600": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100726",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-0601": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100617",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-0602": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100615",
        "title": "Cisco Unified IP Phones 9900 Series information disclosure",
        "body": "Cisco Unified IP Phones 9900 Series could allow a remote attacker to obtain sensitive information, caused by an error in the mobility extension feature. By monitoring network traffic, a remote attacker could exploit this vulnerability to obtain sensitive information.Refer to Cisco Security Notice for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0603": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100619",
        "title": "Cisco Unified IP Phones 9900 Series denial of service",
        "body": "Cisco Unified IP Phones 9900 Series are vulnerable to a denial of service, caused by insecure file permissions. A local authenticated attacker could exploit this vulnerability to cause a denial of service.Refer to Cisco Security Notice for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0604": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100620",
        "title": "Cisco Unified IP Phones 9900 Series file upload",
        "body": "Cisco Unified IP Phones 9900 Series could allow a remote attacker to upload arbitrary files, caused by the improper validation of HTTP requests. A remote attacker could exploit this vulnerability to upload a malicious PHP script, which could allow the attacker to execute arbitrary PHP code on the vulnerable system.Refer to Cisco Security Notice for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-0605": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100695",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-0606": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100810",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-0611": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100806",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-0617": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100923",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-0619": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100864",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-0620": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100924",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-0920": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99614",
        "title": "",
        "body": ""
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99613",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-0922": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99949",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-1041": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99898",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-1043": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100934",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-1050": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99907",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-1053": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99890",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-1054": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99615",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-1056": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99906",
        "title": "Brother MFC-J4410DW cross-site scripting",
        "body": "Brother MFC-J4410DW is vulnerable to cross-site scripting, caused by improper validation of user-supplied input. A remote attacker could exploit this vulnerability using the url parameter in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Refer to Brother Industries Web site for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-1057": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99627",
        "title": "e107 Bootstrap CMS usersettings.php cross-site scripting",
        "body": "e107 Bootstrap CMS is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the usersettings.php script. A remote attacker could exploit this vulnerability using the Real Name field to inject malicious script into a Web page which would be executed in a victim's Web browser within the security context of the hosting Web site, once the page is viewed. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of January 3, 2015."
      }
    ],
    "CVE-2015-1058": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99617",
        "title": "AdaptCMS multiple cross-site scripting",
        "body": "AdaptCMS is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by various scripts. A remote attacker could exploit this vulnerability using various fields to inject malicious script into a Web page which would be executed in a victim's Web browser within the security context of the hosting Web site, once the page is viewed. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of January 5, 2015."
      }
    ],
    "CVE-2015-1059": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99616",
        "title": "AdaptCMS app\\webroot\\uploads file upload",
        "body": "AdaptCMS could allow a remote attacker to upload arbitrary files, caused by the improper validation of file extensions. By sending a specially-crafted HTTP request, a remote authenticated attacker could exploit this vulnerability to upload a malicious PHP script to the \\app\\webroot\\uploads directory, which could allow the attacker to execute arbitrary PHP code on the vulnerable system.No remedy available as of January 5, 2015."
      }
    ],
    "CVE-2015-1175": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100013",
        "title": "PrestaShop blocklayered-ajax.php cross-site scripting",
        "body": "PrestaShop is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the blocklayered-ajax.php script. A remote attacker could exploit this vulnerability using the layered_price_slider parameter in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Upgrade to the latest version of PrestaShop (1.6.0.11 or later), available from the PrestaShop Web site. See References."
      }
    ],
    "CVE-2015-1209": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100715",
        "title": "Google Chrome DOM code execution",
        "body": "Google Chrome could allow a remote attacker to execute arbitrary code on the system, caused by a use-after-free error within DOM. An attacker could exploit this vulnerability using unknown attack vectors to execute arbitrary code on the system.Upgrade to the latest version of Google Chrome (40.0.2214.111 or later), available from the Google Chrome Releases Web site. See References. For other distributions: Apply the appropriate update for your system. See References."
      }
    ],
    "CVE-2015-1305": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100602",
        "title": "McAfee Data Loss Prevention Endpoint privilege escalation",
        "body": "McAfee Data Loss Prevention Endpoint, when running on Windows XP operating system, could allow a local attacker to gain elevated privileges on the system. By sending specially-crafted commands to a Windows kernel driver, an attacker could exploit this vulnerability to gain elevated privileges on the system.Refer to McAfee Security Bulletin ID: SB10097 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-1365": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100036",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-1366": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100039",
        "title": "Pixabay Images plugin for WordPress author link cross-site scripting",
        "body": "Pixabay Images plugin for WordPress is vulnerable to cross-site scripting, caused by improper validation of user-supplied input. A remote attacker could exploit this vulnerability using the generated author link to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Upgrade to the latest version of Pixabay Images plugin for WordPress (2.4 or later), available from the WordPress Plugin Directory. See References."
      }
    ],
    "CVE-2015-1367": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100043",
        "title": "Catbot index.php SQL injection",
        "body": "Catbot is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the index.php script using the lastcastbot parameter, which could allow the attacker to view, add, modify or delete information in the back-end database.No remedy available as of January 16, 2015."
      }
    ],
    "CVE-2015-1368": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99924",
        "title": "",
        "body": "Ansible Tower is vulnerable to cross-site scripting, caused by improper validation of user-supplied input. A remote attacker could exploit this vulnerability using the order_by and next_run parameters in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Upgrade to the latest version of Tower (2.0.5 or later), available from the Ansible Web site. See References."
      }
    ],
    "CVE-2015-1422": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99977",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-1423": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99976",
        "title": "Gecko CMS admin/index.php SQL injection",
        "body": "Gecko CMS is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the admin/index.php script using the jak_delete_log[] or ssp parameter, which could allow the attacker to view, add, modify or delete information in the back-end database.No remedy available as of January 13, 2015."
      }
    ],
    "CVE-2015-1424": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/99974",
        "title": "Gecko CMS admin/index.php cross-site request forgery",
        "body": "Gecko CMS is vulnerable to cross-site request forgery, caused by improper validation of user-supplied input by the admin/index.php script. By persuading an authenticated user to visit a malicious Web site, a remote attacker could send a malformed HTTP request to create new administrator account. An attacker could exploit this vulnerability to perform cross-site scripting attacks, Web cache poisoning, and other malicious activities.No remedy available as of January 13, 2015."
      }
    ],
    "CVE-2015-1431": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100670",
        "title": "phpBB cross-site scripting",
        "body": "phpBB is vulnerable to cross-site scripting, caused by improper validation of user-supplied input. A remote attacker could exploit this vulnerability to inject malicious script into a Web page which would be executed in a victim's Web browser within the security context of the hosting Web site, once the page is viewed. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Upgrade to the latest version of phpBB (3.0.13 or later), available from the phpBB Web site. See References."
      }
    ],
    "CVE-2015-1432": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100671",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-1434": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100855",
        "title": "my little forum index.php SQL injection",
        "body": "my little forum is vulnerable to SQL injection. A remote attacker could send specially-crafted SQL statements to the index.php script using the edit_category parameter, which could allow the attacker to view, add, modify or delete information in the back-end database.Upgrade to the latest version of my little forum (2.3.4 or later), available from the my little forum Web site. See References."
      }
    ],
    "CVE-2015-1435": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100856",
        "title": "",
        "body": "my little forum is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the index.php script. A remote attacker could exploit this vulnerability using the back parameter in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Upgrade to the latest version of my little forum (2.3.4 or later), available from the my little forum Web site. See References."
      }
    ],
    "CVE-2015-1436": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100861",
        "title": "Easing Slider Plugin for WordPress cross-site scripting",
        "body": "Easing Slider Plugin for WordPress is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the easingslider_manage_customizations or easingslider_edit_sliders page. A remote attacker could exploit this vulnerability using the edit parameter in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Upgrade to the latest version of Easing Slider plugin for WordPress (2.2.0.7 or later), available from the WordPress Web site. See References."
      }
    ],
    "CVE-2015-1437": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100566",
        "title": "ASUS Router RT-N10 Plus result_of_get_changed_status.asp cross-site scripting",
        "body": "ASUS Router RT-N10 Plus is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the result_of_get_changed_status.asp script. A remote authenticated attacker could exploit this vulnerability using the flag parameter in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of January 29, 2015."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100563",
        "title": "ASUS RT-N10 error_page.htm cross-site scripting",
        "body": "ASUS RT-N10 is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the error_page.htm script. A remote attacker could exploit this vulnerability using the flag parameter in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of January 29, 2015."
      }
    ],
    "CVE-2015-1444": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100610",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-1457": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100560",
        "title": "Fortinet FortiAuthenticator dig command file disclosure",
        "body": "Fortinet FortiAuthenticator could allow a remote authenticated attacker to obtain sensitive information. A remote authenticated attacker could exploit this vulnerability to execute dig command with -f parameter to obtain sensitive information and launch further attacks against the affected system.No remedy available as of January 29, 2015."
      }
    ],
    "CVE-2015-1458": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100559",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-1459": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100561",
        "title": "Fortinet FortiAuthenticator SCEP service cross-site scripting",
        "body": "Fortinet FortiAuthenticator is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the SCEP service. A remote attacker could exploit this vulnerability using the operation parameter in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of January 29, 2015."
      }
    ],
    "CVE-2015-1467": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100668",
        "title": "Fork CMS multiple SQL injection",
        "body": "Fork CMS is vulnerable to SQL injection. A remote authenticated attacker could send specially-crafted SQL statements using the language[] and type[] parameters, which could allow the attacker to view, add, modify or delete information in the back-end database.Upgrade to the latest version of Fork CMS (3.8.6 or later), available from the Fork CMS Web site. See References."
      }
    ],
    "CVE-2015-1475": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100616",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-1499": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100918",
        "title": "Samsung Security Manager ActiveMQ Broker denial of service",
        "body": "Samsung Security Manager is vulnerable to a denial of service, caused by an error in the ActiveMQ Broker service. By sending a specially-crafted HTTP DELETE request, an attacker could exploit this vulnerability to delete arbitrary files from the system.Upgrade to the latest version of Security Manager (1.31 or later), available from the Samsung Web site. See References."
      }
    ],
    "CVE-2015-1512": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100410",
        "title": "FancyFon FAMOC index.php cross-site scripting",
        "body": "FancyFon FAMOC is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the index.php script. A remote attacker could exploit this vulnerability using the order and myorgs parameters in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Upgrade to the latest version of FAMOC (3.17.4 or later), available from the FancyFon Web site. See References."
      }
    ],
    "CVE-2015-1513": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100582",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-1559": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100735",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-1567": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100629",
        "title": "GD Infinite Scroll module for Drupal admin page cross-site scripting",
        "body": "GD Infinite Scroll module for Druapl is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the admin page. A remote attacker could exploit this vulnerability in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Refer to SA-CONTRIB-2015-031 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-1568": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100628",
        "title": "GD Infinite Scroll module for Druapl cross-site request forgery",
        "body": "GD Infinite Scroll module for Druapl is vulnerable to cross-site request forgery, caused by improper validation of user-supplied input. By persuading an authenticated user to visit a malicious Web site, a remote attacker could send a malformed HTTP request to delete settings. An attacker could exploit this vulnerability to perform cross-site scripting attacks, Web cache poisoning, and other malicious activities.Refer to SA-CONTRIB-2015-031 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-1585": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100925",
        "title": "Fat Free CRM authenticity_token cross-site request forgery",
        "body": "Fat Free CRM is vulnerable to cross-site request forgery, caused by improper validation of user-supplied input. By persuading an authenticated user to visit a malicious Web site, a remote attacker could send a malformed HTTP request using the authenticity_token parameter to create another admin user. An attacker could exploit this vulnerability to perform cross-site scripting attacks, Web cache poisoning, and other malicious activities.Upgrade to the latest version of Fat Free CRM (0.13.6 or later), available from the Fat Free CRM Web page. See References."
      }
    ],
    "CVE-2015-1589": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100879",
        "title": "Archmage .chm local directory traversal",
        "body": "Archmage could allow a local authenticated attacker to traverse directories on the system. A local authenticated attacker could unpack a specially-crafted .chm file to create a file in the target directory containing \"dot dot\" sequences (/../) to view arbitrary files on the system.Upgrade to the latest version of archmage (1:0.2.4-4 or later), available from the archmage - SourceForge Web site. See References."
      }
    ],
    "CVE-2015-1614": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100926",
        "title": "Image Metadata Cruncher plugin for WordPress cross-site scripting",
        "body": "Image Metadata Cruncher plugin for WordPress is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the index.php script. A remote attacker could exploit this vulnerability using the page parameter in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of February 2015."
      }
    ],
    "CVE-2015-1952": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/103416",
        "title": "IBM Security AppScan Enterprise cross-site scripting",
        "body": "IBM AppScan Enterprise Edition is vulnerable to cross-site scripting, caused by improper validation of user-supplied input. A remote attacker could exploit this vulnerability using a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Refer to IBM Security Bulletin 1883124 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-1957": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/103482",
        "title": "IBM WebSphere MQ information disclosure",
        "body": "IBM WebSphere MQ could allow some encrypted data to pass through the server in cleartext. This could allow a remote authenticated attacker to obtain sensitive data via man in the middle techniques.Refer to IBM Security Bulletin 1960506 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-2039": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100814",
        "title": "Acobot Live Chat and Contact Form plugin for WordPress cross-site request forgery",
        "body": "Acobot Live Chat and Contact Form plugin for WordPress is vulnerable to cross-site request forgery, caused by improper validation of user-supplied input. By persuading an authenticated user to visit a malicious Web site, a remote attacker could send a malformed HTTP request to change settings. An attacker could exploit this vulnerability to perform cross-site scripting attacks, Web cache poisoning, and other malicious activities.No remedy available as of February 9, 2015."
      },
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100813",
        "title": "Acobot Live Chat and Contact Form plugin for WordPress cross-site scripting",
        "body": "Acobot Live Chat and Contact Form plugin for WordPress is vulnerable to cross-site scripting, caused by improper validation of user-supplied input. A remote attacker could exploit this vulnerability using the acobot_token field to inject malicious script into a Web page which would be executed in a victim's Web browser within the security context of the hosting Web site, once the page is viewed. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of February 9, 2015."
      }
    ],
    "CVE-2015-2040": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100818",
        "title": "Contact Form DB plugin for WordPress cross-site scripting",
        "body": "Contact Form DB plugin for WordPress is vulnerable to cross-site scripting, caused by improper validation of user-supplied input. A remote attacker could exploit this vulnerability using the submit_time parameter in a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of February 9, 2015."
      }
    ],
    "CVE-2015-3389": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100653",
        "title": "Public Download Count module for Drupal cross-site scripting",
        "body": "Public Download Count module for Drupal is vulnerable to cross-site scripting, caused by improper validation of user-supplied input by the Download counts report page. A remote authenticated attacker could exploit this vulnerability using a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Refer to DRUPAL-SA-CONTRIB-2015-036 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-3390": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100655",
        "title": "Facebook Album Fetcher module for Drupal cross-site scripting",
        "body": "Facebook Album Fetcher module for Drupal is vulnerable to cross-site scripting, caused by improper validation of user-supplied input. A remote attacker could exploit this vulnerability to inject malicious script into a Web page which would be executed in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.No remedy available as of February 4, 2015."
      }
    ],
    "CVE-2015-3391": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100672",
        "title": "Path Breadcrumbs module for Drupal security bypass",
        "body": "Path Breadcrumbs module for Drupal could allow a remote attacker to bypass security restrictions, caused by the failure to check node access. By sending a specially-crafted request, an attacker could exploit this vulnerability to bypass access restrictions.Refer to DRUPAL-SA-CONTRIB-2015-037 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-3392": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/100654",
        "title": "Ajax Timeline module for Drupal cross-site scripting",
        "body": "Ajax Timeline module for Drupal is vulnerable to cross-site scripting, caused by improper validation of user-supplied input. A remote authenticated attacker could exploit this vulnerability using the timeline to inject malicious script into a Web page which would be executed in a victim's Web browser within the security context of the hosting Web site, once the page is viewed. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Refer to DRUPAL-SA-CONTRIB-2015-035 for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-4987": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/105896",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-5016": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/106460",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-5039": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/106715",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-5045": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/106938",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-7401": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/107106",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-7423": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/107771",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-7424": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/107780",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-7432": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/107861",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-7433": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/107862",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-7434": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/107863",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-7440": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/108098",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-7449": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/108221",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-7453": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/108296",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-7458": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/108354",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-7459": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/108355",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-7460": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/108356",
        "title": "",
        "body": ""
      }
    ],
    "CVE-2015-7461": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/108357",
        "title": "IBM Connections denial of service",
        "body": "IBM Connections is vulnerable to a denial of service, caused by an XML External Entity Injection (XXE) error when processing XML data. A remote attacker could exploit this vulnerability to consume all available memory resources.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2015-7471": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/108429",
        "title": "IBM Rational Team Concert HTML injection",
        "body": "IBM Rational Team Concert (RTC) is vulnerable to HTML injection. A remote attacker with project administrator privileges could send a project that contains malicious HTML code, which when the project is viewed, would be executed in the victim's Web browser within the security context of the hosting site.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References."
      }
    ],
    "CVE-2015-7474": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/108501",
        "title": "IBM Rational Engineering Lifecycle Manager cross-site scripting",
        "body": "IBM Rational Engineering Lifecycle Manager is vulnerable to stored cross-site scripting, caused by improper validation of user-supplied input. A remote attacker could exploit this vulnerability using a field to inject malicious script into a Web page which would be executed in a victim's Web browser within the security context of the hosting Web site, once the page is viewed. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2015-7484": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/108619",
        "title": "IBM Rational Engineering Lifecycle Manager information disclosure",
        "body": "IBM Rational Engineering Lifecycle Manager could allow an authenticated user that has been added to lifecycle projects to obtain sensitive information by sending a specially crafted URL to the Lifecycle Query Engine.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2015-7485": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/108626",
        "title": "IBM Jazz technology based products cross-site scripting",
        "body": "IBM Jazz technology based products are vulnerable to cross-site scripting, caused by improper validation of user-supplied input. A remote attacker could exploit this vulnerability using a specially-crafted URL to execute script in a victim's Web browser within the security context of the hosting Web site, once the URL is clicked. An attacker could use this vulnerability to steal the victim's cookie-based authentication credentials.Refer to the appropriate IBM Security Bulletin for patch, upgrade or suggested workaround information. See References. For other distributions: Apply the appropriate update for your system."
      }
    ],
    "CVE-2015-7486": [
      {
        "url": "https://exchange.xforce.ibmcloud.com/vulnerabilities/108633",
        "title": "",
        "body": ""
      }
    ]
  }
}