{
  "year": 2002,
  "total": 34,
  "reference": "docs.microsoft.com",
  "reports": {
    "CVE-1999-0344": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1998/ms98-009",
        "title": "Update Available for Windows NT Privilege Elevation Attack",
        "body": "Recently Microsoft was notified by Mark Joseph Edwards (http://www.ntshop.net) of a Privilege Elevation vulnerability on Microsoft® Windows NT® operating system. A program called sechole.exe written by Prasad Dabak, Sandeep Phadke and Milind Borate (psdabak@hotmail.com, sandeepsandeep@hotmail.com and milind@cyberspace.org) exploits this vulnerability, and was published on the Internet. Sechole.exe performs a sophisticated set of steps to allow a non-administrative user who is logged on locally (at the console of a system) to gain debug-level access on a system process. Using this program, the non-administrative user is able to run arbitrary code in the system security context and thereby grant himself or herself local administrative privileges on the local system. The purpose of this bulletin is to inform Microsoft customers of this issue, its applicability to Microsoft products, and the availability of countermeasures Microsoft has developed to further secure its customers.",
        "extra": "This exploit can potentially allow a non-administrative user to gain local administrative access to the system and thereby elevate his or her privileges on the system. In order to perform this attack the user has to have a valid local account on the system and be able to run arbitrary code on the system. Normally this means they must have physical access to the computer in order to logon locally to the system. Sensitive systems such as the Windows NT Domain Controllers, where non-administrative users do not have any local logon rights by default, are not susceptible to this threat. The attack cannot be used over the network to get domain administrative privileges remotely. Specific Details In this attack, a non-administrative user obtains administrative access to the system by virtue of being able to gain debug-level access on a system process. Specifically, the exploit program does the following: Locates the memory address of a particular API function used by the DebugActiveProcess function.Modifies the instructions at that address to return success in a failure case.Iterates through the processes running as local system, calling DebugActiveProcess on each until a successful attach is performed. The server-side component of DebugActiveProcess does not correctly check for valid access to the target process.Creates a thread in the victim process that runs code from an accompanying dynamic-link library (DLL). This thread will add the user running the program to the local administrators group. The hot fixes listed below ensure that the access check to grant any rights is done correctly by the server."
      }
    ],
    "CVE-1999-0349": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1999/ms99-003",
        "title": "Patch Available for IIS \"Malformed FTP List Request\" Vulnerability",
        "body": "Microsoft has released a patch that eliminates a vulnerability in the Internet Information Server FTP service. This vulnerability could allow denial of service attacks against the server or, under certain conditions, could allow arbitrary code to be executed on the server. A fully supported fix for this problem is available. As detailed below in What Customers Should Do, Microsoft recommends that customers who are at risk from this vulnerability apply the patch.",
        "extra": "The FTP service in IIS has an unchecked buffer in a component that processes \"list\" commands. This results in a vulnerability that poses two threats to safe operation. The first is a denial of service threat; a malformed \"list\" request could overflow the buffer causing the server to crash. The second is more esoteric and would be far more difficult to exploit. A carefully-constructed \"list\" request could cause arbitrary code to execute on the server via a classic buffer overrun technique. Neither variant could be exploited accidentally. It is noteworthy that the \"list\" command is only available to users after they have authenticated to the server. As a result, only users who are authorized to use the server would be able to mount such an attack, and their presence on the server could be logged if the owner of the site chose to do so. However, many sites provide guest accounts, and this could allow a malicious user to attack the server anonymously. Microsoft has no reports of any customers being affected by this vulnerability. However, Microsoft is proactively releasing a patch that corrects the problem."
      }
    ],
    "CVE-1999-0366": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1999/ms99-004",
        "title": "Patch Available for Authentication Processing Error in Windows NT 4.0 Service Pack 4",
        "body": "Microsoft has released a patch that eliminates a logic error in Service Pack 4 for Windows NT 4.0 that could, under certain conditions, allow a user to log on interactively and connect to network shares using a blank password. The vulnerability primarily, but not exclusively, affects Windows NT servers that serve as domain controllers in environments with DOS, Windows 3.1, Windows for Workgroups, OS/2 or Macintosh clients. In general, customers who have deployed only Windows NT, Windows 95 and Windows 98 client workstations are not at risk from this vulnerability. A fully supported patch is available for this vulnerability, and Microsoft recommends that all customers evaluate the risk to their systems and, as appropriate, download and install it on affected computers.",
        "extra": "The Windows NT Security Account Manager (SAM) database stores the hashed password for each user account in two forms: an \"NT hash\" form that is used to authenticate users on Windows NT clients, and an \"LM hash\" form that is used to authenticate users on Windows 95, Windows 98, and downlevel clients such as DOS, Windows 3.1, Windows for Workgroups, OS/2 and Macintosh. When a user changes his password via a Windows NT, Windows 95 or Windows 98 client, both the \"NT hash\" and \"LM hash\" forms of the password are updated in the SAM. However, when the user changes his password via a downlevel client, only the \"LM hash\" form of the password is stored; a null value is stored in the \"NT hash\" field. This is normal operation. When a user attempts an interactive logon or a network share connection from a Windows NT system, the Windows NT authentication process uses the \"NT hash\" form of the password. If the \"NT hash\" is null, the \"LM hash\" of the password is used for verification. (Windows 95, Windows 98 and downlevel clients always use only the \"LM hash\" for verification.) The logic error in Service Pack 4 incorrectly allows a null \"NT hash\" value to be used for authentication from Windows NT systems. The result is that if a user account's password was last changed from a DOS, Windows 3.1, Windows for Workgroups, OS/2 or Macintosh client, a user can logon into that account from a Windows NT system using a blank password. By far the most likely machines to be affected by this vulnerability would be domain controllers running Windows NT 4.0 SP 4, in networks that contain any of the downlevel clients listed above. However, any server or workstation running Windows NT 4.0 SP 4 that contains a SAM database with active users who communicate from downlevel clients would be vulnerable to this problem. For example, a workgroup of Windows NT 4.0 SP 4 systems, one of which is accessed by Windows for Workgroups clients, would be affected by this vulnerability. It is worth reiterating the following points: Even on an affected network, a user whose most recent password change was performed via Windows NT, Windows 95 or Windows 98 workstations will have a non-null \"NT hash\" value, and hence will not be at risk.Customers who are affected by the vulnerability need only apply the patch to machines that contain SAM databases with active user accounts.There is no need for users to update or change their passwords after applying the patch. Even in vulnerable systems, the SAM database entries are valid; the problem lies in the way SP4 processes them. The patch corrects the authentication process logic in SP4 without changing the SAM database entries in any way."
      }
    ],
    "CVE-1999-0372": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1999/ms99-005",
        "title": "BackOffice Server 4.0 Does Not Delete Installation Setup File",
        "body": "Microsoft has learned of a potential vulnerability in the installer for BackOffice Server 4.0. The installer asks the user to provide the account userid and password for selected services and writes these to a file in order to automate the installation process. However, the file is not deleted when the installation process completes. As detailed below, Microsoft recommends that BackOffice 4.0 customers delete this file. Microsoft has received no reports of customers being adversely affected by this problem. However, it is releasing this security bulletin in order to proactively provide customers with information about the problem in order to allow them to take steps to ensure their safe computing.",
        "extra": "When a user chooses to install SQL Server, Exchange Server or Microsoft Transaction Server as part of a BackOffice 4.0 installation, the BackOffice installer program requests the name and password for the accounts associated with these services. Specifically, it asks for the account name and password for the SQL Executive Logon account, the Exchange Services Account, and the MTS Remote Administration Account. These values are stored in <systemdrive>\\Program Files\\Microsoft Backoffice\\Reboot.ini, and used to install the associated services. BackOffice Server does not erase this file when the installation process is completed. This is true regardless of whether the installation process completes successfully or unsuccessfully. By default, the Microsoft BackOffice folder is not shared, so network access to reboot.ini generally does not pose a risk. Users who can log onto the server locally would be able to access the file, but in most cases this ability is granted only to selected users such as administrators. The fix for this problem is to delete the file <systemdrive>\\Program Files\\Microsoft Backoffice\\Reboot.ini after each BackOffice 4.0 installation, whether successful or not. The file is created only by the installer, and, once deleted, will not be re-created unless BackOffice 4.0 is re-installed."
      }
    ],
    "CVE-1999-0680": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1999/ms99-028",
        "title": "Patch Available for \"Terminal Server Connection Request Flooding\" Vulnerability",
        "body": "Microsoft has released a patch that eliminates a vulnerability that could pose a denial-of-service threat to Microsoft® Windows NT® Terminal Servers. Frequently asked questions regarding this vulnerability can be found at http://www.microsoft.com/technet/security/bulletin/fq99-028.mspx",
        "extra": "When a request to open a new terminal connection is received by a Terminal Server, the server undertakes a resource-intensive series of operations to prepare for the connection. It does this before authenticating the request. This would allow an attacker to mount a denial of service attack by levying a large number of bogus connection requests and consuming all memory on the Terminal Server. This vulnerability could be exploited remotely if connection requests are not filtered. In extreme cases, the server could crash in the face of such an attack; in other cases, normal processing would return when the attack ceased. The patch works by causing the server to require authentication before processing the connection request."
      }
    ],
    "CVE-1999-0700": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1999/ms99-026",
        "title": "Patch Available for \"Malformed Dialer Entry\" Vulnerability",
        "body": "Microsoft has released a patch that eliminates a security vulnerability in the Phone Dialer accessory in Microsoft® Windows NT®. The vulnerability could be used to run arbitrary code in a user's security context on Windows NT systems. Frequently asked questions regarding this vulnerability can be found at http://www.microsoft.com/technet/security/bulletin/fq99-026.mspx",
        "extra": "Dialer.exe has an unchecked buffer in the portion of the program that processes the dialer.ini file. This vulnerability could be used to run arbitrary code via a classic buffer overrun technique. The circumstances of this vulnerability require a fairly complicated attack scenario that limits its scope. Dialer.exe runs in the security context of the user, so it would not benefit an attacker to simply modify a dialer.ini file and run it, as he or she would not gain additional privileges. Instead, the attacker would need to modify the dialer.ini file of another user who had higher privileges, then wait for that user to run Dialer. Although the unchecked buffer is present in all versions of Windows NT 4.0, the attack scenario would result in workstations that have dial-out capability being chiefly at risk. The FAQ discusses this in greater detail."
      }
    ],
    "CVE-1999-0702": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1999/ms99-037",
        "title": "Patch Available for \"ImportExportFavorites\" Vulnerability",
        "body": "On September 10, 1999, Microsoft released the original version of this bulletin, in order to provide a workaround for a security vulnerability in Microsoft® Internet Explorer 5 that could allow a malicious web site operator to take inappropriate action on the computer of a person who visited the site. Microsoft has completed a patch that completely eliminates the vulnerability, and has re-released this bulletin in order to advise customers of its availability. In addition to eliminating the \"ImportExportFavorites\" vulnerability, the patch also eliminates a security vulnerability posed by several ActiveX controls that ship as part of Internet Explorer 4.01 and 5. Frequently asked questions regarding this vulnerability can be found at http://www.microsoft.com/technet/security/bulletin/fq99-037.mspx",
        "extra": "IE 5 includes a feature that allows users to export a list of their favorite web sites to a file, or to import a file containing a list of favorite sites. The method that is used to perform this function, ImportExportFavorites(), should only allow particular types of files to be written, and only to specific locations on the drive. However, it is possible for a web site to invoke this method, bypass this restriction and write files that could be used to execute system commands. The net result is that a malicious web site operator potentially could take any action on the computer that the user would be capable of taking. This vulnerability would chiefly affect workstations that are connected to the Internet. The patch restores correct operation to the ImportExportFavorites() method. In addition, the patch addresses security problems posed by several ActiveX controls. The specific controls and the actions taken are discussed in the FAQ."
      }
    ],
    "CVE-1999-0721": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1999/ms99-020",
        "title": "Patch Available for \"Malformed LSA Request\" Vulnerability",
        "body": "Microsoft has released a patch that eliminates a vulnerability that poses a denial of service threat to Microsoft® Windows NT® servers and workstations. A malformed request to the Local Security Authority (LSA) service will causes the service to stop responding, requiring the computer to be restarted. A fully supported patch is available to eliminate the vulnerability, and Microsoft recommends that affected customers download and install it, if appropriate.",
        "extra": "Windows NT provides the ability to manage user privileges programmatically via the Local Security Authority (LSA) API. The API allows a program to query user names, modify privileges, and change other elements of the security policy, subject to the program's authorizations. Calls to the LSA API can be made from either the local machine or remotely via RPC. Certain API methods do not correctly handle certain types of invalid arguments. The vulnerability is a denial of service threat only, and service can be restored by restarting the machine. There is no capability to use this vulnerability to obtain unauthorized services from LSA. While there are no reports of customers being adversely affected by this vulnerability, Microsoft is proactively releasing this patch to allow customers to take appropriate action to protect themselves against it."
      }
    ],
    "CVE-1999-0726": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1999/ms99-023",
        "title": "Patch Available for \"Malformed Image Header\" Vulnerability",
        "body": "Microsoft has released a patch that eliminates a vulnerability that could allow denial of service attacks against Microsoft® Windows NT® servers, workstations, and terminal servers. This patch already is available as part of Windows NT Server Service Pack 5, but is being provided as a stand-alone patch for the benefit of users who have entered Y2K lockdown on Service Pack 4. Frequently asked questions regarding this vulnerability can be found at http://www.microsoft.com/technet/security/bulletin/fq99-023.mspx",
        "extra": "If an executable file with a specially-malformed image header is executed, it will cause a system failure. The affected machine will need to be rebooted in order to place it back in service. Any work that was in progress when the machine crashed could be lost."
      }
    ],
    "CVE-1999-0728": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1999/ms99-024",
        "title": "Patch Available for \"Unprotected IOCTLs\" Vulnerability",
        "body": "Microsoft has released a patch that eliminates a vulnerability that could allow denial of service attacks against a Microsoft® Windows NT® workstation, server or terminal server. An unprivileged program can disable the local mouse or keyboard on a server or workstation, and disable the console mouse or keyboard on a terminal server. Frequently asked questions regarding this vulnerability can be found at http://www.microsoft.com/technet/security/bulletin/fq99-024.mspx",
        "extra": "The IOCTLs that are used to obtain services from the keyboard and mouse drivers in Windows NT do not require that the calling program have administrative privileges. A user-level program could use legitimate calls to disable the mouse and keyboard, after which the machine would need to be rebooted to restore normal service. On a terminal server, such a program could disable the keyboard and mouse on the console."
      }
    ],
    "CVE-1999-0777": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1999/ms99-039",
        "title": "Patch Available for \"Domain Resolution\" and \"FTP Download\" Vulnerabilities",
        "body": "Microsoft has released a patch that eliminates two security vulnerabilities in Microsoft® Internet Information Server (IIS) 4.0 and Microsoft Commercial Internet System (MCIS) 2.5. The vulnerabilities allow security restrictions in IIS and MCIS to be bypassed under certain conditions, as discussed below. Frequently asked questions regarding this vulnerability can be found at /technet/security/bulletin/fq99-039.mspx.",
        "extra": "There are two vulnerabilities at issue here: IIS 4.0 provides the ability to restrict access to a web site based on the user's domain. However, if IIS cannot resolve a user's IP address to a domain, it will grant the user's first request for a session. It will correctly deny them thereafter. This vulnerability affects IIS 4.0 only; it does not any other Microsoft product, including MCIS.A user who accesses an FTP site via a browser will be able to download files even if they are marked No Access. This vulnerability is due to a regression error that was introduced in hotfixes released after Windows NT 4.0 Service Pack 5; it does not exist in SP5 or in previous versions. This vulnerability affects both IIS 4.0 and MCIS 2.5, but no other Microsoft products. Neither vulnerability provides a means to usurp control of the server. A patch is available that eliminates both vulnerabilities."
      }
    ],
    "CVE-1999-0802": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1999/ms99-018",
        "title": "Patch Available for \"Malformed Favorites Icon\" Vulnerability",
        "body": "Microsoft has released a single patch that eliminates two security vulnerabilities in Microsoft® Internet Explorer 4.0 and 5. The first potentially could allow arbitrary code to be run on a user's computer. The second potentially could allow the local hard drive to be read. A fully supported patch is available to eliminate both vulnerabilities, and Microsoft recommends that affected customers download and install it, if appropriate.",
        "extra": "This update eliminates two vulnerabilities: The \"Malformed Favorites Icon\" vulnerability. The Favorites feature allows IE users to keep a list of their favorite web sites. In IE 5, the Favorites list can contain icons that are supplied by the associated web sites. However, there is an unchecked buffer in the implementation. A specially-malformed icon could overrun the buffer and be used to run arbitrary code on the user's computer. This vulnerability only affects IE 5 when run on Windows 95 or 98; it does not affect Windows NT systems.The \"Legacy ActiveX Control\" vulnerability. An ActiveX control that was used by previous versions of IE also was included in IE 4.0 and IE 5 even though it is not used by either. It could be misused to allow a web site to read the user's local hard drive. The update eliminates the vulnerability by removing the control. While there are no reports of customers being adversely affected by these vulnerabilities, Microsoft is proactively releasing the patch to allow customers to take appropriate action to protect themselves against it."
      }
    ],
    "CVE-1999-0839": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1999/ms99-051",
        "title": "Patch Available for \"IE Task Scheduler\" Vulnerability",
        "body": "Microsoft has released a version upgrade that eliminates a vulnerability in Microsoft® Internet Explorer 5. A vulnerability in an optional component could allow a malicious user to gain additional privileges on a Windows NT machine that allowed him or her to create or change files. Frequently asked questions regarding this vulnerability can be found at http://www.microsoft.com/technet/security/bulletin/fq99-051.mspx.",
        "extra": "IE 5 includes an Offline Browsing Pack that is not installed by default. The Offline Browsing Pack provides a Task Scheduler that replaces the native Windows NT Schedule Service (the schedule service is also known as the \"AT Service\"). A vulnerability in the Task Scheduler poses a privilege elevation risk and could allow normal users to execute code on the local machine in System context. (The Windows NT Schedule Service does not have this vulnerability). The IE 5 Task Scheduler controls who can create and submit \"AT jobs.\" The utility that is used to create AT jobs can only be run by an administrator, and the Task Scheduler will only execute AT jobs that are owned by administrators. However, if a malicious user had change access to an existing file owned by an administrator (it would not need to be an AT job), he or she could modify it to be a valid AT job and place in the appropriate folder for execution. This would bypass the control mechanism and allow the job to be executed. This vulnerability would primarily affect machines that allow normal users to interactively log onto them. The patch eliminates this vulnerability by digitally signing all AT jobs at creation time, and verifying the signature at execution time."
      }
    ],
    "CVE-1999-0867": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1999/ms99-029",
        "title": "Patch Available for \"Malformed HTTP Request Header\" Vulnerability",
        "body": "Microsoft has released a patch that eliminates a vulnerability in web server products that use Microsoft® Internet Information Server 4.0 as their web engine. The vulnerability could be used to mount denial of service attacks against the web server. This patch originally was released on August 11, 1999, but was found to contain a regression error. The regression error has been eliminated and the new patch is now available. Frequently asked questions regarding this vulnerability can be found at http://www.microsoft.com/technet/security/bulletin/fq99-029.mspx",
        "extra": "If multiple HTTP requests containing specially-malformed headers are sent to an affected server, IIS may consume all memory on the server. If this happens, IIS would be unable to service requests until either the clients that issued the requests were closed, or the IIS service were stopped and restarted. Once either of these actions have occurred, normal service would be restored."
      }
    ],
    "CVE-1999-0874": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1999/ms99-019",
        "title": "Patch Available for \"Malformed HTR Request\" Vulnerability",
        "body": "This is an update to Microsoft Security Bulletin MS99-019. There are no changes in the status of the vulnerability or the patch; the purpose of this update is to clarify the products that are affected by the vulnerability, and the specific steps that customers should take. In particular, customers should review the Affected Software Versions and What Customers Should Do sections below. Microsoft has released a patch that eliminates a vulnerability in Microsoft® Internet Information Server 4.0. (IIS 4.0 may be installed as a standalone product or as part of other Microsoft products). The vulnerability could allow denial of service attacks against an IIS server or, under certain conditions, could allow arbitrary code to be run on the server. Microsoft has received reports of customer sites being attacked via this vulnerability, and strongly encourages all affected customers to download and install the patch, if appropriate. The patch is fully supported.",
        "extra": "IIS supports several file types that require server-side processing. When a web site visitor requests a file of one of these types, an appropriate filter DLL processes it. A vulnerability exists in the way that .HTR, .STM and .IDC files are processed. The vulnerability involves an unchecked buffer in the filter DLLs for these file types. This poses two threats to safe operation. The first is a denial of service threat. A malformed request for an .HTR, .STM or .IDC file could overflow the buffer, causing IIS to crash. The server would not need to be rebooted, but IIS would need to be rebooted in order to resume service. The second threat is that a carefully-constructed file request could cause arbitrary code to execute on the server via a classic buffer overrun technique. Neither attack could occur accidentally. The vulnerability is present regardless of whether .HTR, .STM or .IDC files are present on the server. Microsoft is proactively releasing this patch to allow customers to take appropriate action to protect themselves against this vulnerability. In addition, web sites that do not require these file types can disable them altogether, as discussed in Microsoft's IIS Security Checklist."
      }
    ],
    "CVE-1999-0877": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1999/ms99-042",
        "title": "Patch Available for \"IFRAME ExecCommand\" Vulnerability",
        "body": "On October 11, 1999, Microsoft released the original version of this bulletin, in order to advise customers of a workaround for a vulnerability in Microsoft® Internet Explorer. The vulnerability could allow a malicious web site operator to read files on the computer of a user who visited the site, under certain circumstances. On October 15, 1999, Microsoft released a patch that eliminated the vulnerability. However, a regression error was subsequently discovered and corrected. The bulletin has been re-released to provide a corrected version of the patch. The regression affects only IE 5 users; IE 4 users do not need to re-apply the fix for this issue. The FAQ discusses the regression error in more detail. Frequently asked questions regarding this vulnerability can be found at http://www.microsoft.com/technet/security/bulletin/fq99-042.mspx.",
        "extra": "The Internet Explorer security model normally restricts the Document.ExecCommand() method to prevent it from taking inappropriate action on a user's computer. However, at least one of these restrictions is not present if the method is invoked on an IFRAME. This could allow a malicious web site operator to read the contents of files on visiting users' computers, if he or she knew the name of the file and the folder in which it resided. The vulnerability would not allow the malicious user to list the contents of folders, create, modify or delete files, or to usurp any administrative control over the machine. A patch that corrects this vulnerability is available at the location discussed below. This patch also includes the previously-released fix for the \"Download Behavior\" vulnerability."
      }
    ],
    "CVE-1999-0898": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1999/ms99-047",
        "title": "Patch Available for \"Malformed Spooler Request\" Vulnerability",
        "body": "Microsoft has released a patch that eliminates a security vulnerability in Microsoft® Windows NT® 4.0. The vulnerability could allow a user to cause the print spooler service to crash, or to run arbitrary code on a Windows NT machine. The patch also eliminates a vulnerability that could allow a user to substitute code of their choosing for a print provider that runs in a privileged state. Frequently asked questions regarding this vulnerability can be found at http://www.microsoft.com/technet/security/bulletin/fq99-047.mspx.",
        "extra": "Certain APIs in the Windows NT 4.0 print spooler subsystem have unchecked buffers. If an affected API were provided with random data as input, it could crash the print spooler service. If it were provided with a specially-malformed argument, it could be used to run arbitrary code on the server via a classic buffer overrun attack. The majority of the affected APIs require the caller to be a member of the Power Users or Administrators group; however, at least one is callable by normal users. None of the calls could be made by anonymous users, but the calls could be made remotely. A second vulnerability exists because incorrect permissions would allow a normal user to specify his or her own code as a print provider. Because print providers run in a local System context, this would allow the user to gain additional privileges on the local machine. This vulnerability could not be exploited remotely."
      }
    ],
    "CVE-1999-0899": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1999/ms99-047",
        "title": "Patch Available for \"Malformed Spooler Request\" Vulnerability",
        "body": "Microsoft has released a patch that eliminates a security vulnerability in Microsoft® Windows NT® 4.0. The vulnerability could allow a user to cause the print spooler service to crash, or to run arbitrary code on a Windows NT machine. The patch also eliminates a vulnerability that could allow a user to substitute code of their choosing for a print provider that runs in a privileged state. Frequently asked questions regarding this vulnerability can be found at http://www.microsoft.com/technet/security/bulletin/fq99-047.mspx.",
        "extra": "Certain APIs in the Windows NT 4.0 print spooler subsystem have unchecked buffers. If an affected API were provided with random data as input, it could crash the print spooler service. If it were provided with a specially-malformed argument, it could be used to run arbitrary code on the server via a classic buffer overrun attack. The majority of the affected APIs require the caller to be a member of the Power Users or Administrators group; however, at least one is callable by normal users. None of the calls could be made by anonymous users, but the calls could be made remotely. A second vulnerability exists because incorrect permissions would allow a normal user to specify his or her own code as a print provider. Because print providers run in a local System context, this would allow the user to gain additional privileges on the local machine. This vulnerability could not be exploited remotely."
      }
    ],
    "CVE-1999-0909": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1999/ms99-038",
        "title": "Patch Available for \"Spoofed Route Pointer\" Vulnerability",
        "body": "Microsoft has released a patch that eliminates a vulnerability in Microsoft® Windows® 95, 98 and Windows NT® 4.0 that could allow source routing to be performed, even if it has ostensibly been disabled. The patch also includes added functionality to provide additional control over source routing. Frequently asked questions regarding this vulnerability can be found at http://www.microsoft.com/technet/security/bulletin/fq99-038.mspx",
        "extra": "Windows NT 4.0 Service Pack 5 introduced the ability to disable source routing on a multi-homed Windows NT machine that acts as a router. However, even if source routing is disabled, it is possible to bypass it by including a specific type of incorrect information within the route pointer in the data packet. Windows 95 and 98 also provide this capability, and are affected by the same vulnerability. The patch restores correct operation to the anti-source routing feature. In addition, it provides additional functionality that enables source routing to be disabled on single-homed machines and on multi-homed machines that are not used as routers. Customers who are using multi-homed Windows or Windows NT machines to perform routing and who wish to disable source routing should apply the patch to ensure proper operation of the anti-source routing features. In addition, customers who have non-routing machines in vulnerable locations (for example, single-homed machines outside of a firewall or multi-homed machines joining two subnets) may wish to install the patch in order to use the new functionality to disable source routing in these cases as well."
      }
    ],
    "CVE-1999-0918": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1999/ms99-034",
        "title": "Patch Available for \"Fragmented IGMP Packet\" Vulnerability",
        "body": "Microsoft has released a patch that eliminates a vulnerability in the TCP/IP stack implementations of Microsoft® Windows® 95, Windows 98® and Windows NT® 4.0. Fragmented IGMP packets can cause a variety of problems in Windows 95 and 98, up to and including causing the machine to crash. Windows NT 4.0 contains the same vulnerability, but other system mechanisms make a successful attack much more difficult. Frequently asked questions regarding this vulnerability can be found at http://www.microsoft.com/technet/security/bulletin/fq99-034.mspx",
        "extra": "By sending fragmented IGMP packets to a Windows 95, 98 or Windows NT 4.0 machine, it is possible to disrupt the normal operation of the machine. This vulnerability primarily affects Windows 95 and 98 machines. Depending on a variety of factors, sending such packets to a Windows 95 or 98 machine may elicit behavior ranging from slow performance to crashing. Windows NT contains the same vulnerability, but other system mechanisms compensate and make it much more difficult to mount a successful attack."
      }
    ],
    "CVE-1999-0995": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1999/ms99-057",
        "title": "Patch Available for \"Malformed Security Identifier Request\" Vulnerability",
        "body": "Microsoft has released a patch that eliminates a vulnerability in Microsoft® Windows NT® 4.0. The vulnerability could allow a malicious user to cause a Windows NT machine to stop responding to requests for service. The patch for this vulnerability is included in the previously-released patch for the \"Syskey Keystream Reuse\" vulnerability; customers who have already applied it do not need to take any further action. Frequently asked questions regarding this vulnerability can be found at http://www.microsoft.com/technet/security/bulletin/fq99-057.mspx.",
        "extra": "The Windows NT Local Security Authority (LSA) provides a number of functions for enumerating and manipulating security information. One of these functions, LsaLookupSids(), is used to determine the Security Identifier (SID) associated with a particular user or group name. A flaw in the implementation of this function causes it to incorrectly handle certain types of invalid arguments. If an affected call were made to this function, it would cause the LSA to crash, thereby preventing the machine from performing useful work. An affected machine could be put back into service by rebooting, with the loss of any work that was in progress at the time. Remote attacks via this vulnerability would not be possible if NetBios is filtered at the firewall."
      }
    ],
    "CVE-1999-0999": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1999/ms99-059",
        "title": "Patch Available for \"Malformed TDS Packet Header\" Vulnerability",
        "body": "Microsoft has released a patch that eliminates a security vulnerability in Microsoft® SQL Server™ 7.0. The vulnerability could cause a SQL server to crash. Frequently asked questions regarding this vulnerability can be found at http://www.microsoft.com/technet/security/bulletin/fq99-059.mspx.",
        "extra": "If a specially-malformed TDS packet is sent to a SQL server, it can cause the server to crash. This vulnerability would not allow any inappropriate access to the data on the server, nor would it allow a malicious user to usurp any administrative control on the machine. An affected machine could be put back into service by restarting the SQL service. This vulnerability could only be remotely exploited if port 1433 were open at the firewall."
      }
    ],
    "CVE-1999-1011": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1999/ms99-025",
        "title": "Re-Release: Unauthorized Access to IIS Servers through ODBC Data Access with RDS",
        "body": "Microsoft has identified a vulnerability in Microsoft® Data Access Components (MDAC) that could allow a web site visitor to take unauthorized actions on a web site hosted using Internet Information Server. The vulnerability can be eliminated by reconfiguring or removing the affected components of MDAC. This vulnerability originally was reported in Microsoft Security Bulletin MS98-004, issued July 17, 1998. It was re-released on July 19, 1999, to remind customers of the need to address the vulnerability. It was updated on July 23, 1999, to discuss the need to remove sample files that are affected by the vulnerability, and to clarify that MDAC 2.0 is affected even if deployed as a clean installation. Frequently asked questions regarding this vulnerability can be found at http://www.microsoft.com/security/bulletin/fq99-025.mspx. The FAQ contains instructions for eliminating the vulnerability.",
        "extra": "The RDS DataFactory object, a component of Microsoft Data Access Components (MDAC), exposes unsafe methods. When installed on a system running Internet Information Server 3.0 or 4.0, the DataFactory object may permit an otherwise unauthorized web user to perform privileged actions, including: Allowing unauthorized users to execute shell commands on the IIS system as a privileged user.On a multi-homed Internet-connected IIS system, using MDAC to tunnel SQL and other ODBC data requests through the public connection to a private back-end network.Allowing unauthorized accessing to secured, non-published files on the IIS system."
      },
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1998/ms98-004",
        "title": "Unauthorized ODBC Data Access with RDS and IIS",
        "body": "Remote Data Service (RDS) is a component of Microsoft® Data Access Components (MDAC), which is installed by default when Windows NT® Server's Internet Information Service (IIS) 4.0 is installed through the Microsoft Windows NT Option Pack. The goal of the RDS component is to enable controlled Internet access to remote data resources through the Windows NT's IIS. However, because the RDS DataFactory (a single component of RDS) allows implicit remoting of data access requests by default, it can be exploited to allow unauthorized Internet clients to access OLE database (DB) datasources available to the server. The implicit remoting function of the RDS 1.5 through the DataFactory component should be disabled. The purpose of this bulletin is to inform Microsoft customers of this issue, its applicability to Microsoft products, and the availability of countermeasures that Microsoft has developed to further secure its customers. This issue was discovered by the Microsoft development team and documented in Microsoft Knowledge Base article 184375 on April 22, 1998.",
        "extra": "A Web client connecting to a Windows NT IIS server can use the RDS DataFactory object to direct that server to access data using an installed OLE DB provider. This includes executing SQL Server™ calls to ODBC-compliant databases using the ODBC drivers installed on the server. For example a Web-client could issue a SQL command along with the name or Internet Protocol (IP) address of a remote SQL Server system, a SQL account and password, database name, and a SQL query string. If the request is valid (the remote server is reachable by the Windows NT IIS server, the user account and password are correct, and the database name is valid), the query results will be sent through HTTP back to the client. Although it is true that this requires significant inside information, the potential accessibility of this information should not be underestimated; organizations that don't practice good computing practices could have blank or easy-to-guess passwords on their SQL administrator accounts. The RDS DataFactory object along with other installed ODBC drivers opens other possibilities, including possible access to non-published files on the Windows NT IIS server. The risk of security vulnerability caused by the DataFactory is even greater if newer OLE DB Providers are installed on the server. \"Microsoft DataShape Provider\" and \"Microsoft JET OLE DB provider\" (which ship with MDAC 2.0 in Visual Studio™ 98) allow shell commands to be executed. If the DataFactory is enabled on such a server, Internet clients can use these providers to execute shell commands, which can potentially bring down the server or otherwise severely affect its performance."
      }
    ],
    "CVE-2000-0258": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2000/ms00-023",
        "title": "Patch Available for \"Myriad Escaped Characters\" Vulnerability",
        "body": "Microsoft has released a patch that eliminates a security vulnerability in Microsoft® Internet Information Server. The vulnerability could allow a malicious user to slow a web server's response or prevent it from providing service altogether for a period of time. Frequently asked questions regarding this vulnerability and the patch can be found at http://www.microsoft.com/technet/security/bulletin/fq00-023.mspx",
        "error": true,
        "extra": "Special characters can be embedded in URLs by use of so-called escaped character sequences. By providing a specially-malformed URL with an extremely large number of escaped characters, a malicious user could arbitrarily increase the work factor associated with parsing the escaped characters, thereby consuming much or all of the CPU availability on the server and preventing useful work from being done. The vulnerability does not provide any capability to cause the server to fail, or to add, change or delete data on it. The slowdown would only last until the URL had been processed, at which point service would return to normal."
      }
    ],
    "CVE-2000-0305": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2000/ms00-029",
        "title": "Patch Available for \"IP Fragment Reassembly\" Vulnerability",
        "body": "Microsoft has released a patch that eliminates a security vulnerability in Microsoft® Windows® 95, Windows 98, Windows NT® 4.0 and Windows 2000. The vulnerability could be used to cause an affected machine to temporarily stop performing useful work. Frequently asked questions regarding this vulnerability and the patch can be found at http://www.microsoft.com/technet/security/bulletin/fq00-029.mspx",
        "error": true,
        "extra": "The affected systems contain a flaw in the code that performs IP fragment reassembly. If a continuous stream of fragmented IP datagrams with a particular malformation were sent to an affected machine, it could be made to devote most or all of its CPU availability to processing them. The data rate needed to completely deny service varies depending on the machine and network conditions, but in most cases even relatively moderate rates would suffice. The vulnerability would not allow a malicious user to compromise data on the machine or usurp administrative control over it. Although it has been reported that the attack in some cases will cause an affected machine to crash, affected machines in all Microsoft testing returned to normal service shortly after the fragments stopped arriving. Machines protected by a proxy server or a firewall that drops fragmented packets would not be affected by this vulnerability. The machines most likely to be affected by this vulnerability would be machines located on the edge of a network such as web servers or proxy servers."
      }
    ],
    "CVE-2001-0153": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2001/ms01-018",
        "title": "Visual Studio VB T-SQL Object Contains Unchecked Buffer",
        "body": "Who should read this bulletin:Customers running either Visual Studio 6.0 Enterprise or Visual Basic 6.0 Enterprise Edition Impact of vulnerability:Run code of attacker's choice. Recommendation:Customers running either Visual Studio 6.0 Enterprise or Visual Basic 6.0 Enterprise Edition should install this patch. Affected Software: Microsoft Visual Studio 6.0 Enterprise EditionMicrosoft Visual Basic 6.0 Enterprise Edition",
        "error": true,
        "extra": "Technical description: The VB T-SQL debugger object that ships with Visual Studio 6.0 or Visual Basic 6.0 Enterprise Edition has an unchecked buffer in the code that processes parameters for one of the object's methods. The object can, by design, be programmatically accessed remotely. If the object were to be referenced by a program that contained specially malformed data within the parameter, either of two outcomes would result. In the less serious case, the attacker could cause the object to fail on the hosting machine. In the more serious case, the attacker could exploit the buffer overrun to run code of the attacker's choice on the hosting machine. The debugger object (vbsdicli.exe) is installed by default with Visual Studio 6.0 or Visual Basic 6.0 Enterprise Edition and runs in the context of the interactively logged-on user. The attacker could only execute a successful attack if he knew that a user had the component installed and that the user was logged in at the time of the attack."
      }
    ],
    "CVE-2001-0509": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2001/ms01-041",
        "title": "Malformed RPC Request Can Cause Service Failure",
        "body": "Who should read this bulletin:System administrators using Microsoft® Windows NT® 4.0, Windows® 2000, SQL Server™, or Exchange Server. Impact of vulnerability:Denial of service Recommendation:System administrators consider applying the patches for any affected products they have installed. Affected Software: Microsoft Exchange Server 5.0Microsoft Exchange Server 5.5Microsoft Exchange 2000 ServerMicrosoft SQL Server 7.0Microsoft SQL Server 2000Microsoft Windows NT 4.0Microsoft Windows 2000",
        "error": true,
        "extra": "Technical description: Subsequent to the release of this bulletin, it was determined that the vulnerability addressed also affects Exchange Server 5.0. Microsoft has updated the bulletin with additional information about Exchange Server 5.0 and also to direct users to a security update for this additional affected platform. This security update for Exchange 5.0 is a cumulative rollup package that also addresses the vulnerabilities discussed in MS00-082 and MS03-046. You need only install this security update once to be protected against all three vulnerabilities. Several of the RPC servers associated with system services in Microsoft Exchange Server, SQL Server, Windows NT 4.0 and Windows 2000 do not adequately validate inputs, and in some cases will accept invalid inputs that prevent normal processing. The specific input values at issue here vary from RPC server to RPC server. An attacker who sent such inputs to an affected RPC server could disrupt its service. The precise type of disruption would depend on the specific service, but could range in effect from minor (e.g., the service temporarily hanging) to major (e.g., the service failing in a way that would require the entire system to be restarted)."
      }
    ],
    "CVE-2002-0070": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2002/ms02-014",
        "title": "Unchecked Buffer in Windows Shell Could Lead to Code Execution",
        "body": "Who should read this bulletin:Users of Microsoft® Windows® 98, 98SE, Windows NT® 4.0, Windows 2000 Impact of vulnerability:Run code of an attacker's choice Maximum Severity Rating:Moderate Recommendation:Customers should apply the patch Affected Software: Microsoft Windows 98Microsoft Windows 98 Second EditionMicrosoft Windows NT 4.0Microsoft Windows NT 4.0 Terminal Server EditionMicrosoft Windows 2000",
        "error": true,
        "extra": "Technical description: The Windows Shell is responsible for providing the basic framework of the Windows user interface experience. It is most familiar to users as the Windows Desktop, but also provides a variety of other functions to help define the user's computing session, including organizing files and folders, and providing the means to start applications. An unchecked buffer exists in one of the functions that helps to locate incompletely removed applications on the system. A security vulnerability results because it is possible for a malicious user to mount a buffer overrun attack and attempt to exploit this flaw. A successful attack would have the effect of either causing the Windows Shell to crash, or causing code to run in the user's context. By default, this is not remotely exploitable. However, under very unusual conditions, it could be exploited via a web page. Specifically, if the user has installed, then uninstalled an application with custom URL handlers, and the application's uninstall routine failed to correctly remove the application completely, an attacker could attempt to mount an attack by constructing an HTML web page that seeks to overrun the buffer. Such a web page could be delivered either by posting it on a web site or sending it by email."
      }
    ],
    "CVE-1999-0891": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/1999/ms99-040",
        "title": "Patch Available for \"Download Behavior\" Vulnerability",
        "body": "On September 28, 1999, Microsoft released the original version of this bulletin, in order to provide a workaround for a security vulnerability in Microsoft® Internet Explorer 5 that could allow a malicious web site operator to read files on the computer of a person who visited the site. Microsoft has completed a patch that completely eliminates the vulnerability, and has re-released this bulletin in order to advise customers of its availability. Frequently asked questions regarding this vulnerability can be found at http://www.microsoft.com/technet/security/bulletin/fq99-040.mspx.",
        "extra": "IE 5 includes a feature called \"download behavior\" that allows web page authors to download files for use in client-side script. By design, a web site should only be able to download files that reside in its domain; this prevents client-side code from exposing files on the user's machine or local intranet to the web site. However, a server-side redirect can be used to bypass this restriction, thereby enabling a malicious web site operator to read files on the user's machine or the user's local intranet. This vulnerability would chiefly affect workstations that are connected to the Internet."
      }
    ],
    "CVE-2002-0012": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2002/ms02-006",
        "title": "Unchecked Buffer in SNMP Service Could Enable Arbitrary Code to be Run",
        "body": "Who should read this bulletin:System administrators who use Simple Network Management Protocol to manage Microsoft® Windows® 95, 98, 98SE, Windows NT® 4.0, Windows 2000 or Windows XP systems Impact of vulnerability:Denial of Service, potentially run code of attacker's choice Maximum Severity Rating:Moderate Recommendation:Customers using SNMP on Windows 2000 and Windows XP should apply the patch. All other customers should disable SNMP service if running; apply patch when available Affected Software: Microsoft Windows 95Microsoft Windows 98Microsoft Windows 98SEMicrosoft Windows NT 4.0Microsoft Windows NT 4.0 Server, Terminal Server EditionMicrosoft Windows 2000Microsoft Windows XP",
        "error": true,
        "extra": "Technical description: On February 12 2002, Microsoft released the original version of this bulletin. In it, we detailed a work-around procedure that customers could implement to protect themselves against a publicly disclosed vulnerability. An updated version of this bulletin was released on February 15, 2002, to announce the availability of the patch for Windows 2000 and Windows XP and to advise customers that the work-around procedure is no longer needed on those platforms. Patches for additional platforms are forthcoming and this bulletin will be re-released to annouce their availability. On March 5, 2002, Microsoft released an updated version of the bulletin annoucing the availability of a patch for Windows NT 4.0 and to advise customers that the work-around procedure is no longer needed for that platform. Patches for additional platforms are forthcoming and this bulletin will be re-released to annouce their availability. On March 11, 2002, Microsoft released an updated version of the bulletin annoucing the availability of a patch for Windows NT 4.0 Terminal Server Edition and to advise customers that the work-around procedure is no longer needed for that platform. Patches for additional platforms are forthcoming and this bulletin will be re-released to annouce their availability. On March 14, 2002, Microsoft discovered that the English and German patches for Windows NT 4.0 Terminal Server Edition contained incorrect files. We have corrected this error and posted updates versions of this patch for these languages. We recommend that customers who have downloaded the Windows NT 4.0 Terminal Server Edition patch in English or German prior to March 14, 2002 install the updated version. Customers who have installed the Windows NT 4.0 Terminal Server Edition patches in any language other than English or German do not need to take any action: these patches do not contain the error. On April 26, 2002, Microsoft released an updated version of the bulletin annoucing the availability of a patch for Windows 98 and Windows 98SE and to advise customers that the work-around procedure is no longer needed for that platform. Simple Network Management Protocol (SNMP) is an Internet standard protocol for managing disparate network devices such as firewalls, computers, and routers. All versions of Windows except Windows ME provide an SNMP implementation, which is neither installed nor running by default in any version. A buffer overrun is present in all implementations. By sending a specially malformed management request to a system running an affected version of the SNMP service, an attacker could cause a denial of service. In addition, it is possible that he could cause code to run on the system in LocalSystem context. This could potentially give the attacker the ability to take any desired action on the system."
      }
    ],
    "CVE-2002-0013": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2002/ms02-006",
        "title": "Unchecked Buffer in SNMP Service Could Enable Arbitrary Code to be Run",
        "body": "Who should read this bulletin:System administrators who use Simple Network Management Protocol to manage Microsoft® Windows® 95, 98, 98SE, Windows NT® 4.0, Windows 2000 or Windows XP systems Impact of vulnerability:Denial of Service, potentially run code of attacker's choice Maximum Severity Rating:Moderate Recommendation:Customers using SNMP on Windows 2000 and Windows XP should apply the patch. All other customers should disable SNMP service if running; apply patch when available Affected Software: Microsoft Windows 95Microsoft Windows 98Microsoft Windows 98SEMicrosoft Windows NT 4.0Microsoft Windows NT 4.0 Server, Terminal Server EditionMicrosoft Windows 2000Microsoft Windows XP",
        "error": true,
        "extra": "Technical description: On February 12 2002, Microsoft released the original version of this bulletin. In it, we detailed a work-around procedure that customers could implement to protect themselves against a publicly disclosed vulnerability. An updated version of this bulletin was released on February 15, 2002, to announce the availability of the patch for Windows 2000 and Windows XP and to advise customers that the work-around procedure is no longer needed on those platforms. Patches for additional platforms are forthcoming and this bulletin will be re-released to annouce their availability. On March 5, 2002, Microsoft released an updated version of the bulletin annoucing the availability of a patch for Windows NT 4.0 and to advise customers that the work-around procedure is no longer needed for that platform. Patches for additional platforms are forthcoming and this bulletin will be re-released to annouce their availability. On March 11, 2002, Microsoft released an updated version of the bulletin annoucing the availability of a patch for Windows NT 4.0 Terminal Server Edition and to advise customers that the work-around procedure is no longer needed for that platform. Patches for additional platforms are forthcoming and this bulletin will be re-released to annouce their availability. On March 14, 2002, Microsoft discovered that the English and German patches for Windows NT 4.0 Terminal Server Edition contained incorrect files. We have corrected this error and posted updates versions of this patch for these languages. We recommend that customers who have downloaded the Windows NT 4.0 Terminal Server Edition patch in English or German prior to March 14, 2002 install the updated version. Customers who have installed the Windows NT 4.0 Terminal Server Edition patches in any language other than English or German do not need to take any action: these patches do not contain the error. On April 26, 2002, Microsoft released an updated version of the bulletin annoucing the availability of a patch for Windows 98 and Windows 98SE and to advise customers that the work-around procedure is no longer needed for that platform. Simple Network Management Protocol (SNMP) is an Internet standard protocol for managing disparate network devices such as firewalls, computers, and routers. All versions of Windows except Windows ME provide an SNMP implementation, which is neither installed nor running by default in any version. A buffer overrun is present in all implementations. By sending a specially malformed management request to a system running an affected version of the SNMP service, an attacker could cause a denial of service. In addition, it is possible that he could cause code to run on the system in LocalSystem context. This could potentially give the attacker the ability to take any desired action on the system."
      }
    ],
    "CVE-2002-0049": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2002/ms02-003",
        "title": "Exchange 2000 System Attendant Incorrectly Sets Remote Registry Permissions",
        "body": "Who should read this bulletin:System administrators using Microsoft® Exchange 2000. Impact of vulnerability:Less Secure Default Settings. Maximum Severity Rating:Low Recommendation:Administrators should apply the patch. Affected Software: Microsoft Exchange Server 2000",
        "error": true,
        "extra": "Technical description: The Microsoft Exchange System Attendant is one of the core services in Microsoft Exchange. It performs a variety of functions related to the on-going maintenance of the Exchange system. To allow remote administration of an Exchange Server using the Exchange System Manager Microsoft Management Console (MMC) snap in, the System Attendant makes changes to the permissions on the Windows Registry to allow Exchange Administrators to remotely update configuration settings stored in the Registry. There is a flaw in how the System Attendant makes these Registry configuration changes. This flaw could allow an unprivileged user to remotely access configuration information on the server. Specifically, this flaw inappropriately gives the \"Everyone\" group privileges to the WinReg key. This key controls the ability of users and groups to remotely connect to the Registry. By default, only Administrators are given the ability to remotely connect to the Registry, by granting permissions on this key. The flaw does not grant any abilities beyond the ability to connect remotely. However, an attacker's ability to make changes to the Registry once they have successfully connected would be dictated by the permissions on the specific keys within the Registry itself. Thus, while this vulnerability does not itself give an attacker the ability to change Registry settings, it could be used in conjunction with inappropriately permissive registry settings to gain access to, and make changes to a systems Registry."
      }
    ],
    "CVE-2002-0053": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2002/ms02-006",
        "title": "Unchecked Buffer in SNMP Service Could Enable Arbitrary Code to be Run",
        "body": "Who should read this bulletin:System administrators who use Simple Network Management Protocol to manage Microsoft® Windows® 95, 98, 98SE, Windows NT® 4.0, Windows 2000 or Windows XP systems Impact of vulnerability:Denial of Service, potentially run code of attacker's choice Maximum Severity Rating:Moderate Recommendation:Customers using SNMP on Windows 2000 and Windows XP should apply the patch. All other customers should disable SNMP service if running; apply patch when available Affected Software: Microsoft Windows 95Microsoft Windows 98Microsoft Windows 98SEMicrosoft Windows NT 4.0Microsoft Windows NT 4.0 Server, Terminal Server EditionMicrosoft Windows 2000Microsoft Windows XP",
        "error": true,
        "extra": "Technical description: On February 12 2002, Microsoft released the original version of this bulletin. In it, we detailed a work-around procedure that customers could implement to protect themselves against a publicly disclosed vulnerability. An updated version of this bulletin was released on February 15, 2002, to announce the availability of the patch for Windows 2000 and Windows XP and to advise customers that the work-around procedure is no longer needed on those platforms. Patches for additional platforms are forthcoming and this bulletin will be re-released to annouce their availability. On March 5, 2002, Microsoft released an updated version of the bulletin annoucing the availability of a patch for Windows NT 4.0 and to advise customers that the work-around procedure is no longer needed for that platform. Patches for additional platforms are forthcoming and this bulletin will be re-released to annouce their availability. On March 11, 2002, Microsoft released an updated version of the bulletin annoucing the availability of a patch for Windows NT 4.0 Terminal Server Edition and to advise customers that the work-around procedure is no longer needed for that platform. Patches for additional platforms are forthcoming and this bulletin will be re-released to annouce their availability. On March 14, 2002, Microsoft discovered that the English and German patches for Windows NT 4.0 Terminal Server Edition contained incorrect files. We have corrected this error and posted updates versions of this patch for these languages. We recommend that customers who have downloaded the Windows NT 4.0 Terminal Server Edition patch in English or German prior to March 14, 2002 install the updated version. Customers who have installed the Windows NT 4.0 Terminal Server Edition patches in any language other than English or German do not need to take any action: these patches do not contain the error. On April 26, 2002, Microsoft released an updated version of the bulletin annoucing the availability of a patch for Windows 98 and Windows 98SE and to advise customers that the work-around procedure is no longer needed for that platform. Simple Network Management Protocol (SNMP) is an Internet standard protocol for managing disparate network devices such as firewalls, computers, and routers. All versions of Windows except Windows ME provide an SNMP implementation, which is neither installed nor running by default in any version. A buffer overrun is present in all implementations. By sending a specially malformed management request to a system running an affected version of the SNMP service, an attacker could cause a denial of service. In addition, it is possible that he could cause code to run on the system in LocalSystem context. This could potentially give the attacker the ability to take any desired action on the system."
      }
    ],
    "CVE-2002-0649": [
      {
        "url": "https://docs.microsoft.com/en-us/security-updates/securitybulletins/2002/ms02-039",
        "title": "Buffer Overruns in SQL Server 2000 Resolution Service Could Enable Code Execution (Q323875)",
        "body": "Who should read this bulletin:System administrators using Microsoft® SQL Server™ 2000 and Microsoft Desktop Engine 2000. Impact of vulnerability:Three vulnerabilities, the most serious of which could enable an attacker to gain control over an affected server. Maximum Severity Rating:Critical Recommendation:System administrators should install the patch immediately. Note: The patch released with this bulletin is effective in protecting SQL Server 2000 and MSDE 2000 against the \"SQL Slammer\" worm virus. However, this patch has been superseded by the patch released with MS02-061 which contains fixes for additional security vulnerabilities in these products. Microsoft recommends that SQL 2000 and MSDE 2000 customers apply the patch from MS02-061. Affected Software: Microsoft SQL Server 2000Microsoft Desktop Engine (MSDE) 2000",
        "error": true,
        "extra": "Technical description: This security patch does not contain a patch from Microsoft Knowledge Base Article 317748 that is required to ensure normal operation of SQL Server 2000 and MSDE 2000. If you have applied this security patch to a SQL Server 2000 or MSDE 2000 installation prior to applying the hotfix from Microsoft Knowledge Patch article 317748, you must answer \"no\" if and when prompted to overwrite files to ensure that you do not overwrite files from the security patch. SQL Server 2000 and MSDE 2000 introduce the ability to host multiple instances of SQL Server on a single physical machine. Each instance operates for all intents and purposes as though it was a separate server. However, the multiple instances cannot all use the standard SQL Server session port (TCP 1433). While the default instance listens on TCP port 1433, named instances listen on any port assigned to them. The SQL Server Resolution Service, which operates on UDP port 1434, provides a way for clients to query for the appropriate network endpoints to use for a particular SQL Server instance. There are three security vulnerabilities here. The first two are buffer overruns. By sending a carefully crafted packet to the Resolution Service, an attacker could cause portions of system memory (the heap in one case, the stack in the other) to be overwritten. Overwriting it with random data would likely result in the failure of the SQL Server service; overwriting it with carefully selected data could allow the attacker to run code in the security context of the SQL Server service. The third vulnerability is a denial of service vulnerability. SQL uses a keep-alive mechanism to distinguish between active and passive instances. It is possible to create a keep-alive packet that, when sent to the Resolution Service, will cause SQL Server 2000 to respond with the same information. An attacker who created such a packet, spoofed the source address so that it appeared to come from a one SQL Server 2000 system, and sent it to a neighboring SQL Server 2000 system could cause the two systems to enter a never-ending cycle of keep-alive packet exchanges. This would consume resources on both systems, slowing performance considerably."
      }
    ]
  }
}